{
    "ocd-bill/066c0d7a-1662-411d-8f8c-2dd735eb70f0": {
        "id": "ocd-bill/066c0d7a-1662-411d-8f8c-2dd735eb70f0",
        "state": "Pennsylvania",
        "title": "A Resolution recognizing the impact of the East Palestine, Ohio, train derailment on residents of this Commonwealth.",
        "chamber": "Senate",
        "created_date": "2023-03-07",
        "link": "http://www.legis.state.pa.us/CFDOCS/Legis/PN/Public/btCheck.cfm?txtType=HTM&sessYr=2023&sessInd=0&billBody=S&billTyp=R&billNbr=0059&pn=0389",
        "text": "\n\n Regular Session 2023-2024 Senate Resolution 0059 P.N. 0389\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n PRINTER'S NO.  389 THE GENERAL ASSEMBLY OF PENNSYLVANIASENATE RESOLUTION No.59 Session of 2023 INTRODUCED BY MASTRIANO AND HUTCHINSON, MARCH 6, 2023 REFERRED TO VETERANS AFFAIRS AND EMERGENCY PREPAREDNESS, MARCH 6, 2023 A RESOLUTIONRecognizing the impact of the East Palestine, Ohio, train derailment on residents of this Commonwealth.WHEREAS, On February 3, 2023, at approximately 9:30 p.m., a 53-car train derailment occurred near the border of Pennsylvania in East Palestine, Ohio, and Beaver County, Pennsylvania; andWHEREAS, Several of the cars carried at least five hazardous chemicals, including the cancer-causing vinyl chloride; andWHEREAS, On February 6, 2023, three days after the derailment and burning wreckage, authorities decided to fully release and burn the vinyl chloride, sending a massive plume of hydrogen chloride and the toxic gas phosgene into the air; andWHEREAS, It has been reported that hundreds of thousands of pounds of toxic chemicals spilled into the air, soil and water around East Palestine, Ohio; andWHEREAS, International, national, Statewide and local news reports brought attention to Pennsylvania residents experiencing burning lips, itchy eyes, rashes, headaches, diarrhea and other symptoms in the aftermath of the crash; and123456789101112131415161718\nWHEREAS, On February 23, 2023, the Veterans Affairs and Emergency Preparedness Committee of the Senate of the Commonwealth of Pennsylvania hosted a hearing at Beaver County Community College where local residents shared their stories of distressed evacuations, fears related to the chemical spill and fire, symptoms of health ailments, environmental impacts, fish, animals and birds affected and questions of Norfolk Southern; andWHEREAS, On February 28, 2023, subsequent to the establishment of a health clinic in East Palestine, Ohio, the Department of Health established a Health Resource Center in Beaver County with more than 200 residents visiting within the first two days; therefore be itRESOLVED, That the Senate of the Commonwealth of Pennsylvania recognize the environmental impact that the train derailment and subsequent chemical burn has had on the residents of Beaver County and call on Congress and the United States Department of Transportation to hold Norfolk Southern accountable; and be it furtherRESOLVED, That copies of this resolution be transmitted to all of the following:(1)  The United States Secretary of Transportation.(2)  Each member of Congress from Pennsylvania.20230SR0059PN0389  - 2 - 1234567891011121314151617181920212223\n\n\n\n"
    },
    "ocd-bill/3324a0ca-0fa0-44b1-9c93-c33063e30534": {
        "id": "ocd-bill/3324a0ca-0fa0-44b1-9c93-c33063e30534",
        "state": "Pennsylvania",
        "title": "A Resolution urging the United States Department of Agriculture to include 2% and whole milk in the Nutrition Standards for the National School Lunch and Breakfast Programs and as a Smart Snacks option and urging the United States Department of Health and Human Services to recommend to the Dietary Guidelines Advisory Committee to modify the milk standard to include 2% and whole milk.",
        "chamber": "Senate",
        "created_date": "2023-02-24",
        "link": "http://www.legis.state.pa.us/CFDOCS/Legis/PN/Public/btCheck.cfm?txtType=HTM&sessYr=2023&sessInd=0&billBody=S&billTyp=R&billNbr=0048&pn=0368",
        "text": "\n\n Regular Session 2023-2024 Senate Resolution 0048 P.N. 0368\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n PRINTER'S NO.  368 THE GENERAL ASSEMBLY OF PENNSYLVANIASENATE RESOLUTION No.48 Session of 2023 INTRODUCED BY BROOKS, VOGEL, ARGALL, COLEMAN, GEBHARD, AUMENT, PENNYCUICK, HUTCHINSON, J. WARD, ROTHMAN, YAW, LAUGHLIN, MARTIN, BAKER, ROBINSON, BARTOLOTTA, SCHWANK, PHILLIPS-HILL, STEFANO, L. WILLIAMS AND LANGERHOLC, FEBRUARY 24, 2023 REFERRED TO EDUCATION, FEBRUARY 24, 2023 A RESOLUTIONUrging the United States Department of Agriculture to include 2% and whole milk in the Nutrition Standards for the National School Lunch and Breakfast Programs and as a Smart Snacks option and urging the United States Department of Health and Human Services to recommend to the Dietary Guidelines Advisory Committee to modify the milk standard to include 2% and whole milk.WHEREAS, Congress passed the Healthy, Hunger-Free Kids Act of 2010 which put restrictive regulations on the consumption of whole milk in schools; andWHEREAS, In the first two years the Healthy, Hunger-Free Kids Act of 2010 was enacted, 1.2 million fewer students drank milk with their lunch, yet still had access to sugary drinks that offer little to no nutritional value; andWHEREAS, Implementation of the Healthy, Hunger-Free Kids Act of 2010 has had a negative health and nutrition impact on children and negative economic impacts in Pennsylvania; andWHEREAS, According to the Team Pennsylvania and Pennsylvania Department of Agriculture Economic Impact of Agriculture in 12345678910111213141516171819\nPennsylvania 2021 Update, agriculture supports 1 out of every 10 jobs in Pennsylvania; andWHEREAS, Pennsylvania's dairy industry represents a total of $8.3 billion in direct output with 6,100 dairy farms, which is second in the nation, and Pennsylvania ranks 6th nationally in dairy based on sales; andWHEREAS, The United States Department of Agriculture (USDA) is currently proposing updates to school meal standards to support healthier meals for kids; andWHEREAS, In addition to addressing nutrition standards, this rule proposes measures to strengthen the \"Buy American\" provision in the school meal programs; andWHEREAS, The USDA expects to issue a final rule in time for schools to plan for school year 2024-2025; andWHEREAS, The existing milk standard permits flavored and unflavored for all grades K-12 in only fat-free and low-fat milks, and requires unflavored milk to be offered at each school meal service; andWHEREAS, The proposed standard currently being offered consists of two options, both of which would include the new added sugars limit for flavored milk and maintain the requirement that unflavored milk is offered at each meal service: Option (1) allow only unflavored milk for grades K-8 and allow flavored and unflavored for grades 9-12 or allow only unflavored milk for grades K-5 and allow flavored and unflavored for grades 6-12, with both proposals being effective for school year 2025-2026, or Option (2) continue to allow flavored and unflavored milks for all grades K-12; andWHEREAS, Now is the time as a state legislature to encourage an even healthier option to be considered by passing a 20230SR0048PN0368  - 2 - 123456789101112131415161718192021222324252627282930\nresolution urging the USDA to also allow 2% and whole milk, both flavored and unflavored, to be offered in schools (K-12); andWHEREAS, With this change in standards, schools will have the option of making 2% and whole milk available to students without jeopardizing Federal funding; andWHEREAS, Testimony offered by Jayne Sebright, Director of the Center for Dairy Excellence, during a Senate Majority Policy Committee public hearing in June 2021, stated that about 75% of the milk sold in schools is in the form of flavored milk, and only 25% is unflavored, and, milk is the best food source for calcium, potassium and vitamin D, which many are most lacking in their diets; andWHEREAS, The health benefits of 2% and whole milk, whether flavored or unflavored, well exceeds the benefits of fat-free and low-fat milks; andWHEREAS, We should be encouraging students to consume 2% and whole milk rather than beverages that provide little-to-no nutritional value; andWHEREAS, A January 2020 New York Times article stating that \"Kids (between ages 1 and 18) who drink whole milk are 39% less likely to become overweight than those who drink lower-fat or skim milk\"; andWHEREAS, Whole milk contains no more than 3.5% fat, and one-third of milk's fatty acids are Omega-3, which have been linked to many health benefits, including improved heart and brain health, and a lower risk of cancer. This fat is necessary in the daily diet and energy to support cell growth. Other health benefits of milk include improved bone health, lower blood pressure, and reduced risk of cardiovascular disease and Type 2 diabetes; and20230SR0048PN0368  - 3 - 123456789101112131415161718192021222324252627282930\nWHEREAS, The results of a Union City Area School District milk choice survey concluded that offering increased milk options would result in a 50% increase in milk consumption, a 95% reduction in milk waste, that 63.6% of the students would chose milk more often if they had the option to choose which milk fits their needs, that 84.7% of the students drink whole milk at home, which is why they do not choose milk at school, and that offering two additional milk fat options within school meals can significantly change the amount of milk chosen, consumed and not discarded; andWHEREAS, The evidence is overwhelming that both 2% and whole milk should also be offered to students in schools; andWHEREAS, The United States Department of Health and Human Services coordinates with the USDA in developing the Dietary Guidelines for Americans; therefore be itRESOLVED, That the Senate of the Commonwealth of Pennsylvania urge the United States Department of Agriculture to include 2% and whole milk in the Nutrition Standards for the National School Lunch and Breakfast Programs and as a Smart Snacks option; and be it furtherRESOLVED, That the Senate of the Commonwealth of Pennsylvania urge the United States Department of Health and Human Services to recommend to the Dietary Guidelines Advisory Committee to permit modifications to the standard for the inclusion of 2% and whole milk; and be it furtherRESOLVED, That copies of this resolution be transmitted to the United States Department of Agriculture and the United States Department of Health and Human Services.20230SR0048PN0368  - 4 - 12345678910111213141516171819202122232425262728\n\n\n\n"
    },
    "ocd-bill/160adcf2-7a93-423d-8715-ec5d4aa703a7": {
        "id": "ocd-bill/160adcf2-7a93-423d-8715-ec5d4aa703a7",
        "state": "Pennsylvania",
        "title": "An Act designating a bridge, identified as Bridge Key 46706, carrying State Route 4001, also known as Iverson Road, over Stevens Run in Blacklick Township, Cambria County, as the PVT Donald D. Marsh Memorial Bridge.",
        "chamber": "Senate",
        "created_date": "2023-02-28",
        "link": "http://www.legis.state.pa.us/CFDOCS/Legis/PN/Public/btCheck.cfm?txtType=HTM&sessYr=2023&sessInd=0&billBody=S&billTyp=B&billNbr=0443&pn=0377",
        "text": "\n\n Regular Session 2023-2024 Senate Bill 0443 P.N. 0377\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n PRINTER'S NO.  377 THE GENERAL ASSEMBLY OF PENNSYLVANIASENATE BILL No.443 Session of 2023 INTRODUCED BY LANGERHOLC, FEBRUARY 27, 2023 REFERRED TO TRANSPORTATION, FEBRUARY 27, 2023 AN ACTDesignating a bridge, identified as Bridge Key 46706, carrying State Route 4001, also known as Iverson Road, over Stevens Run in Blacklick Township, Cambria County, as the PVT Donald D. Marsh Memorial Bridge.The General Assembly of the Commonwealth of Pennsylvania hereby enacts as follows:Section 1.  PVT Donald D. Marsh Memorial Bridge.(a)  Findings.--The General Assembly finds and declares as follows:(1)  PVT Donald D. Marsh was born April 5, 1924.(2)  PVT Marsh was from Nicktown, Pennsylvania.(3)  PVT Marsh attended Blacklick Township High School.(4)  PVT Marsh joined the United States Army on November 8, 1943.(5)  PVT Marsh was killed in action on October 31, 1944, during the World War II conflict with Axis forces in France.(6)  PVT Marsh was awarded the Purple Heart following his passing for his dedicated and honorable service to the United States.12345678910111213141516171819\n(b)  Designation.--The bridge, identified as Bridge Key 46706, carrying State Route 4001, also known as Iverson Road, over Stevens Run in Blacklick Township, Cambria County, is designated the PVT Donald D. Marsh Memorial Bridge.(c)  Signs.--The Department of Transportation shall erect and maintain appropriate signs displaying the name of the bridge to traffic in both directions on the bridge.Section 2.  Effective date.This act shall take effect in 60 days.20230SB0443PN0377  - 2 - 123456789\n\n\n\n"
    },
    "ocd-bill/61c6f9a3-21c6-4a5a-bd17-d747f5dd0f9b": {
        "id": "ocd-bill/61c6f9a3-21c6-4a5a-bd17-d747f5dd0f9b",
        "state": "Pennsylvania",
        "title": "An Act amending Title 51 (Military Affairs) of the Pennsylvania Consolidated Statutes, in Department of Military Affairs, establishing the PA VETConnect Program.",
        "chamber": "Senate",
        "created_date": "2023-02-25",
        "link": "http://www.legis.state.pa.us/CFDOCS/Legis/PN/Public/btCheck.cfm?txtType=HTM&sessYr=2023&sessInd=0&billBody=S&billTyp=B&billNbr=0447&pn=0370",
        "text": "\n\n Regular Session 2023-2024 Senate Bill 0447 P.N. 0370\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n PRINTER'S NO.  370 THE GENERAL ASSEMBLY OF PENNSYLVANIASENATE BILL No.447 Session of 2023 INTRODUCED BY MASTRIANO, DUSH, BARTOLOTTA AND SCHWANK, FEBRUARY 24, 2023 REFERRED TO VETERANS AFFAIRS AND EMERGENCY PREPAREDNESS, FEBRUARY 24, 2023 AN ACTAmending Title 51 (Military Affairs) of the Pennsylvania Consolidated Statutes, in Department of Military Affairs, establishing the PA VETConnect Program.The General Assembly of the Commonwealth of Pennsylvania hereby enacts as follows:Section 1.  Title 51 of the Pennsylvania Consolidated Statutes is amended by adding a section to read:§ 714   .    PA VETConnect Program   .  (a)  Establishment.--The    PA VETConnect Program    is established.(b)  Participants.--The program may include     Federal agencies,   State agencies, county directors of veterans' affairs,     veterans'   service organizations,    accredited postsecondary educational and   technical institutions, the health care provider community, businesses    and nonprofit organizations.   (c)  Purpose.--The program shall:(1)  Improve the health and well-being of veterans and the families of veterans through    referrals,    community   123456789101112131415161718\nengagement and consistent network communication.(2)  Organize participants under subsection (b) to cooperate with network partners to provide for proactive solutions to address the problems faced by veterans.(d)  Requirements.--Program requirements shall be determined by the department and information shall be disseminated to the greatest extent possible on how to best navigate and utilize available resources to improve the health and well-being of veterans and the families of veterans.(e)  Duties of department.--The department shall develop the program, which shall contain a mission statement that shall be clearly communicated to network     advocates,    partners and   participants under subsection (b). The department shall:(1)  Coordinate with Federal agencies, State agencies, county directors of veterans' affairs, veterans' service organizations, accredited postsecondary educational and technical institutions, the health care provider community, businesses and nonprofit organizations, identified by the department, that provide programs, initiatives, reintegration outreach and related services to veterans and the families of veterans.(2)  Provide Welcome Home to Pennsylvania information to recently separated service members.(3)  Provide information regarding program initiatives, resources, training opportunities, veterans' service organizations and services available to be utilized by individuals or groups who support veterans and their families as volunteers and offer outreach and support for veterans.(4)  Coordinate with county directors of veterans' affairs by providing information of veterans who request 20230SB0447PN0370  - 2 - 123456789101112131415161718192021222324252627282930\nsupport for Federal and State benefits and programs.(5)  Coordinate with veterans' service officers from veterans' service officer grant programs or other veterans' service officers to assist veterans in applying for Federal veteran benefits.Section 2.  This act shall take effect in 60 days.20230SB0447PN0370  - 3 - 123456\n\n\n\n"
    },
    "ocd-bill/6196af0c-f6c4-4290-b1bc-fe89b73c6fd0": {
        "id": "ocd-bill/6196af0c-f6c4-4290-b1bc-fe89b73c6fd0",
        "state": "Pennsylvania",
        "title": "An Act amending Title 75 (Vehicles) of the Pennsylvania Consolidated Statutes, in equipment standards, further providing for unlawful activities; in other required equipment, further providing for restraint systems; and abrogating regulations.",
        "chamber": "Senate",
        "created_date": "2023-02-01",
        "link": "http://www.legis.state.pa.us/CFDOCS/Legis/PN/Public/btCheck.cfm?txtType=HTM&sessYr=2023&sessInd=0&billBody=S&billTyp=B&billNbr=0298&pn=0248",
        "text": "\n\n Regular Session 2023-2024 Senate Bill 0298 P.N. 0248\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n    \t        See other bills under thesame topic\r\n    \t    \n\n\n\n\n\n\n PRINTER'S NO.  248 THE GENERAL ASSEMBLY OF PENNSYLVANIASENATE BILL No.298 Session of 2023 INTRODUCED BY ROBINSON, LANGERHOLC, BOSCOLA, MARTIN, REGAN, COLEMAN, FARRY, LAUGHLIN, STEFANO, HUTCHINSON, BAKER, FLYNN AND KANE, JANUARY 31, 2023 REFERRED TO TRANSPORTATION, JANUARY 31, 2023 AN ACTAmending Title 75 (Vehicles) of the Pennsylvania Consolidated Statutes, in equipment standards, further providing for unlawful activities; and abrogating regulations.The General Assembly of the Commonwealth of Pennsylvania hereby enacts as follows:Section 1.  Section 4107(a)(1) and (b) introductory paragraph of Title 75 of the Pennsylvania Consolidated Statutes are amended and the section is amended by adding a subsection to read:§ 4107.  Unlawful activities.(a)  Violation of vehicle equipment standards.--(1)  [It] Except as otherwise provided, it is unlawful for any person to sell, offer for sale, lease, install or replace, either separately or as part of the equipment of a vehicle, any item of vehicle equipment affecting the operation of the vehicle which does not comply with this title or regulations promulgated thereunder, or which does not comply with an applicable Federal motor vehicle safety 123456789101112131415161718\nstandard adopted by regulation by the department.* * *(b)  Other violations.--[It] Except as otherwise provided, it is unlawful for any person to do any of the following:* * *(b.2)  Vehicle doors.--If a vehicle is equipped from the original manufacturer with manufacturer designed and installed removable doors, that vehicle may be operated on the roadways of this Commonwealth with the doors removed. This subsection shall not limit or otherwise impact section 4534 (relating to rearview mirrors) or 4581 (relating to restraint systems).* * *Section 2.  Any regulations or parts of regulations that are inconsistent with this act are abrogated to the extent of the inconsistency.Section 3.  This act shall take effect in 60 days.20230SB0298PN0248  - 2 - 12345678910111213141516\n\n\n\n"
    },
    "ocd-bill/bc6967b0-3eee-46aa-a27a-9bb946861cef": {
        "id": "ocd-bill/bc6967b0-3eee-46aa-a27a-9bb946861cef",
        "state": "Pennsylvania",
        "title": "An Act amending Title 51 (Military Affairs) of the Pennsylvania Consolidated Statutes, in military educational programs relating to medical officer or health officer incentive program, further providing for definitions, for establishment of program, for program stipend, for additional incentives, for recoupment of incentive payments and for adjustment of stipend amounts; and making editorial changes.",
        "chamber": "Senate",
        "created_date": "2023-01-17",
        "link": "http://www.legis.state.pa.us/CFDOCS/Legis/PN/Public/btCheck.cfm?txtType=HTM&sessYr=2023&sessInd=0&billBody=S&billTyp=B&billNbr=0162&pn=0043",
        "text": "\n\n Regular Session 2023-2024 Senate Bill 0162 P.N. 0043\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n    \t        See other bills under thesame topic\r\n    \t    \n\n\n\n\n\n\n PRINTER'S NO.  43 THE GENERAL ASSEMBLY OF PENNSYLVANIASENATE BILL No.162 Session of 2023 INTRODUCED BY HUTCHINSON, KANE, MASTRIANO, PENNYCUICK, BARTOLOTTA, STEFANO AND J. WARD, JANUARY 17, 2023 REFERRED TO VETERANS AFFAIRS AND EMERGENCY PREPAREDNESS, JANUARY 17, 2023 AN ACTAmending Title 51 (Military Affairs) of the Pennsylvania Consolidated Statutes, in military educational programs relating to medical officer or health officer incentive program, further providing for definitions, for establishment of program, for program stipend, for additional incentives, for recoupment of incentive payments and for adjustment of stipend amounts; and making editorial changes.The General Assembly of the Commonwealth of Pennsylvania hereby enacts as follows:Section 1.  The heading of Subchapter B of Chapter 32 and sections 3211, 3212, 3213, 3214, 3216 and 3217 of Title 51 of the Pennsylvania Consolidated Statutes are amended to read:SUBCHAPTER BMEDICAL OFFICER OR HEALTH CAREOFFICER INCENTIVE PROGRAM§ 3211.  Definitions.The following words and phrases when used in this subchapter shall have the meanings given to them in this section unless the context clearly indicates otherwise:[\"Behavioral health officer.\"  An officer who:1234567891011121314151617181920\n(1)  holds a license to practice psychology under the act of March 23, 1972 (P.L.136, No.52), known as the Professional Psychologists Practice Act, or is a licensed clinical social worker as defined in section 3 of the act of July 9, 1987 (P.L.220, No.39), known as the Social Workers, Marriage and Family Therapists and Professional Counselors Act;(2)  has malpractice insurance, is self-insured or maintains insurance through a private employer; and(3)  meets any applicable Federal requirements for the Pennsylvania National Guard.\"Medical officer or health officer.\"  An officer who is any of the following:(1)  A resident physician.(2)  A physician.(3)  A physician assistant.(4)  A behavioral health officer.(5)  A public health officer or environmental science officer.]\"Health care officer.\"  An officer who serves in one of the United States Air Force's following health care professions:(1)  Doctor.(2)  Nurse.(3)  Dentist.(4)  Allied Health.(5)  Administration.\"Medical officer.\"  An officer who serves in one of the United States Army Medical Department's six corps:(1)  Dental Corps.(2)  Medical Corps.(3)  Medical Services Corps.20230SB0162PN0043  - 2 - 123456789101112131415161718192021222324252627282930\n(4)  Medical Specialist Corps.(5)  Nurse Corps.(6)  Veterinary Corps.\"Member in good standing.\"  A member of the Pennsylvania National Guard who meets all medical, training, physical and educational requirements for service and who is a satisfactory participant in all scheduled duties and training periods.[\"Physician.\"  An officer assigned to and serving in anauthorized Army Medical Corps or Air Force Medical Corps position who:(1)  has completed a medicine residency program; and(2)  is currently practicing medicine in the United States or its territories.\"Physician assistant.\"  An officer who:(1)  is licensed as a physician assistant under the act of December 20, 1985 (P.L.457, No.112), known as the Medical Practice Act of 1985; and(2)  meets any applicable Federal requirements for the Pennsylvania National Guard.]\"Program.\"  The Medical Officer or Health Care Officer Incentive Program.[\"Public health officer\" or \"environmental science officer.\" An officer who holds a minimum of a bachelor's degree from an educational program accredited by an agency recognized by the United States Secretary of Education in an environmental science related field of study, including any of the following majors or their equivalent:(1)  Environmental science, environmental health or environmental management.(2)  Occupational health.20230SB0162PN0043  - 3 - 123456789101112131415161718192021222324252627282930\n(3)  Industrial hygiene.(4)  Public health.(5)  Sanitary science or epidemiology.(6)  Biology, chemistry, toxicology, geology, microbiology, biochemistry or zoology.\"Resident physician.\"  An officer who:(1)  is assigned to a medical position in the Pennsylvania National Guard;(2)  is a medical doctor or doctor of osteopathy participating in graduate training;(3)  holds a license to practice medicine under the Medical Practice Act of 1985; and(4)  meets any applicable Federal requirements for the Pennsylvania National Guard.]§ 3212.  Establishment of program.The Medical Officer or Health Care Officer Incentive Program is established within the department to provide educational stipends to eligible medical officers or health care officers in accordance with the provisions of this subchapter.§ 3213.  Program stipend.(a)  General rule.--[(1)  A resident physician, physician or physician assistant who meets the requirements under subsection (c) may receive a stipend of $1,000 per month for no more than 48 months of medicine residency or the first 36 accession months of service to the Pennsylvania National Guard.(2)  A behavioral health officer, public health officer or environmental science officer who meets the requirements under subsection (c) may receive a stipend of $500 per month for no more than the first 36 accession months of service to 20230SB0162PN0043  - 4 - 123456789101112131415161718192021222324252627282930\nthe Pennsylvania National Guard.](3)  A medical officer or health care officer who is required to have obtained a doctoral degree for entry into the officer's military specialty and who meets the requirements under subsection (c) may receive a stipend of $1,000 per month for no more than 48 months of medicine residency or the first 36 accession months of service to the Pennsylvania National Guard.(4)  A medical officer or health care officer who is required to have obtained a master's degree for entry into the officer's military specialty who meets the requirements under subsection (c) may receive a stipend of $750 per month for no more than 48 months of medicine residency or the first 36 accession months of service to the Pennsylvania National Guard.(5)  A medical officer or health care officer who is required to have obtained a bachelor's degree for entry into the officer's military specialty who meets the requirements under subsection (c) may receive a stipend of $500 per month for no more than 48 months of medicine residency or the first 36 accession months of service to the Pennsylvania National Guard.(b)  Areas of concentration.--An area of concentration qualification for a medical or health officer must be approved by the National Guard Bureau through a predetermination request completed by the Pennsylvania Army National Guard Army Medical Department Officer Strength Manager or the Pennsylvania Air National Guard State Air Surgeon.(b.1)  Eligibility.--Medical officers and health care officers assigned to administrative, planning or logistical 20230SB0162PN0043  - 5 - 123456789101112131415161718192021222324252627282930\nconcentrations shall not be eligible for the program.(c)  Requirements.--In order to qualify for a stipend under subsection (a), a medical officer or health care officer shall meet all of the following:(1)  Be a member in good standing with the Pennsylvania National Guard.(2)  Be assigned to an appropriate medical or health position in the Pennsylvania National Guard.(3)  Agree to serve as a medical officer or health care officer in the Pennsylvania National Guard [after completion of residency or initial service obligation] for a period of one month for each monthly stipend received. This service obligation shall be concurrent with any other military service obligation of the officer.(4)  Meet Federal and State licensing requirements to practice within the officer's medical specialty within the Commonwealth of Pennsylvania.(5)  Meet any applicable Federal requirements for the Pennsylvania National Guard.(6)  Once licensed and eligible to be granted, maintain clinical privileges as awarded at the national guard level by the Centralized Credentials and Privileging Preparation Board (C2P2).(d)  Receipt of stipend.--A stipend under subsection (a) shall be paid to an eligible medical officer or health care officer whose application for the stipend is approved at the completion of each month of residency or service. A medical officer or health care officer may not receive a stipend under subsection (a) for more than 48 months during the period of service in the Pennsylvania National Guard.20230SB0162PN0043  - 6 - 123456789101112131415161718192021222324252627282930\n(e)  Adjustments.--If the Adjutant General determines that the amount available for the program in any year will be insufficient to provide stipends in the amount described under subsection (a), the Adjutant General may place a cap on the number of medical officers or health care officers eligible to receive stipends or may adjust the amount of the annual stipend.(f)  Construction.--Nothing in this section shall be construed to prohibit a medical officer or health care officer who is serving in the Pennsylvania National Guard before the effective date of this section and who meets the requirements under subsection (c) from receiving a stipend under subsection (a) during the period of [medicine] medical residency or service.§ 3214.  Additional incentives.To the extent that funds are available, the Adjutant General may, by regulation, establish additional incentives to aid in the recruitment and retention of medical officers or health care officers in the Pennsylvania National Guard, provided that payment of such additional incentives shall not result in a cap on participation or reduction in the amount of stipends paid under section 3213 (relating to program stipend).§ 3216.  Recoupment of incentive payments.(a)  General rule.--A recipient of a stipend or other incentive payment under this subchapter who fails to complete [his] the recipient's service obligation or to meet other requirements established by the Adjutant General is liable to the Commonwealth for repayment of all incentive payments made. The Adjutant General shall notify the department if the recipient fails to complete the service obligation, and the promissory note under section 3215 (relating to promissory note) 20230SB0162PN0043  - 7 - 123456789101112131415161718192021222324252627282930\nshall be called to secure payment in full upon demand on a schedule as the department may determine.(b)  Forgiveness of recoupment.--The Adjutant General may forgive recoupment of all or part of a recipient's stipend or other incentive payment if the Adjutant General determines that [his] the recipient's failure to fulfill the service obligation was the result of [his] the recipient's death, discharge because of disability incurred in line of duty, discharge because of a medical determination that [he] the recipient is medically unfit for duty when the medical condition is outside [his] the recipient's control and is not due to [his] the recipient's misconduct, mandatory discharge, release or retirement for age or years of service or discharge, release, transfer or retirement because of other compelling circumstances outside [his] the recipient's control.§ 3217.  Adjustment of stipend amounts.Beginning on January 1, [2016] 2024, and every [two] five years thereafter, the Adjutant General may adjust, by notice published in the Pennsylvania Bulletin, the amounts of the stipends set forth in this subchapter by an amount equal to the change in the applicable Consumer Price Index in the preceding [two] five years provided that the Adjutant General finds sufficient funds are appropriated and available to pay for the adjusted stipends.Section 2.  This act shall take effect in 60 days.20230SB0162PN0043  - 8 - 12345678910111213141516171819202122232425\n\n\n\n"
    },
    "ocd-bill/5ac79cf5-fab7-49ee-94d8-2dcc16d6798d": {
        "id": "ocd-bill/5ac79cf5-fab7-49ee-94d8-2dcc16d6798d",
        "state": "Pennsylvania",
        "title": "An Act amending the act of June 1, 1945 (P.L.1242, No.428), known as the State Highway Law, in rural State highway system and State highways in cities, boroughs and towns, further providing for improvement, reconstruction and maintenance.",
        "chamber": "Senate",
        "created_date": "2023-01-20",
        "link": "http://www.legis.state.pa.us/CFDOCS/Legis/PN/Public/btCheck.cfm?txtType=HTM&sessYr=2023&sessInd=0&billBody=S&billTyp=B&billNbr=0191&pn=0089",
        "text": "\n\n Regular Session 2023-2024 Senate Bill 0191 P.N. 0089\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n    \t        See other bills under thesame topic\r\n    \t    \n\n\n\n\n\n\n PRINTER'S NO.  89 THE GENERAL ASSEMBLY OF PENNSYLVANIASENATE BILL No.191 Session of 2023 INTRODUCED BY HUTCHINSON, BROOKS, STEFANO, BARTOLOTTA, DUSH AND BAKER, JANUARY 19, 2023 REFERRED TO TRANSPORTATION, JANUARY 19, 2023 AN ACTAmending the act of June 1, 1945 (P.L.1242, No.428), entitled \"An act relating to roads, streets, highways and bridges; amending, revising, consolidating and changing the laws administered by the Secretary of Highways and by the Department of Highways relating thereto,\" in rural State highway system and State highways in cities, boroughs and towns, further providing for improvement, reconstruction and maintenance.The General Assembly of the Commonwealth of Pennsylvania hereby enacts as follows:Section 1.  Section 513 of the act of June 1, 1945 (P.L.1242, No.428), known as the State Highway Law, is amended to read:Section 513.  Improvement, Reconstruction and Maintenance.--(a)  The department shall, at the expense of the Commonwealth improve or reconstruct and maintain all State highways within boroughs and incorporated towns, to such width and of such type as shall be determined by the secretary.(b)  The department shall, at the expense of the Commonwealth, construct and maintain all surface and subsurface drainage facilities connected with State highways within boroughs and incorporated towns with populations equal to or 123456789101112131415161718192021\nless than two thousand five hundred (2,500) based on the most recent Federal decennial census.Section 2.  This act shall take effect in 60 days.20230SB0191PN0089  - 2 - 123\n\n\n\n"
    },
    "ocd-bill/3ff42198-fbd4-4595-bf3d-a1937578542a": {
        "id": "ocd-bill/3ff42198-fbd4-4595-bf3d-a1937578542a",
        "state": "Pennsylvania",
        "title": "An Act designating a bridge, identified as Bridge Key 8654, carrying State Route 3035 over the Little Conemaugh River in East Taylor Township, Cambria County, as the East Taylor Township Veterans Memorial Bridge; designating a bridge, identified as Bridge Key 43558, carrying U.S. Route 22 over a tributary of Hinckston Run in Jackson Township, Cambria County, as the Officer Matthew Krupa Memorial Bridge; and designating a bridge, identified as Bridge Key 55994, carrying State Route 4002 over California Run in Cambria Township, Cambria County, as the Senior Chief Stanley \"Stush\" Kubat, Jr., Memorial Bridge.",
        "chamber": "Senate",
        "created_date": "2023-01-20",
        "link": "http://www.legis.state.pa.us/CFDOCS/Legis/PN/Public/btCheck.cfm?txtType=HTM&sessYr=2023&sessInd=0&billBody=S&billTyp=B&billNbr=0154&pn=0126",
        "text": "\n\n Regular Session 2023-2024 Senate Bill 0154 P.N. 0126\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n    \t        See other bills under thesame topic\r\n    \t    \n\n\n\n\n\n\n PRINTER'S NO.  126 THE GENERAL ASSEMBLY OF PENNSYLVANIASENATE BILL No.154 Session of 2023 INTRODUCED BY LANGERHOLC, JANUARY 19, 2023 REFERRED TO TRANSPORTATION, JANUARY 19, 2023 AN ACTDesignating a bridge, identified as Bridge Key 8654, carrying State Route 3035 over the Little Conemaugh River in East Taylor Township, Cambria County, as the East Taylor Township Veterans Memorial Bridge; designating a bridge, identified as Bridge Key 43558, carrying U.S. Route 22 over a tributary of Hinckston Run in Jackson Township, Cambria County, as the Officer Matthew Krupa Memorial Bridge; and designating a bridge, identified as Bridge Key 55994, carrying State Route 4002 over California Run in Cambria Township, Cambria County, as the Senior Chief Stanley \"Stush\" Kubat, Jr., Memorial Bridge.The General Assembly of the Commonwealth of Pennsylvania hereby enacts as follows:Section 1.  East Taylor Township Veterans Memorial Bridge.(a)  Findings.--The General Assembly finds and declares that this Commonwealth and the nation are indebted to the veterans of East Taylor Township, Cambria County, for their bravery, heroism and sacrifice in protecting freedom and liberty both at home and abroad.(b)  Designation.--The bridge, identified as Bridge Key 8654, carrying State Route 3035 over the Little Conemaugh River in East Taylor Township, Cambria County, is designated the East Taylor Township Veterans Memorial Bridge.1234567891011121314151617181920212223\n(c)  Signs.--The Department of Transportation shall erect and maintain appropriate signs displaying the name of the bridge to traffic in both directions on the bridge.Section 2.  Officer Matthew Krupa Memorial Bridge.(a)  Findings.--The General Assembly finds and declares as follows:(1)  Officer Matthew Krupa was born July 25, 1993, in Johnstown.(2)  Officer Krupa was raised in Nanty Glo.(3)  Officer Krupa graduated from Central Cambria High School.(4)  Officer Krupa sought out to live his childhood dream by becoming a police officer.(5)  Officer Krupa graduated from the police academy and started to serve the area as a police officer.(6)  Officer Krupa served as a police officer for Portage Borough, Ferndale Borough, Saint Francis University, Indiana University of Pennsylvania and Conemaugh Hospital.(7)  In 2018, Officer Krupa moved to San Antonio, Texas, where he was employed with the Gonzales County Sheriff's Office and with the San Antonio Independent School District Police Department.(8)  On February 4, 2021, Officer Krupa was dressed in full uniform and on his way to work when he was involved in a line of duty car crash that took his life.(9)  Officer Krupa's lifelong dream was to become a K-9 officer, and he was in training when he was killed.(b)  Designation.--The bridge, identified as Bridge Key 43558, carrying U.S. Route 22 over a tributary of Hinckston Run in Jackson Township, Cambria County, is designated the Officer 20230SB0154PN0126  - 2 - 123456789101112131415161718192021222324252627282930\nMatthew Krupa Memorial Bridge.(c)  Signs.--The Department of Transportation shall erect and maintain appropriate signs displaying the name of the bridge to traffic in both directions on the bridge.Section 3.  Senior Chief Stanley \"Stush\" Kubat, Jr., Memorial Bridge.(a)  Findings.--The General Assembly finds and declares as follows:(1)  Stanley Kubat, Jr., was born June 29, 1973, in Johnstown.(2)  Senior Chief Kubat served our country for 23 years in the United States Navy.(3)  Senior Chief Kubat was awarded a Bronze Star for his service to our nation.(4)  Senior Chief Kubat enjoyed golfing, hunting and fishing.(5)  Senior Chief Kubat passed away on November 9, 2022.(b)  Designation.--The bridge, identified as Bridge Key 55994, carrying State Route 4002 over California Run in Cambria Township, Cambria County, is designated the Senior Chief Stanley \"Stush\" Kubat, Jr., Memorial Bridge.(c)  Signs.--The Department of Transportation shall erect and maintain appropriate signs displaying the name of the bridge to traffic in both directions on the bridge.Section 4.  Effective date.This act shall take effect in 60 days.20230SB0154PN0126  - 3 - 1234567891011121314151617181920212223242526\n\n\n\n"
    },
    "ocd-bill/6c9bc73a-da57-428d-9786-f4f9f2f3a3d9": {
        "id": "ocd-bill/6c9bc73a-da57-428d-9786-f4f9f2f3a3d9",
        "state": "Pennsylvania",
        "title": "An Act amending Title 35 (Health and Safety) of the Pennsylvania Consolidated Statutes, in Commonwealth services, providing for firefighting foam management.",
        "chamber": "Senate",
        "created_date": "2023-01-20",
        "link": "http://www.legis.state.pa.us/CFDOCS/Legis/PN/Public/btCheck.cfm?txtType=HTM&sessYr=2023&sessInd=0&billBody=S&billTyp=B&billNbr=0144&pn=0119",
        "text": "\n\n Regular Session 2023-2024 Senate Bill 0144 P.N. 0119\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n    \t        See other bills under thesame topic\r\n    \t    \n\n\n\n\n\n\n PRINTER'S NO.  119 THE GENERAL ASSEMBLY OF PENNSYLVANIASENATE BILL No.144 Session of 2023 INTRODUCED BY YAW, COLLETT, MARTIN AND COMITTA, JANUARY 19, 2023 REFERRED TO ENVIRONMENTAL RESOURCES AND ENERGY, JANUARY 19, 2023 AN ACTAmending Title 35 (Health and Safety) of the Pennsylvania Consolidated Statutes, in Commonwealth services, providing for firefighting foam management.The General Assembly of the Commonwealth of Pennsylvania hereby enacts as follows:Section 1.  Title 35 of the Pennsylvania Consolidated Statutes is amended by adding a section to read:§ 7390.  Firefighting foam management.(a)  Prohibited conduct.--(1)  Beginning January 1, 2024, no person, firefighting entity, the Commonwealth nor a municipality may discharge or otherwise use a class B firefighting foam that contains an intentionally added PFAS chemical for:(i)  testing purposes at a facility, unless:(A)  otherwise required by law or the governmental entity having jurisdiction over the testing facility; and(B)  the facility has implemented appropriate containment, treatment and disposal measures to 12345678910111213141516171819\nprevent the uncontrolled release of the class B firefighting foam into the environment; or(ii)  training purposes, unless the training involves replacing the class B firefighting foam that contains an intentionally added PFAS chemical with nonfluorinated training foam.(2)  The State Fire Commissioner shall assist firefighting entities with evaluating and determining how to transition to the use of class B firefighting foam that does not contain an intentionally added PFAS chemical for testing purposes.(3)  (i)  An individual or fire department who administers a training program in violation of this section shall be subject to a civil penalty not to exceed $5,000 for a first offense.(ii)  An individual or fire department who administers a training program in violation of this section for a second or subsequent offense shall be subject to a civil penalty not to exceed $10,000.(iii)  Penalties collected under this section shall be deposited into the Online Training Educator and Training Reimbursement Account.(b)  Warning labels.--A manufacturer of personal protective equipment for fire prevention or control activities in this Commonwealth shall affix a warning label to the product if the product contains a perfluorooctane (PFOS) or perfluorooctanoic acid (PFOA).(c)  Enforcement.--The Office of the State Fire Commissioner shall enforce the provisions of this section.(d)  Construction.--Nothing in this section shall be 20230SB0144PN0119  - 2 - 123456789101112131415161718192021222324252627282930\nconstrued to restrict:(1)  the manufacture, sale or distribution of class B firefighting foam that contains an intentionally added PFAS chemical; or(2)  the discharge or other use of class B firefighting foam that contains an intentionally added PFAS chemical in emergency firefighting or fire suppression operations.(e)  Definitions.--The    following    words and phrases when used   in this section shall have the meanings given to them in this subsection unless the context clearly indicates otherwise:\"Class B firefighting foam.\"  A foam designed for extinguishing flammable-liquid fires.\"Firefighting entity.\"  An entity that engages in fire prevention or control activities in this Commonwealth. The term shall include municipal fire departments and volunteer fire companies.\"PFAS chemical.\"  A fluorinated organic chemical that contains at least one fully fluorinated carbon atom and is designed to be fully functional in formulations of class B firefighting foam.\"Testing.\"  The term shall include testing related to calibration, conformance and fixed system.Section 2.  This act shall take effect immediately.20230SB0144PN0119  - 3 - 1234567891011121314151617181920212223\n\n\n\n"
    },
    "ocd-bill/56f7d940-5828-4174-b6e1-b02d3526d2c7": {
        "id": "ocd-bill/56f7d940-5828-4174-b6e1-b02d3526d2c7",
        "state": "Pennsylvania",
        "title": "An Act amending Title 42 (Judiciary and Judicial Procedure) of the Pennsylvania Consolidated Statutes, in criminal proceedings, further providing for other offenses.",
        "chamber": "Senate",
        "created_date": "2023-01-19",
        "link": "http://www.legis.state.pa.us/CFDOCS/Legis/PN/Public/btCheck.cfm?txtType=HTM&sessYr=2023&sessInd=0&billBody=S&billTyp=B&billNbr=0087&pn=0064",
        "text": "\n\n Regular Session 2023-2024 Senate Bill 0087 P.N. 0064\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n    \t        See other bills under thesame topic\r\n    \t    \n\n\n\n\n\n\n PRINTER'S NO.  64 THE GENERAL ASSEMBLY OF PENNSYLVANIASENATE BILL No.87 Session of 2023 INTRODUCED BY BROOKS, STEFANO, PENNYCUICK AND MASTRIANO, JANUARY 18, 2023 REFERRED TO JUDICIARY, JANUARY 18, 2023 AN ACTAmending Title 42 (Judiciary and Judicial Procedure) of the Pennsylvania Consolidated Statutes, in criminal proceedings, further providing for other offenses.The General Assembly of the Commonwealth of Pennsylvania hereby enacts as follows:Section 1.  Section 5552(b)(1) of Title 42 of the Pennsylvania Consolidated Statutes is amended to read:§ 5552.  Other offenses.* * *(b)  Major offenses.--A prosecution for any of the following offenses must be commenced within five years after it is committed:(1)  Under the following provisions of Title 18 (relating to crimes and offenses):Section 901 (relating to criminal attempt) involving attempt to commit murder where no murder occurs.Section 902 (relating to criminal solicitation) involving solicitation to commit murder where no murder 123456789101112131415161718\noccurs.Section 903 (relating to criminal conspiracy) involving conspiracy to commit murder where no murder occurs.Section 911 (relating to corrupt organizations).Section 2506 (relating to drug delivery resulting in death).Section 2702 (relating to aggravated assault).Section 2706 (relating to terroristic threats).Section 2713 (relating to neglect of care-dependent person).Section 2901 (relating to kidnapping).Section 3301 (relating to arson and related offenses).Section 3502 (relating to burglary).Section 3701 (relating to robbery).Section 3921 (relating to theft by unlawful taking or disposition) through section 3933 (relating to unlawful use of computer).Section 4101 (relating to forgery).Section 4107 (relating to deceptive or fraudulent business practices).Section 4108 (relating to commercial bribery and breach of duty to act disinterestedly).Section 4109 (relating to rigging publicly exhibited contest).Section 4117 (relating to insurance fraud).Section 4701 (relating to bribery in official and political matters) through section 4703 (relating to retaliation for past official action).20230SB0087PN0064  - 2 - 123456789101112131415161718192021222324252627282930\nSection 4902 (relating to perjury) through section 4912 (relating to impersonating a public servant).Section 4952 (relating to intimidation of witnesses or victims).Section 4953 (relating to retaliation against witness, victim or party).Section 5101 (relating to obstructing administration of law or other governmental function).Section 5111 (relating to dealing in proceeds of unlawful activities).Section 5512 (relating to lotteries, etc.) through section 5514 (relating to pool selling and bookmaking).Section 5902(b) (relating to prostitution and related offenses).Section 6111(g)(2) and (4) (relating to sale or transfer of firearms).* * *Section 2.  This act shall take effect in 60 days.20230SB0087PN0064  - 3 - 123456789101112131415161718\n\n\n\n"
    },
    "ocd-bill/c670840e-071e-4293-9c10-3ed15491f414": {
        "id": "ocd-bill/c670840e-071e-4293-9c10-3ed15491f414",
        "state": "Pennsylvania",
        "title": "An Act amending the act of May 17, 1921 (P.L.682, No.284), known as The Insurance Company Law of 1921, in casualty insurance, further providing for coverage for mammographic examinations and diagnostic breast imaging and providing for coverage for BRCA-related genetic counseling and genetic testing.",
        "chamber": "Senate",
        "created_date": "2023-02-15",
        "link": "http://www.legis.state.pa.us/CFDOCS/Legis/PN/Public/btCheck.cfm?txtType=HTM&sessYr=2023&sessInd=0&billBody=S&billTyp=B&billNbr=0008&pn=0290",
        "text": "\n\n Regular Session 2023-2024 Senate Bill 0008 P.N. 0290\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n    \t        See other bills under thesame topic\r\n    \t    \n\n\n\n\n\n\n PRINTER'S NO.  290 THE GENERAL ASSEMBLY OF PENNSYLVANIASENATE BILL No.8 Session of 2023 INTRODUCED BY K. WARD, ROBINSON, PENNYCUICK, DiSANTO, PHILLIPS-HILL, BROOKS, J. WARD, BARTOLOTTA, BROWN, BAKER, TARTAGLIONE, SCHWANK, ARGALL, LANGERHOLC, COSTA, GEBHARD, BREWSTER, LAUGHLIN, KANE, FLYNN, VOGEL, COLLETT, DILLON, HUGHES, MARTIN, MASTRIANO, SANTARSIERO, ROTHMAN, COMITTA, L. WILLIAMS, YAW, HUTCHINSON, STEFANO, AUMENT, SAVAL, REGAN, COLEMAN, DUSH, FARRY, CAPPELLETTI AND BOSCOLA, FEBRUARY 14, 2023 REFERRED TO BANKING AND INSURANCE, FEBRUARY 14, 2023 AN ACTAmending the act of May 17, 1921 (P.L.682, No.284), entitled \"An act relating to insurance; amending, revising, and consolidating the law providing for the incorporation of insurance companies, and the regulation, supervision, and protection of home and foreign insurance companies, Lloyds associations, reciprocal and inter-insurance exchanges, and fire insurance rating bureaus, and the regulation and supervision of insurance carried by such companies, associations, and exchanges, including insurance carried by the State Workmen's Insurance Fund; providing penalties; and repealing existing laws,\" in casualty insurance, further providing for coverage for mammographic examinations and diagnostic breast imaging and providing for coverage for BRCA-related genetic counseling and genetic testing.The General Assembly of the Commonwealth of Pennsylvania hereby enacts as follows:Section 1.  Section 632 heading and (b) of the act of May 17, 1921 (P.L.682, No.284), known as The Insurance Company Law of 1921, are amended and the section is amended by adding a subsection to read:Section 632.  Coverage for Mammographic Examinations and 123456789101112131415161718192021\n[Diagnostic] Breast Imaging.--* * *(b)  A group or individual health or sickness or accident insurance policy providing hospital or medical/surgical coverage and a group or individual subscriber contract or certificate issued by any entity subject to 40 Pa.C.S. Ch. 61 or 63, this act, the \"Health Maintenance Organization Act,\" the \"Fraternal Benefit Society Code\" or an employe welfare benefit plan as defined in section 3 of the Employee Retirement Income Security Act of 1974 providing hospital or medical/surgical coverage shall also provide coverage for breast imaging. The minimum coverage required shall include [supplemental magnetic resonance imaging or, if such imaging is not possible, ultrasound if recommended by the treating physician] all costs associated with one supplemental breast screening every year because the woman is believed to be at an increased risk of breast cancer due to:(1)  personal history of atypical breast histologies;(2)  personal history or family history of breast cancer;(3)  genetic predisposition for breast cancer;(4)  prior therapeutic thoracic radiation therapy;(5)  heterogeneously dense breast tissue based on breast composition categories [of the Breast Imaging and Reporting Data System established by the American College of Radiology] with any one of the following risk factors:(i)  lifetime risk of breast cancer of greater than 20%, according to risk assessment tools based on family history;(ii)  personal history of BRCA1 or BRCA2 gene mutations;(iii)  first-degree relative with a BRCA1 or BRCA2 gene mutation but not having had genetic testing herself;(iv)  prior therapeutic thoracic radiation therapy between 10 and 30 years of age; or20230SB0008PN0290  - 2 - 123456789101112131415161718192021222324252627282930\n(v)  personal history of Li-Fraumeni syndrome, Cowden syndrome or Bannayan-Riley-Ruvalcaba syndrome or a first-degree relative with one of these syndromes[.]; or(6)  extremely dense breast tissue based on breast composition [categories of the Breast Imaging and Reporting Data System established by the American College of Radiology. Nothing in this subsection shall be construed to require an insurer to cover the surgical procedure known as mastectomy or to prevent the application of deductible, copayment or coinsurance provisions contained in the policy or plan.] categories.Nothing in this subsection shall be construed as to preclude utilization review as provided under Article XXI of this act or to prevent the application of deductible, copayment or coinsurance provisions contained in the policy or plan for breast imaging in excess of the minimum coverage required.* * *(d)  As used in this section:\"Supplemental breast screening\" means a medically necessary and clinically appropriate examination of the breast using either standard or abbreviated magnetic resonance imaging or, if such imaging is not possible, ultrasound if recommended by the treating physician to screen for breast cancer when there is no abnormality seen or suspected in the breast.Section 2.  The act is amended by adding a section to read:Section 633.1.  Coverage for BRCA-related Genetic Counseling and Genetic Testing.--(a)  A health insurance policy offered, issued or renewed in this Commonwealth shall provide coverage for BRCA-related genetic counseling and genetic testing provided by an individual licensed, certified or otherwise regulated to provide genetic counseling and genetic testing under the laws of 20230SB0008PN0290  - 3 - 123456789101112131415161718192021222324252627282930\nthis Commonwealth. The minimum coverage required shall include all costs associated with genetic counseling and, if indicated after genetic counseling, a genetic laboratory test of the BRCA1 and BRCA2 genes for individuals assessed to be at an increased risk, based on a clinical risk assessment tool, of potentially harmful mutations in the BRCA1 or BRCA2 genes due to a personal or family history of breast or ovarian cancer.(b)  As used in this section:\"Genetic counseling\" means the provision of services to individuals, couples, families and organizations by one or more appropriately trained individuals to address the physical and psychological issues associated with the occurrence or risk of occurrence of a genetic disorder, birth defect or genetically influenced condition or disease in an individual or a family.\"Health insurance policy\" means an individual or group insurance policy, subscriber contract, certificate or plan issued by an insurer that provides medical or health care coverage, including emergency services. The term does not include any of the following:(1)  An accident only policy.(2)  A credit only policy.(3)  A long-term care or disability income policy.(4)  A specified disease policy.(5)  A Medicare supplement policy.(6)  A fixed indemnity policy.(7)  A hospital indemnity policy.(8)  A dental only policy.(9)  A vision only policy.(10)  A worker's compensation policy.(11)  An automobile medical payment policy.20230SB0008PN0290  - 4 - 123456789101112131415161718192021222324252627282930\n(12)  A TRICARE policy, including a Civilian Health and Medical Program of the Uniformed Services (CHAMPUS) supplement policy.(13)  Any other similar policy providing for limited benefits.\"Insurer\" means an entity licensed by the Insurance Department with accident and health authority to issue a health insurance policy that is offered or governed under any of the following:(1)  This act, including section 630 and Article XXIV.(2)  The act of December 29, 1972 (P.L.1701, No.364), known as the \"Health Maintenance Organization Act.\"(3)  40 Pa.C.S. Ch. 61 (relating to hospital plan corporations) or 63 (relating to professional health services plan corporations).Section 3.  This act shall apply as follows:(1)  For health insurance policies for which either rates or forms are required to be filed with the Federal Government or the Insurance Department, this act shall apply to any policy for which a form or rate is first filed on or after the effective date of this section.(2)  For health insurance policies for which neither rates nor forms are required to be filed with the Federal Government or the Insurance Department, this act shall apply to any policy issued or renewed on or after 180 days after the effective date of this section.Section 4.  This act shall take effect in 60 days.20230SB0008PN0290  - 5 - 123456789101112131415161718192021222324252627\n\n\n\n"
    }
}