{
    "ocd-bill/796ea2ac-541d-449f-bbc5-b389d762c27f": {
        "id": "ocd-bill/796ea2ac-541d-449f-bbc5-b389d762c27f",
        "state": "Texas",
        "title": "Congratulating Gavin Brian David of Fate on attaining the rank of Eagle Scout.",
        "chamber": "House",
        "created_date": "2023-01-24",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00078I.HTM",
        "text": "\n\n\n88(R) HR 78 - Introduced version - Bill Text\n\n\n\n\n\n \n88R9768 AMB-D\n\n\n \n\n\n \n\n\t\tBy: Holland\nH.R. No. 78\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, The rank of Eagle Scout is an achievement shared by \n\n\n\n \n\t\t\t\nonly a select few, and the attainment of this significant honor by \n\n\n\n \n\t\t\t\nGavin Brian David of Fate heralds a future bright with opportunity \n\n\n\n \n\t\t\t\nand promise; and\n\n\n\n \n\t\t\t\n       WHEREAS, Mr. David has mastered a number of important skills \n\n\n\n \n\t\t\t\nin his quest to become an Eagle Scout; he has earned merit badges \n\n\n\n \n\t\t\t\nrequiring expertise in such diverse areas as first aid, personal \n\n\n\n \n\t\t\t\nfitness, and environmental science, and he has gained experience in \n\n\n\n \n\t\t\t\nleadership and teamwork while undertaking an Eagle Scout project \n\n\n\n \n\t\t\t\nthat has contributed to the betterment of his community; and\n\n\n\n \n\t\t\t\n       WHEREAS, A founding member of Scouts BSA Troop No. 163 in \n\n\n\n \n\t\t\t\nFate, Mr. David is the second Eagle Scout from the group; he has \n\n\n\n \n\t\t\t\nably served his peers in a designated position of responsibility, \n\n\n\n \n\t\t\t\nand in so doing, he has exemplified the many positive traits for \n\n\n\n \n\t\t\t\nwhich Scouts are renowned; and\n\n\n\n \n\t\t\t\n       WHEREAS, Mr. David is currently a senior at Royse City High \n\n\n\n \n\t\t\t\nSchool; after graduation, he plans on attending Texas A&M \n\n\n\n \n\t\t\t\nUniversity, where he will continue his studies at the College of \n\n\n\n \n\t\t\t\nEngineering; and\n\n\n\n \n\t\t\t\n       WHEREAS, In fulfilling the rigorous requirements for \n\n\n\n \n\t\t\t\nattaining the Eagle Scout insignia, Gavin David has demonstrated an \n\n\n\n \n\t\t\t\nunwavering commitment to Scouts BSA and its ideals, and the \n\n\n\n \n\t\t\t\nknowledge and confidence he has acquired along the way will indeed \n\n\n\n \n\t\t\t\nserve him well in the years to come; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby congratulate Eagle Scout Gavin Brian David on \n\n\n\n \n\t\t\t\nachieving this prestigious rank and extend to him sincere best \n\n\n\n \n\t\t\t\nwishes for continued success and happiness; and, be it further\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for Mr. David as an expression of high regard by the Texas \n\n\n\n \n\t\t\t\nHouse of Representatives.\n\n\n\n"
    },
    "ocd-bill/789b7e1c-1202-4446-a379-79388529831f": {
        "id": "ocd-bill/789b7e1c-1202-4446-a379-79388529831f",
        "state": "Texas",
        "title": "Commemorating the 27th Annual Children's Hospital Trail Ride BBQ Cook Off.",
        "chamber": "House",
        "created_date": "2023-01-27",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00115I.HTM",
        "text": "\n\n\n88(R) HR 115 - Introduced version - Bill Text\n\n\n\n\n\n \n88R10267 BHH-D\n\n\n \n\n\n \n\n\t\tBy: Guillen\nH.R. No. 115\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, The 27th Annual Children's Hospital Trail Ride BBQ \n\n\n\n \n\t\t\t\nCook Off is taking place in Stockdale on March 10 and 11, 2023; and\n\n\n\n \n\t\t\t\n       WHEREAS, This much-anticipated event is sanctioned by the \n\n\n\n \n\t\t\t\nInternational Barbeque Cookers Association as one of the \n\n\n\n \n\t\t\t\norganization's state championship cook-offs; and\n\n\n\n \n\t\t\t\n       WHEREAS, The contest draws accomplished pitmasters from \n\n\n\n \n\t\t\t\nacross Texas who strive to create the tastiest dishes in several \n\n\n\n \n\t\t\t\ndifferent categories; attendees enjoy a fun, family-oriented \n\n\n\n \n\t\t\t\natmosphere along with great food and spirited competition; and\n\n\n\n \n\t\t\t\n       WHEREAS, The Children's Hospital Trail Ride BBQ Cook Off is a \n\n\n\n \n\t\t\t\nfitting celebration of the smoked delicacies that are such an \n\n\n\n \n\t\t\t\nintegral part of Texas culture, and it promises to be a source of \n\n\n\n \n\t\t\t\nfond memories for all who attend; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby commemorate the 27th Annual Children's Hospital \n\n\n\n \n\t\t\t\nTrail Ride BBQ Cook Off and extend to the organizers and \n\n\n\n \n\t\t\t\nparticipants sincere best wishes for a fun and successful event.\n\n\n\n"
    },
    "ocd-bill/45b85cea-8e68-4650-856e-e280f5bbc850": {
        "id": "ocd-bill/45b85cea-8e68-4650-856e-e280f5bbc850",
        "state": "Texas",
        "title": "Congratulating Major Danny Williams on his retirement from the Dallas Police Department.",
        "chamber": "House",
        "created_date": "2023-01-21",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00058I.HTM",
        "text": "\n\n\n88(R) HR 58 - Introduced version - Bill Text\n\n\n\n\n\n \n88R9516 BK-D\n\n\n \n\n\n \n\n\t\tBy: Davis\nH.R. No. 58\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, The retirement of Major Danny Williams from the \n\n\n\n \n\t\t\t\nDallas Police Department is being celebrated with a special event \n\n\n\n \n\t\t\t\nin his honor on February 3, 2023; and\n\n\n\n \n\t\t\t\n       WHEREAS, Danny Williams is a 36-year veteran of the \n\n\n\n \n\t\t\t\ndepartment, where he was hired in 1986; he worked as a patrol \n\n\n\n \n\t\t\t\nofficer and in youth operations and felony assaults investigation \n\n\n\n \n\t\t\t\nbefore being promoted to patrol sergeant in 1997; after earning \n\n\n\n \n\t\t\t\nanother promotion to the rank of lieutenant in 2006, he held various \n\n\n\n \n\t\t\t\nleadership roles in the department, which included serving as \n\n\n\n \n\t\t\t\ncommander of the S.W.A.T. Team, the Central Business District, and \n\n\n\n \n\t\t\t\nthe vice and gangs units; and\n\n\n\n \n\t\t\t\n       WHEREAS, Major Williams was elevated to his current rank in \n\n\n\n \n\t\t\t\n2014, and he subsequently commanded the department's South Central \n\n\n\n \n\t\t\t\nPatrol Division, Field Services Division, and Criminal \n\n\n\n \n\t\t\t\nInvestigations Bureau; one of his proudest accomplishments was his \n\n\n\n \n\t\t\t\nleadership of the Northeast Patrol Division in the successful \n\n\n\n \n\t\t\t\ncollaboration with other city service departments to combat violent \n\n\n\n \n\t\t\t\ncrime in north Dallas during the summer months; and\n\n\n\n \n\t\t\t\n       WHEREAS, A native of Holly Grove, Arkansas, Major Williams \n\n\n\n \n\t\t\t\nearned his bachelor's degree in public administration from the \n\n\n\n \n\t\t\t\nUniversity of Central Arkansas and his master's degree in criminal \n\n\n\n \n\t\t\t\njustice from the University of North Texas; he is also a 2015 \n\n\n\n \n\t\t\t\ngraduate of the Caruth Police Institute and a 2018 graduate of the \n\n\n\n \n\t\t\t\nFBI National Academy, and he is a proud member of Alpha Phi Alpha \n\n\n\n \n\t\t\t\nFraternity, Inc.; in addition to his duties with the department, he \n\n\n\n \n\t\t\t\npreviously served as an adjunct instructor in criminal justice at \n\n\n\n \n\t\t\t\nthe University of Phoenix and Dallas College; and\n\n\n\n \n\t\t\t\n       WHEREAS, Through his leadership, professionalism, and \n\n\n\n \n\t\t\t\ncommitment to protecting and serving his community, Major Danny \n\n\n\n \n\t\t\t\nWilliams has greatly benefited the citizens of Dallas, and he may \n\n\n\n \n\t\t\t\nindeed reflect with pride on a career well spent as he embarks on \n\n\n\n \n\t\t\t\nthe next exciting chapter of his life; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby congratulate Major Danny Williams on his \n\n\n\n \n\t\t\t\nretirement from the Dallas Police Department and extend to him \n\n\n\n \n\t\t\t\nsincere best wishes for the future; and, be it further\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for Major Williams as an expression of high regard by the \n\n\n\n \n\t\t\t\nTexas House of Representatives.\n\n\n\n"
    },
    "ocd-bill/cb8af410-2a70-43ac-b57a-5855187723ac": {
        "id": "ocd-bill/cb8af410-2a70-43ac-b57a-5855187723ac",
        "state": "Texas",
        "title": "Recognizing February 28, 2023, as Rare Disease Day.",
        "chamber": "House",
        "created_date": "2023-03-01",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00443I.HTM",
        "text": "\n\n\n88(R) HR 443 - Introduced version - Bill Text\n\n\n\n\n\n \n88R15293 CJM-D\n\n\n \n\n\n \n\n\t\tBy: Kuempel\nH.R. No. 443\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, There are nearly 10,000 known diseases and \n\n\n\n \n\t\t\t\nconditions that are considered rare by medical authorities in the \n\n\n\n \n\t\t\t\nUnited States, and each year, thousands of Texans are among those \n\n\n\n \n\t\t\t\nwhose lives are changed by these diseases; and\n\n\n\n \n\t\t\t\n       WHEREAS, A rare disease is defined as one that affects fewer \n\n\n\n \n\t\t\t\nthan 200,000 people, but even though a specific disease may afflict \n\n\n\n \n\t\t\t\nonly a small number of sufferers, such conditions, as a group, \n\n\n\n \n\t\t\t\naffect almost 30 million Americans, or nearly one in 10 people in \n\n\n\n \n\t\t\t\nour nation; and\n\n\n\n \n\t\t\t\n       WHEREAS, Many rare diseases are serious and debilitating, \n\n\n\n \n\t\t\t\nwith a significant impact on the lives of those affected and their \n\n\n\n \n\t\t\t\nfamilies, and approximately 95 percent of rare diseases have no \n\n\n\n \n\t\t\t\nFDA-approved treatment; and\n\n\n\n \n\t\t\t\n       WHEREAS, The National Economic Burden of Rare Disease Study \n\n\n\n \n\t\t\t\nin the United States estimated that the overall economic burden of \n\n\n\n \n\t\t\t\nrare diseases in 2019 exceeded $966 billion; and\n\n\n\n \n\t\t\t\n       WHEREAS, Individuals and families who face a rare disease \n\n\n\n \n\t\t\t\noften experience a sense of isolation, difficulty in getting an \n\n\n\n \n\t\t\t\naccurate and timely diagnosis, few treatment options, and problems \n\n\n\n \n\t\t\t\nin receiving reimbursement for treatment; moreover, those who are \n\n\n\n \n\t\t\t\ndiagnosed with a lesser known disorder often find that they must \n\n\n\n \n\t\t\t\nbear the lion's share of the responsibility for raising awareness \n\n\n\n \n\t\t\t\nas well as for raising funds for research toward a possible \n\n\n\n \n\t\t\t\ntreatment or cure; and\n\n\n\n \n\t\t\t\n       WHEREAS, Thousands of patients, family members, friends, \n\n\n\n \n\t\t\t\nco-workers, medical professionals, researchers, government \n\n\n\n \n\t\t\t\nofficials, and companies developing treatments are pleased to join \n\n\n\n \n\t\t\t\ntogether with patient advocacy organizations like The National \n\n\n\n \n\t\t\t\nOrganization for Rare Disorders (NORD), EveryLife Foundation for \n\n\n\n \n\t\t\t\nRare Diseases, and the Texas Rare Alliance as part of a nationwide \n\n\n\n \n\t\t\t\nobservance of Rare Disease Day to advocate for continued research \n\n\n\n \n\t\t\t\nand access to diagnosis and treatment; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby recognize February 28, 2023, as Rare Disease Day \n\n\n\n \n\t\t\t\nand encourage all Texans to learn more about this matter of serious \n\n\n\n \n\t\t\t\nconcern.\n\n\n\n"
    },
    "ocd-bill/b614afa2-ce09-4b57-b264-11c7a3c6881c": {
        "id": "ocd-bill/b614afa2-ce09-4b57-b264-11c7a3c6881c",
        "state": "Texas",
        "title": "Commemorating the 125th anniversary of the Clover Club of Kaufman.",
        "chamber": "House",
        "created_date": "2023-01-26",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00096I.HTM",
        "text": "\n\n\n88(R) HR 96 - Introduced version - Bill Text\n\n\n\n\n\n \n88R3832 TBO-D\n\n\n \n\n\n \n\n\t\tBy: Bell of Kaufman\nH.R. No. 96\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, The Clover Club of Kaufman celebrated its 125th \n\n\n\n \n\t\t\t\nanniversary on May 12, 2022; and\n\n\n\n \n\t\t\t\n       WHEREAS, This notable organization traces its origins back to \n\n\n\n \n\t\t\t\n1897, when its four charter members founded a club to study American \n\n\n\n \n\t\t\t\nhistory and literature; the group was initially known as the \n\n\n\n \n\t\t\t\nFour-Leaf Clover Club, and in 1899, its name was shortened to the \n\n\n\n \n\t\t\t\nClover Club; in 1903, the group joined the General Federation of \n\n\n\n \n\t\t\t\nWomen's Clubs, an international organization dedicated to \n\n\n\n \n\t\t\t\nphilanthropy and volunteerism; and\n\n\n\n \n\t\t\t\n       WHEREAS, Since its inception, the Clover Club has worked \n\n\n\n \n\t\t\t\ntirelessly to improve the quality of life in the community; it \n\n\n\n \n\t\t\t\nplayed an instrumental role in establishing the Kaufman County \n\n\n\n \n\t\t\t\nLibrary in 1968, and it has continued to contribute to the library \n\n\n\n \n\t\t\t\nthrough monetary donations; moreover, the club has supported a \n\n\n\n \n\t\t\t\nvariety of initiatives focused on arts and culture, the \n\n\n\n \n\t\t\t\nenvironment, education, civic engagement, and health and wellness; \n\n\n\n \n\t\t\t\nand\n\n\n\n \n\t\t\t\n       WHEREAS, Today, the Clover Club benefits from the able \n\n\n\n \n\t\t\t\nguidance of president Barbara Harvey, and its members have the \n\n\n\n \n\t\t\t\nopportunity to participate in a number of education, training, and \n\n\n\n \n\t\t\t\nleadership programs; the organization has received honors from the \n\n\n\n \n\t\t\t\nCity of Kaufman and the General Federation of Women's Clubs; and\n\n\n\n \n\t\t\t\n       WHEREAS, For more than a century, the members of the Clover \n\n\n\n \n\t\t\t\nClub of Kaufman have been a dynamic and positive force in their \n\n\n\n \n\t\t\t\ncommunity, and it is a pleasure to recognize the group for its long \n\n\n\n \n\t\t\t\nhistory of exceptional service; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby congratulate the Clover Club of Kaufman on its \n\n\n\n \n\t\t\t\n125th anniversary and extend to all those associated with the club \n\n\n\n \n\t\t\t\nsincere best wishes for the future; and, be it further\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for the Clover Club of Kaufman as an expression of high \n\n\n\n \n\t\t\t\nregard by the Texas House of Representatives.\n\n\n\n"
    },
    "ocd-bill/593c34d5-5008-4f07-b122-b252336fb36f": {
        "id": "ocd-bill/593c34d5-5008-4f07-b122-b252336fb36f",
        "state": "Texas",
        "title": "Recognizing March 7, 2023, as Texas Bays and Estuaries Day at the State Capitol.",
        "chamber": "House",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00491I.HTM",
        "text": "\n\n\n88(R) HR 491 - Introduced version - Bill Text\n\n\n\n\n\n \n88R16285 BK-D\n\n\n \n\n\n \n\n\t\tBy: Hunter\nH.R. No. 491\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Texas Bays and Estuaries Day at the State Capitol is \n\n\n\n \n\t\t\t\ntaking place on March 7, 2023, to raise awareness of the critical \n\n\n\n \n\t\t\t\nimportance of our state's precious coastal water resources; and\n\n\n\n \n\t\t\t\n       WHEREAS, The Texas coast is home to nearly 7 million people \n\n\n\n \n\t\t\t\nacross 18 counties; treasured by citizens throughout the state, it \n\n\n\n \n\t\t\t\nspans over 3,000 miles of bay shorelines and includes coastal \n\n\n\n \n\t\t\t\nprairies, saltmarsh wetlands, beaches, dunes, estuaries, and other \n\n\n\n \n\t\t\t\necosystems; and\n\n\n\n \n\t\t\t\n       WHEREAS, The eight major bay systems of Texas, Sabine Lake, \n\n\n\n \n\t\t\t\nGalveston Bay, Matagorda Bay, San Antonio Bay, Aransas Bay, Corpus \n\n\n\n \n\t\t\t\nChristi Bay, Upper Laguna Madre, and Lower Laguna Madre, connect \n\n\n\n \n\t\t\t\ninflows from inland streams and rivers with oceanic tidal waters \n\n\n\n \n\t\t\t\nfrom the Gulf of Mexico; this process results in the creation of \n\n\n\n \n\t\t\t\nestuaries composed of freshwater mixed with saltwater; and\n\n\n\n \n\t\t\t\n       WHEREAS, Our state's bays and estuaries serve as habitats for \n\n\n\n \n\t\t\t\nnumerous species of fish and other wildlife, including endangered \n\n\n\n \n\t\t\t\nspecies, and contain coastal lands that are protected under the \n\n\n\n \n\t\t\t\nfederal Coastal Zone Management Act; the coast's diverse natural \n\n\n\n \n\t\t\t\nenvironments also provide outstanding opportunities for nature \n\n\n\n \n\t\t\t\nenthusiasts and preservationists from all over the world; and\n\n\n\n \n\t\t\t\n       WHEREAS, Ranching, farming, fishing, and petroleum are among \n\n\n\n \n\t\t\t\nthe industries that operate along the Texas coast; bays and \n\n\n\n \n\t\t\t\nestuaries help sustain waterborne commerce, energy and chemical \n\n\n\n \n\t\t\t\nmanufacturing businesses, military operations, commercial fishing, \n\n\n\n \n\t\t\t\nand recreational activities and tourism, all of which contribute \n\n\n\n \n\t\t\t\nsignificantly to our state's economy; these areas also play a vital \n\n\n\n \n\t\t\t\nrole in protecting communities from storms and floods and in \n\n\n\n \n\t\t\t\nproviding shoreline stabilization and erosion prevention, thus \n\n\n\n \n\t\t\t\nhelping to mitigate environmental damage while safeguarding lives \n\n\n\n \n\t\t\t\nand property; and\n\n\n\n \n\t\t\t\n       WHEREAS, The bays and estuaries of the Texas coastline are of \n\n\n\n \n\t\t\t\ntremendous environmental, recreational, and economic value to the \n\n\n\n \n\t\t\t\nLone Star State, in addition to offering incomparable scenic beauty \n\n\n\n \n\t\t\t\nfor all Texans to enjoy, and Texas Bays and Estuaries Day presents a \n\n\n\n \n\t\t\t\nwelcome opportunity to highlight the necessity of preserving and \n\n\n\n \n\t\t\t\nmaintaining these areas for the benefit of future generations; now, \n\n\n\n \n\t\t\t\ntherefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby recognize March 7, 2023, as Texas Bays and \n\n\n\n \n\t\t\t\nEstuaries Day at the State Capitol and commend all those who are \n\n\n\n \n\t\t\t\nworking to protect and preserve the bays and estuaries of the Texas \n\n\n\n \n\t\t\t\ncoast.\n\n\n\n"
    },
    "ocd-bill/d654ba2f-7018-4628-be7f-45ce57f02f2d": {
        "id": "ocd-bill/d654ba2f-7018-4628-be7f-45ce57f02f2d",
        "state": "Texas",
        "title": "Relating to persons authorized to conduct a marriage ceremony.",
        "chamber": "House",
        "created_date": "2023-02-03",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HB01884I.HTM",
        "text": "\n\n\n88(R) HB 1884 - Introduced version - Bill Text\n\n\n\n\n\n \n\n\n\n \n\n\n \n\n\t\tBy: Bhojani\nH.B. No. 1884\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA BILL TO BE ENTITLED\n\n\n\n\n \n\t\t\t\n\nAN ACT\n\n\n\n\n \n\t\t\t\nrelating to persons authorized to conduct a marriage ceremony.\n\n\n\n \n\t\t\t\n       BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\n       SECTION 1.  Sections 2.202(a), (b), and (b-1), Family Code, \n\n\n\n \n\t\t\t\nare amended to read as follows:\n\n\n\n \n\t\t\t\n       (a)  The following persons are authorized to conduct a \n\n\n\n \n\t\t\t\nmarriage ceremony:\n\n\n\n \n\t\t\t\n             (1)  [a licensed or ordained Christian minister or \n\n\n\n \n\t\t\t\npriest;\n\n\n\n \n\t\t\t\n             [(2)  a Jewish rabbi;\n\n\n\n \n\t\t\t\n             [(3)]  a person who is [an officer of a religious \n\n\n\n \n\t\t\t\norganization and who is] authorized by a religious [the] \n\n\n\n \n\t\t\t\norganization to conduct a marriage ceremony;\n\n\n\n \n\t\t\t\n             (2) [(4)]  a justice of the supreme court, judge of the \n\n\n\n \n\t\t\t\ncourt of criminal appeals, justice of the courts of appeals, judge \n\n\n\n \n\t\t\t\nof the district, county, and probate courts, judge of the county \n\n\n\n \n\t\t\t\ncourts at law, judge of the courts of domestic relations, judge of \n\n\n\n \n\t\t\t\nthe juvenile courts, retired justice or judge of those courts, \n\n\n\n \n\t\t\t\njustice of the peace, retired justice of the peace, judge of a \n\n\n\n \n\t\t\t\nmunicipal court, retired judge of a municipal court, associate \n\n\n\n \n\t\t\t\njudge of a statutory probate court, retired associate judge of a \n\n\n\n \n\t\t\t\nstatutory probate court, associate judge of a county court at law, \n\n\n\n \n\t\t\t\nretired associate judge of a county court at law, or judge or \n\n\n\n \n\t\t\t\nmagistrate of a federal court of this state; and\n\n\n\n \n\t\t\t\n             (3) [(5)]  a retired judge or magistrate of a federal \n\n\n\n \n\t\t\t\ncourt of this state.\n\n\n\n \n\t\t\t\n       (b)  For the purposes of Subsection (a)(2) [(a)(4)], a \n\n\n\n \n\t\t\t\nretired judge or justice is a former judge or justice who is vested \n\n\n\n \n\t\t\t\nin the Judicial Retirement System of Texas Plan One or the Judicial \n\n\n\n \n\t\t\t\nRetirement System of Texas Plan Two or who has an aggregate of at \n\n\n\n \n\t\t\t\nleast 12 years of service as judge or justice of any type listed in \n\n\n\n \n\t\t\t\nSubsection (a)(2) [(a)(4)].\n\n\n\n \n\t\t\t\n       (b-1)  For the purposes of Subsection (a)(3) [(a)(5)], a \n\n\n\n \n\t\t\t\nretired judge or magistrate is a former judge or magistrate of a \n\n\n\n \n\t\t\t\nfederal court of this state who is fully vested in the Federal \n\n\n\n \n\t\t\t\nEmployees Retirement System under 28 U.S.C. Section 371 or 377.\n\n\n\n \n\t\t\t\n       SECTION 2.  This Act takes effect September 1, 2023.\n\n\n\n"
    },
    "ocd-bill/b02b3b08-02e6-444a-b208-bb1d78790263": {
        "id": "ocd-bill/b02b3b08-02e6-444a-b208-bb1d78790263",
        "state": "Texas",
        "title": "Congratulating Christine Bowman on receiving a 2022 Joe S. Mundy Award from Southwestern University.",
        "chamber": "House",
        "created_date": "2023-02-27",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00369I.HTM",
        "text": "\n\n\n88(R) HR 369 - Introduced version - Bill Text\n\n\n\n\n\n \n88R12838 TBO-D\n\n\n \n\n\n \n\n\t\tBy: Harris of Williamson\nH.R. No. 369\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Christine Bowman has been named the recipient of a \n\n\n\n \n\t\t\t\n2022 Joe S. Mundy Award from Southwestern University; and\n\n\n\n \n\t\t\t\n       WHEREAS, Established in 2002, the Mundy Awards were created \n\n\n\n \n\t\t\t\nas a tribute to Southwestern University alumnus and former trustee \n\n\n\n \n\t\t\t\nJoe Mundy; the awards recognize exemplary faculty and staff members \n\n\n\n \n\t\t\t\nwho have demonstrated an unwavering commitment to the university \n\n\n\n \n\t\t\t\nand its students; and\n\n\n\n \n\t\t\t\n       WHEREAS, An alumnus of SU, Ms. Bowman joined the university's \n\n\n\n \n\t\t\t\nadministration following her graduation in 1993, and she currently \n\n\n\n \n\t\t\t\nserves as dean of enrollment services; among her many \n\n\n\n \n\t\t\t\nresponsibilities, she oversees the admissions office and plays an \n\n\n\n \n\t\t\t\ninstrumental role in student recruitment; she has also led the \n\n\n\n \n\t\t\t\nEnrollment Analysis Committee for many years, and under her able \n\n\n\n \n\t\t\t\nguidance, the group has assisted with clearing student accounts, \n\n\n\n \n\t\t\t\ncreating and implementing preferred name procedures, and \n\n\n\n \n\t\t\t\nstrengthening parent communication; she has further distinguished \n\n\n\n \n\t\t\t\nherself as an invaluable mentor to her colleagues; and\n\n\n\n \n\t\t\t\n       WHEREAS, Ms. Bowman has held leadership positions with \n\n\n\n \n\t\t\t\nnumerous professional organizations, among them the Texas \n\n\n\n \n\t\t\t\nAssociation for College Admission Counseling and the National \n\n\n\n \n\t\t\t\nAssociation for College Admission Counseling; in addition, she is \n\n\n\n \n\t\t\t\nthe current chair of the Colleges That Change Lives Board of \n\n\n\n \n\t\t\t\nDirectors, and she previously served as a co-chair for the NACAC \n\n\n\n \n\t\t\t\nNational Conference in Austin; and\n\n\n\n \n\t\t\t\n       WHEREAS, Through her dedication, vision, and expertise, \n\n\n\n \n\t\t\t\nChristine Bowman has greatly benefited Southwestern University and \n\n\n\n \n\t\t\t\nearned the respect and admiration of her peers, and she is truly \n\n\n\n \n\t\t\t\ndeserving of this prestigious honor; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby congratulate Christine Bowman on her receipt of \n\n\n\n \n\t\t\t\na 2022 Joe S. Mundy Award from Southwestern University and extend to \n\n\n\n \n\t\t\t\nher sincere best wishes for continued success with her important \n\n\n\n \n\t\t\t\nwork; and, be it further\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for Ms. Bowman as an expression of high regard by the Texas \n\n\n\n \n\t\t\t\nHouse of Representatives.\n\n\n\n"
    },
    "ocd-bill/8f19e3d3-6120-4dbf-8c9c-369b1979db61": {
        "id": "ocd-bill/8f19e3d3-6120-4dbf-8c9c-369b1979db61",
        "state": "Texas",
        "title": "Recognizing the Texas School District Police Chiefs' Association for its contributions to school district police departments.",
        "chamber": "House",
        "created_date": "2023-01-23",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00067I.HTM",
        "text": "\n\n\n88(R) HR 67 - Introduced version - Bill Text\n\n\n\n\n\n \n88R8552 TBO-D\n\n\n \n\n\n \n\n\t\tBy: Harris of Anderson\nH.R. No. 67\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Over the course of more than two and a half decades, \n\n\n\n \n\t\t\t\nthe Texas School District Police Chiefs' Association has provided \n\n\n\n \n\t\t\t\ninvaluable support and guidance to school district police \n\n\n\n \n\t\t\t\ndepartments; and\n\n\n\n \n\t\t\t\n       WHEREAS, The organization traces its origins back to 1996, \n\n\n\n \n\t\t\t\nwhen school district police chiefs in the Houston area began \n\n\n\n \n\t\t\t\nholding informal meetings to discuss issues related to their \n\n\n\n \n\t\t\t\nprofession; the group established the Southeast Texas School \n\n\n\n \n\t\t\t\nDistrict Police Chiefs Association in 1997, and the following year, \n\n\n\n \n\t\t\t\nthe organization hosted its first annual training conference; in \n\n\n\n \n\t\t\t\n2001, the organization's name was changed to the Texas School \n\n\n\n \n\t\t\t\nDistrict Police Chiefs' Association to reflect its mission to \n\n\n\n \n\t\t\t\npromote the statewide standardization of school district policing; \n\n\n\n \n\t\t\t\nand\n\n\n\n \n\t\t\t\n       WHEREAS, Today, the association benefits from the able \n\n\n\n \n\t\t\t\nguidance of its executive board, which includes president Solomon \n\n\n\n \n\t\t\t\nCook, first vice president Bill Avera, second vice president Kirby \n\n\n\n \n\t\t\t\nWarnke, third vice president Charles McDuffie, fourth vice \n\n\n\n \n\t\t\t\npresident Paul Cordova, immediate past president David Kimberly, \n\n\n\n \n\t\t\t\ntreasurer Jimmy Womack, and secretary Alan Bragg; and\n\n\n\n \n\t\t\t\n       WHEREAS, Through its visionary leadership, the Texas School \n\n\n\n \n\t\t\t\nDistrict Police Chiefs' Association is helping to ensure the safety \n\n\n\n \n\t\t\t\nof students, faculty, and staff in school districts across the \n\n\n\n \n\t\t\t\nstate, and it is a pleasure to recognize the organization for its \n\n\n\n \n\t\t\t\noutstanding record of service; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby commend the Texas School District Police Chiefs' \n\n\n\n \n\t\t\t\nAssociation for its contributions to school district police \n\n\n\n \n\t\t\t\ndepartments and extend to its members sincere best wishes for \n\n\n\n \n\t\t\t\ncontinued success in their important work; and, be it further\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for the Texas School District Police Chiefs' Association \n\n\n\n \n\t\t\t\nas an expression of high regard by the Texas House of \n\n\n\n \n\t\t\t\nRepresentatives.\n\n\n\n"
    },
    "ocd-bill/ca608462-2262-4416-a511-0b35a6172f34": {
        "id": "ocd-bill/ca608462-2262-4416-a511-0b35a6172f34",
        "state": "Texas",
        "title": "Recognizing March 7, 2023, as University of Houston-Victoria Day.",
        "chamber": "Senate",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/SR00283I.HTM",
        "text": "\n\n\n88(R) SR 283 - Introduced version - Bill Text\n\n\n\n\n\n \n2023S0138-1  02/15/23\n\n\n \n\n\n \n\n\t\tBy: Kolkhorst\nS.R. No. 283\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nSENATE RESOLUTION\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, The Senate of the State of Texas is pleased to \n\n\n\n \t\t\n\t\t\t\njoin alumni and representatives from the University of \n\n\n\n \t\t\n\t\t\t\nHouston-Victoria in celebrating University of Houston-Victoria \n\n\n\n \t\t\n\t\t\t\nDay at the State Capitol on March 7, 2023; and\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Established in 1973, the University of \n\n\n\n \t\t\n\t\t\t\nHouston-Victoria boasts more than 22,000 alumni, including \n\n\n\n \t\t\n\t\t\t\nacclaimed author and artist Van G. Garrett; the university is \n\n\n\n \t\t\n\t\t\t\nmeeting higher education needs in a city that is home to more than \n\n\n\n \t\t\n\t\t\t\n65,000 people and that serves as a regional hub for the \n\n\n\n \t\t\n\t\t\t\nseven-county area known as the Golden Crescent; and\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, The University of Houston-Victoria educates \n\n\n\n \t\t\n\t\t\t\napproximately 4,000 students annually and graduates about 1,000 \n\n\n\n \t\t\n\t\t\t\neach year; the university offers more than 80 bachelor's and \n\n\n\n \t\t\n\t\t\t\nmaster's degree programs, with concentrations in the fields of \n\n\n\n \t\t\n\t\t\t\nbusiness, education and health professions, liberal arts and \n\n\n\n \t\t\n\t\t\t\nsocial sciences, and natural and applied sciences; it was the \n\n\n\n \t\t\n\t\t\t\nfirst public university in Texas to offer an accelerated \n\n\n\n \t\t\n\t\t\t\nbachelor's degree program, and it offers some of the lowest \n\n\n\n \t\t\n\t\t\t\ntuition and fees in Texas; and\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, The only accredited four-year university in the \n\n\n\n \t\t\n\t\t\t\ncity of Victoria, the University of Houston-Victoria is home to \n\n\n\n \t\t\n\t\t\t\nimpressive athletic teams competing in baseball, softball, and \n\n\n\n \t\t\n\t\t\t\nmen's and women's golf and soccer in the National Association of \n\n\n\n \t\t\n\t\t\t\nIntercollegiate Athletics' Red River Conference; and\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Under the leadership of President Robert K. \n\n\n\n \t\t\n\t\t\t\nGlenn, the university has continued to grow as a diverse \n\n\n\n \t\t\n\t\t\t\ninstitution, with the student body currently representing 38 \n\n\n\n \t\t\n\t\t\t\nstates and 200 countries; moreover, the school has been \n\n\n\n \t\t\n\t\t\t\nrecognized as a Hispanic-Serving Institution and a \n\n\n\n \t\t\n\t\t\t\nMilitary-Friendly campus; and\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Throughout its 50-year history, the University of \n\n\n\n \t\t\n\t\t\t\nHouston-Victoria has offered its students outstanding \n\n\n\n \t\t\n\t\t\t\neducational opportunities that provide them with the basis for \n\n\n\n \t\t\n\t\t\t\nproductive and satisfying careers and that promote their \n\n\n\n \t\t\n\t\t\t\nfinancial well-being; the university has advanced the quality of \n\n\n\n \t\t\n\t\t\t\nlife in the community through excellence in teaching, research, \n\n\n\n \t\t\n\t\t\t\nand service, and it is truly fitting that the university receive \n\n\n\n \t\t\n\t\t\t\nspecial recognition for its contributions to the growth and \n\n\n\n \t\t\n\t\t\t\nvitality of the Lone Star State; now, therefore, be it\n\n\n\n \t\t\n\t\t\t\n       RESOLVED, That the Senate of the State of Texas, 88th \n\n\n\n \t\t\n\t\t\t\nLegislature, hereby recognize March 7, 2023, as University of \n\n\n\n \t\t\n\t\t\t\nHouston-Victoria Day at the State Capitol and extend to the \n\n\n\n \t\t\n\t\t\t\nvisiting delegation sincere best wishes for an informative and \n\n\n\n \t\t\n\t\t\t\nenjoyable stay in Austin; and, be it further\n\n\n\n \t\t\n\t\t\t\n       RESOLVED, That a copy of this Resolution be prepared for \n\n\n\n \t\t\n\t\t\t\nthe university as an expression of esteem from the Texas Senate.\n\n\n\n"
    },
    "ocd-bill/04d896d6-d3f0-46ba-91f5-d95cfe1cdece": {
        "id": "ocd-bill/04d896d6-d3f0-46ba-91f5-d95cfe1cdece",
        "state": "Texas",
        "title": "Commemorating the 150th anniversary of the Rockwall County Sheriff's Office.",
        "chamber": "House",
        "created_date": "2023-01-17",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00034I.HTM",
        "text": "\n\n\n88(R) HR 34 - Introduced version - Bill Text\n\n\n\n\n\n \n88R8967 JRI-D\n\n\n \n\n\n \n\n\t\tBy: Holland\nH.R. No. 34\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, The Rockwall County Sheriff's Office is \n\n\n\n \n\t\t\t\ncommemorating 150 years of service in 2023; and\n\n\n\n \n\t\t\t\n       WHEREAS, Established in 1873, the department serves Rockwall \n\n\n\n \n\t\t\t\nCounty, which was founded the same year and has grown from fewer \n\n\n\n \n\t\t\t\nthan 3,000 people in 1880 to nearly 108,000 in 2022; today, the \n\n\n\n \n\t\t\t\nagency employs a 171-member staff and encompasses enforcement, \n\n\n\n \n\t\t\t\ncriminal investigation, communication, and detention divisions; \n\n\n\n \n\t\t\t\nand\n\n\n\n \n\t\t\t\n       WHEREAS, Over the years, the office has benefited from the \n\n\n\n \n\t\t\t\nefforts of a total of 19 sheriffs; the first, Thomas F. Shaw, \n\n\n\n \n\t\t\t\ninitially ran the office as a one-man operation, and the \n\n\n\n \n\t\t\t\nlongest-tenured sheriff was W. J. Price, who directed the \n\n\n\n \n\t\t\t\ndepartment for more than three decades; since 2020, the sheriff's \n\n\n\n \n\t\t\t\nagency has been led by Terry Garrett; and\n\n\n\n \n\t\t\t\n       WHEREAS, For a century and a half, the Rockwall County \n\n\n\n \n\t\t\t\nSheriff's Office has worked to protect the lives and property of \n\n\n\n \n\t\t\t\narea residents, and it is a privilege to join in commending its \n\n\n\n \n\t\t\t\nstaff for their outstanding service; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby honor the Rockwall County Sheriff's Office on \n\n\n\n \n\t\t\t\nthe occasion of its 150th anniversary and extend to all those \n\n\n\n \n\t\t\t\nassociated with the department sincere best wishes for continued \n\n\n\n \n\t\t\t\nsuccess with their important work; and, be it further\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for the organization as an expression of high regard by the \n\n\n\n \n\t\t\t\nTexas House of Representatives.\n\n\n\n"
    },
    "ocd-bill/9812a7da-c6c1-4634-96d4-7eefd110e95c": {
        "id": "ocd-bill/9812a7da-c6c1-4634-96d4-7eefd110e95c",
        "state": "Texas",
        "title": "Relating to inservice training on identifying abuse, neglect, and illegal, unprofessional, and unethical conduct in certain health care facilities.",
        "chamber": "House",
        "created_date": "2022-11-16",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HB00233I.HTM",
        "text": "\n\n\n88(R) HB 233 - Introduced version - Bill Text\n\n\n\n\n\n \n88R1456 MCF-F\n\n\n \n\n\n \n\n\t\tBy: Murr\nH.B. No. 233\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA BILL TO BE ENTITLED\n\n\n\n\n \n\t\t\t\n\nAN ACT\n\n\n\n\n \n\t\t\t\nrelating to inservice training on identifying abuse, neglect, and \n\n\n\n \n\t\t\t\nillegal, unprofessional, and unethical conduct in certain health \n\n\n\n \n\t\t\t\ncare facilities.\n\n\n\n \n\t\t\t\n       BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\n       SECTION 1.  Section 161.133(a), Health and Safety Code, is \n\n\n\n \n\t\t\t\namended to read as follows:\n\n\n\n \n\t\t\t\n       (a)  The executive commissioner by rule shall require each \n\n\n\n \n\t\t\t\ninpatient mental health facility, treatment facility, or hospital \n\n\n\n \n\t\t\t\nthat provides comprehensive medical rehabilitation services to \n\n\n\n \n\t\t\t\nannually provide as a condition of continued licensure a minimum of \n\n\n\n \n\t\t\t\neight hours of initial inservice training for new employees and \n\n\n\n \n\t\t\t\nfour hours of continuing inservice training for continuing \n\n\n\n \n\t\t\t\nemployees that is designed to assist employees and health care \n\n\n\n \n\t\t\t\nprofessionals associated with the facility in identifying patient \n\n\n\n \n\t\t\t\nabuse or neglect and illegal, unprofessional, or unethical conduct \n\n\n\n \n\t\t\t\nby or in the facility.\n\n\n\n \n\t\t\t\n       SECTION 2.  Section 161.133(a), Health and Safety Code, as \n\n\n\n \n\t\t\t\namended by this Act, applies to the minimum number of inservice \n\n\n\n \n\t\t\t\ntraining hours provided as a condition of licensure by health care \n\n\n\n \n\t\t\t\nfacilities subject to that section on and after the effective date \n\n\n\n \n\t\t\t\nof this Act.  The minimum number of inservice training hours \n\n\n\n \n\t\t\t\nprovided before the effective date of this Act is governed by the \n\n\n\n \n\t\t\t\nlaw in effect immediately before the effective date of this Act, and \n\n\n\n \n\t\t\t\nthe former law is continued in effect for that purpose.\n\n\n\n \n\t\t\t\n       SECTION 3.  This Act takes effect September 1, 2023.\n\n\n\n"
    },
    "ocd-bill/c3d25ea7-77dc-4846-818d-71a4e2808670": {
        "id": "ocd-bill/c3d25ea7-77dc-4846-818d-71a4e2808670",
        "state": "Texas",
        "title": "Relating to newborn screening.",
        "chamber": "Senate",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/SB01667I.HTM",
        "text": "\n\n\n88(R) SB 1667 - Introduced version - Bill Text\n\n\n\n\n\n \n88R16232 TYPED\n\n\n \n\n\n \n\n\t\tBy: Parker\nS.B. No. 1667\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA BILL TO BE ENTITLED\n\n\n\n\n \n\t\t\t\n\nAN ACT\n\n\n\n\n \n\t\t\t\nrelating to newborn screening.\n\n\n\n \n\t\t\t\n       BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\n       SECTION 1.  Subchapter A, Chapter 33, Health and Safety \n\n\n\n \n\t\t\t\nCode, is amended by adding Section 33.00211 to read as follows:\n\n\n\n \n\t\t\t\n33.00211. DUCHENE MUSCULAR DYSTROPHY.  Notwithstanding any \n\n\n\n \n\t\t\t\nprovision of this chapter, the department shall include Duchenne \n\n\n\n \n\t\t\t\nmuscular dystrophy in the detection and treatment program \n\n\n\n \n\t\t\t\nestablished under this chapter, in the screening for heritable \n\n\n\n \n\t\t\t\ndiseases conducted under Subchapter B, and in the newborn screening \n\n\n\n \n\t\t\t\nservices provided under Subchapter C.\n\n\n\n \n\t\t\t\n       SECTION 12.  As soon as practicable after the effective date \n\n\n\n \n\t\t\t\nof this Act, the Department of State Health Services shall \n\n\n\n \n\t\t\t\nimplement Section 33.00211, Health and Safety Code.\n\n\n\n \n\t\t\t\n       SECTION 13.  This Act takes effect September 1, 2023.\n\n\n\n"
    },
    "ocd-bill/38af30db-13ee-400a-bd2a-9af0b8ff0fa9": {
        "id": "ocd-bill/38af30db-13ee-400a-bd2a-9af0b8ff0fa9",
        "state": "Texas",
        "title": "Congratulating Terri Tipton Holder on her retirement as judge of the 149th District Court.",
        "chamber": "House",
        "created_date": "2023-02-21",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00297I.HTM",
        "text": "\n\n\n88(R) HR 297 - Introduced version - Bill Text\n\n\n\n\n\n \n88R11483 EME-D\n\n\n \n\n\n \n\n\t\tBy: Vasut\nH.R. No. 297\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, The Honorable Terri Tipton Holder retired as judge \n\n\n\n \n\t\t\t\nof the 149th District Court at the end of her term in 2022, drawing \n\n\n\n \n\t\t\t\nto a close 12 years of exemplary service to the people of Brazoria \n\n\n\n \n\t\t\t\nCounty; and\n\n\n\n \n\t\t\t\n       WHEREAS, Judge Holder was first elected in 2010, and she was \n\n\n\n \n\t\t\t\nreelected, unopposed, in 2014 and 2018; formerly a licensed peace \n\n\n\n \n\t\t\t\nofficer and a Brazoria County assistant district attorney, she was \n\n\n\n \n\t\t\t\nthe first woman elected as district court judge in Brazoria County; \n\n\n\n \n\t\t\t\nand\n\n\n\n \n\t\t\t\n       WHEREAS, A 1977 graduate of Sam Houston State University, \n\n\n\n \n\t\t\t\nTerri Holder earned her law degree at the South Texas College of Law \n\n\n\n \n\t\t\t\nin 1982; for 28 years, she practiced law in civil and criminal \n\n\n\n \n\t\t\t\ncases, including more than 100 jury trials as first chair attorney, \n\n\n\n \n\t\t\t\nand she appeared before appellate courts at all levels; she served \n\n\n\n \n\t\t\t\nwith the Walker County special prosecution unit, and she is a former \n\n\n\n \n\t\t\t\npresident of the Brazoria County Bar Association; and\n\n\n\n \n\t\t\t\n       WHEREAS, Judge Holder has also found time to contribute to \n\n\n\n \n\t\t\t\nher community; she implemented and directed the county's For Kids' \n\n\n\n \n\t\t\t\nSake program, and she has served on the boards of the Brazoria \n\n\n\n \n\t\t\t\nCounty Association for Citizens with Handicaps, Angleton Area \n\n\n\n \n\t\t\t\nEmergency Medical Corps, the Brazoria County Fair Association, and \n\n\n\n \n\t\t\t\nthe chief's advisory committee of the Freeport Police Department; \n\n\n\n \n\t\t\t\nand\n\n\n\n \n\t\t\t\n       WHEREAS, In all her endeavors, she benefits from the love and \n\n\n\n \n\t\t\t\nsupport of her husband, the Honorable Marc Holder, and she takes \n\n\n\n \n\t\t\t\ngreat pride in their three children, Stephani, Randi, and Cody, and \n\n\n\n \n\t\t\t\ntheir 10 grandchildren; she has been an active member of Second \n\n\n\n \n\t\t\t\nBaptist Church since 1982; and\n\n\n\n \n\t\t\t\n       WHEREAS, Terri Holder's dedication, integrity, and \n\n\n\n \n\t\t\t\ncommitment to justice have greatly benefited the citizens of \n\n\n\n \n\t\t\t\nBrazoria County and earned her the respect and admiration of her \n\n\n\n \n\t\t\t\npeers, and she may indeed reflect with pride on her record of \n\n\n\n \n\t\t\t\nservice as she embarks on the next exciting chapter of her life; \n\n\n\n \n\t\t\t\nnow, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby congratulate Terri Tipton Holder on her \n\n\n\n \n\t\t\t\nretirement from the 149th District Court and extend to her sincere \n\n\n\n \n\t\t\t\nbest wishes for continued success and happiness; and, be it further\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for Judge Holder as an expression of high regard by the \n\n\n\n \n\t\t\t\nTexas House of Representatives.\n\n\n\n"
    },
    "ocd-bill/018b7459-fc78-4e76-b1bc-db17588c40e7": {
        "id": "ocd-bill/018b7459-fc78-4e76-b1bc-db17588c40e7",
        "state": "Texas",
        "title": "Relating to judicial review of certain permitting decisions made by the Texas Commission on Environmental Quality.",
        "chamber": "House",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HB03666I.HTM",
        "text": "\n\n\n88(R) HB 3666 - Introduced version - Bill Text\n\n\n\n\n\n \n88R8379 JXC-F\n\n\n \n\n\n \n\n\t\tBy: Kuempel\nH.B. No. 3666\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA BILL TO BE ENTITLED\n\n\n\n\n \n\t\t\t\n\nAN ACT\n\n\n\n\n \n\t\t\t\nrelating to judicial review of certain permitting decisions made by \n\n\n\n \n\t\t\t\nthe Texas Commission on Environmental Quality.\n\n\n\n \n\t\t\t\n       BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\n       SECTION 1.  Section 5.354, Water Code, is amended to read as \n\n\n\n \n\t\t\t\nfollows:\n\n\n\n \n\t\t\t\n       Sec. 5.354.  VENUE.  (a)  Except as provided by Subsection \n\n\n\n \n\t\t\t\n(b), a [A] suit instituted under Section 5.351 or 5.352 [of this \n\n\n\n \n\t\t\t\ncode] must be brought in a district court in Travis County.\n\n\n\n \n\t\t\t\n       (b)  A suit instituted under Section 5.351 that relates to \n\n\n\n \n\t\t\t\nthe issuance of a permit under Chapter 26 must be brought in a \n\n\n\n \n\t\t\t\ncounty in which the permitted point of discharge of waste is located \n\n\n\n \n\t\t\t\nor proposed to be located.\n\n\n\n \n\t\t\t\n       SECTION 2.  Subchapter I, Chapter 5, Water Code, is amended \n\n\n\n \n\t\t\t\nby adding Section 5.3541 to read as follows:\n\n\n\n \n\t\t\t\n       Sec. 5.3541.  SCOPE OF JUDICIAL REVIEW OF CHAPTER 26 PERMIT.  \n\n\n\n \n\t\t\t\n(a)  This section applies only to a suit instituted under Section \n\n\n\n \n\t\t\t\n5.351 that relates to the issuance of a permit under Chapter 26.\n\n\n\n \n\t\t\t\n       (b)  The scope of review by the court is limited to:\n\n\n\n \n\t\t\t\n             (1)  an argument brought before the commission during \n\n\n\n \n\t\t\t\nconsideration of the ruling, order, decision, or other act that is \n\n\n\n \n\t\t\t\nthe subject of the suit; and\n\n\n\n \n\t\t\t\n             (2)  an allegation of the commission's violation of \n\n\n\n \n\t\t\t\nthis code or a commission rule committed during consideration of \n\n\n\n \n\t\t\t\nthe ruling, order, decision, or other act that is the subject of the \n\n\n\n \n\t\t\t\nsuit.\n\n\n\n \n\t\t\t\n       (c)  The petition submitted under Section 5.351 must \n\n\n\n \n\t\t\t\ninclude:\n\n\n\n \n\t\t\t\n             (1)  a citation to each specific section of the \n\n\n\n \n\t\t\t\nstatutes and rules involved in the matter under review; and\n\n\n\n \n\t\t\t\n             (2)  a citation to the administrative record to support \n\n\n\n \n\t\t\t\neach allegation in the petition.\n\n\n\n \n\t\t\t\n       (d)  The court shall give deference to the actions of the \n\n\n\n \n\t\t\t\ncommission consistent with applicable law and may find an action \n\n\n\n \n\t\t\t\nunlawful only if:\n\n\n\n \n\t\t\t\n             (1)  no evidence supports the commission's action; or\n\n\n\n \n\t\t\t\n             (2)  the commission's action was not based on a \n\n\n\n \n\t\t\t\npermissible construction of the statute.\n\n\n\n \n\t\t\t\n       (e)  The court may not substitute its judgment for a judgment \n\n\n\n \n\t\t\t\nof the commission on water quality degradation.\n\n\n\n \n\t\t\t\n       SECTION 3.  The changes in law made by this Act apply only to \n\n\n\n \n\t\t\t\na suit instituted under Section 5.351, Water Code, on or after the \n\n\n\n \n\t\t\t\neffective date of this Act.  A suit instituted under Section 5.351, \n\n\n\n \n\t\t\t\nWater Code, before the effective date of this Act is governed by the \n\n\n\n \n\t\t\t\nlaw in effect at the time the suit was instituted, and the former \n\n\n\n \n\t\t\t\nlaw is continued in effect for that purpose.\n\n\n\n \n\t\t\t\n       SECTION 4.  This Act takes effect September 1, 2023.\n\n\n\n"
    },
    "ocd-bill/608edeef-5b07-414d-93cf-bfdc550ca173": {
        "id": "ocd-bill/608edeef-5b07-414d-93cf-bfdc550ca173",
        "state": "Texas",
        "title": "Recognizing March 23, 2023, as San Patricio County Day at the State Capitol.",
        "chamber": "House",
        "created_date": "2023-02-09",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00199I.HTM",
        "text": "\n\n\n88(R) HR 199 - Introduced version - Bill Text\n\n\n\n\n\n \n88R9688 BPG-D\n\n\n \n\n\n \n\n\t\tBy: Lozano\nH.R. No. 199\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Residents of San Patricio County are gathering in \n\n\n\n \n\t\t\t\nAustin on March 23, 2023, to celebrate San Patricio County Day at \n\n\n\n \n\t\t\t\nthe State Capitol; and\n\n\n\n \n\t\t\t\n       WHEREAS, Situated on the broad coastal plain along the Gulf \n\n\n\n \n\t\t\t\nof Mexico, this region was originally inhabited by the Karankawa \n\n\n\n \n\t\t\t\nIndians; in 1829, 200 Irish families from New York formed a colony \n\n\n\n \n\t\t\t\nunder a contract with the government of Mexico and founded the town \n\n\n\n \n\t\t\t\nof San Patricio de Hibernia, in honor of Saint Patrick, the patron \n\n\n\n \n\t\t\t\nsaint of Ireland; the town was the site of a battle during the Texas \n\n\n\n \n\t\t\t\nRevolution in 1836, and later that same year, San Patricio County \n\n\n\n \n\t\t\t\nwas created by the new Republic of Texas; and\n\n\n\n \n\t\t\t\n       WHEREAS, By 1860, San Patricio County was occupied by \n\n\n\n \n\t\t\t\nranchers and farmers, and during the Civil War, a Confederate fort \n\n\n\n \n\t\t\t\nwas built at Aransas Pass to deal with smugglers, rustlers, and \n\n\n\n \n\t\t\t\nFederal raiders; the county's economy was boosted in 1885 when the \n\n\n\n \n\t\t\t\nSan Antonio and Aransas Pass Railway was extended to Aransas \n\n\n\n \n\t\t\t\nHarbor; the town of Sinton, named after an Ohio banker who had \n\n\n\n \n\t\t\t\ninvested in the area's development, was designated as the county \n\n\n\n \n\t\t\t\nseat in 1893; and\n\n\n\n \n\t\t\t\n       WHEREAS, Oil and gas were discovered in the county in the \n\n\n\n \n\t\t\t\nearly 20th century, and the petroleum industry and agriculture \n\n\n\n \n\t\t\t\ncontinue to be the foundation of the economy; cotton, sorghum, and \n\n\n\n \n\t\t\t\ncattle are all major products, along with shrimp from the \n\n\n\n \n\t\t\t\ncommercial fisheries along the coast; the completion of a major \n\n\n\n \n\t\t\t\ndredging and expansion project at the La Quinta Ship Channel has \n\n\n\n \n\t\t\t\nincreased opportunities for strategic international business \n\n\n\n \n\t\t\t\npartnerships, and in recent years, foreign and domestic companies \n\n\n\n \n\t\t\t\nhave invested billions of dollars in the county's industrial \n\n\n\n \n\t\t\t\nsector; and\n\n\n\n \n\t\t\t\n       WHEREAS, Today, the people of San Patricio County enjoy a \n\n\n\n \n\t\t\t\nrelaxed rural lifestyle while taking advantage of their proximity \n\n\n\n \n\t\t\t\nto the city of Corpus Christi; hunters, birders, kayakers, \n\n\n\n \n\t\t\t\nsnorkelers, and devotees of sport fishing travel to the county for \n\n\n\n \n\t\t\t\nits many opportunities for recreation; the county is also home to \n\n\n\n \n\t\t\t\nthe Welder Wildlife Refuge, one of the largest privately endowed \n\n\n\n \n\t\t\t\nrefuges in the world; and\n\n\n\n \n\t\t\t\n       WHEREAS, Celebrating their colorful past as they work to \n\n\n\n \n\t\t\t\nbuild an even brighter future, those Texans who call San Patricio \n\n\n\n \n\t\t\t\nCounty home may indeed take great pride in the important role their \n\n\n\n \n\t\t\t\nunique region plays in the story of the Lone Star State; now, \n\n\n\n \n\t\t\t\ntherefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby recognize March 23, 2023, as San Patricio County \n\n\n\n \n\t\t\t\nDay at the State Capitol and extend a warm welcome to the visiting \n\n\n\n \n\t\t\t\ndelegation.\n\n\n\n"
    },
    "ocd-bill/1ee4f8e1-7701-4578-b75c-351cf2b824ac": {
        "id": "ocd-bill/1ee4f8e1-7701-4578-b75c-351cf2b824ac",
        "state": "Texas",
        "title": "Relating to annual cost-of-living increases applicable to benefits paid by the Teacher Retirement System of Texas.",
        "chamber": "House",
        "created_date": "2022-11-16",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HB00429I.HTM",
        "text": "\n\n\n88(R) HB 429 - Introduced version - Bill Text\n\n\n\n\n\n \n88R2369 BDP-D\n\n\n \n\n\n \n\n\t\tBy: Schofield\nH.B. No. 429\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA BILL TO BE ENTITLED\n\n\n\n\n \n\t\t\t\n\nAN ACT\n\n\n\n\n \n\t\t\t\nrelating to annual cost-of-living increases applicable to benefits \n\n\n\n \n\t\t\t\npaid by the Teacher Retirement System of Texas.\n\n\n\n \n\t\t\t\n       BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\n       SECTION 1.  Subchapter H, Chapter 824, Government Code, is \n\n\n\n \n\t\t\t\namended by adding Section 824.703 to read as follows:\n\n\n\n \n\t\t\t\n       Sec. 824.703.  ANNUAL COST-OF-LIVING ADJUSTMENTS FOR \n\n\n\n \n\t\t\t\nINFLATION.  (a)  Notwithstanding any other law, the amount of a \n\n\n\n \n\t\t\t\nservice retirement benefit, disability retirement benefit, or \n\n\n\n \n\t\t\t\ndeath benefit paid under this chapter is adjusted in accordance \n\n\n\n \n\t\t\t\nwith this section as necessary to reflect inflation.\n\n\n\n \n\t\t\t\n       (b)  On January 1 of each year, the board of trustees shall \n\n\n\n \n\t\t\t\nincrease the amount of each benefit payable under this chapter by a \n\n\n\n \n\t\t\t\npercentage rate equal to the percentage increase, if any, during \n\n\n\n \n\t\t\t\nthe preceding state fiscal year in the Consumer Price Index for All \n\n\n\n \n\t\t\t\nUrban Consumers published by the United States Department of Labor, \n\n\n\n \n\t\t\t\nBureau of Labor Statistics, or if that index is discontinued or \n\n\n\n \n\t\t\t\nsuperseded, a similar index selected or calculated by the \n\n\n\n \n\t\t\t\ncomptroller.\n\n\n\n \n\t\t\t\n       SECTION 2.  This Act applies only to a benefit paid by the \n\n\n\n \n\t\t\t\nTeacher Retirement System of Texas on or after January 1, 2024.\n\n\n\n \n\t\t\t\n       SECTION 3.  This Act takes effect September 1, 2023.\n\n\n\n"
    },
    "ocd-bill/ed22ca75-2a96-45a6-990f-0f1f4a051988": {
        "id": "ocd-bill/ed22ca75-2a96-45a6-990f-0f1f4a051988",
        "state": "Texas",
        "title": "Relating to a defense to prosecution for the offense of cruelty to nonlivestock animals under certain circumstances.",
        "chamber": "House",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HB03660I.HTM",
        "text": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis version is not currently available, but is coming\r\nsoon.  In the meantime, please see the PDF\r\nfor the content of this bill.\n\n\n\n"
    },
    "ocd-bill/c610fadf-2134-41f5-a582-3c14e956ffb6": {
        "id": "ocd-bill/c610fadf-2134-41f5-a582-3c14e956ffb6",
        "state": "Texas",
        "title": "Recognizing March 8, 2023, as Pleasanton Day at the State Capitol.",
        "chamber": "House",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00497I.HTM",
        "text": "\n\n\n88(R) HR 497 - Introduced version - Bill Text\n\n\n\n\n\n \n88R16175 BHH-D\n\n\n \n\n\n \n\n\t\tBy: King of Uvalde\nH.R. No. 497\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Proud residents of Pleasanton are gathering in \n\n\n\n \n\t\t\t\nAustin on March 8, 2023, to celebrate Pleasanton Day at the State \n\n\n\n \n\t\t\t\nCapitol; and\n\n\n\n \n\t\t\t\n       WHEREAS, Situated in Atascosa County at the juncture of the \n\n\n\n \n\t\t\t\nAtascosa River and Bonita Creek, Pleasanton was founded in 1858 as \n\n\n\n \n\t\t\t\nthe new county seat and took its name from early settler John \n\n\n\n \n\t\t\t\nPleasant; though the county seat was moved to Jourdanton in 1910, \n\n\n\n \n\t\t\t\nthe town continued to thrive, and it was officially incorporated in \n\n\n\n \n\t\t\t\n1917; over the years, it became a gathering place for cowboys \n\n\n\n \n\t\t\t\ndriving cattle to Kansas and eventually adopted the moniker the \n\n\n\n \n\t\t\t\n\"Birthplace of the Cowboy\"; and\n\n\n\n \n\t\t\t\n       WHEREAS, Today, Pleasanton boasts a population of nearly \n\n\n\n \n\t\t\t\n11,000 people and is known as \"The City of Live Oaks and Friendly \n\n\n\n \n\t\t\t\nFolks\"; the community is served by the Pleasanton Independent \n\n\n\n \n\t\t\t\nSchool District, which encompasses a primary, elementary, junior \n\n\n\n \n\t\t\t\nhigh, and high school, and it benefits from the educational and \n\n\n\n \n\t\t\t\nvocational opportunities provided by Coastal Bend College; local \n\n\n\n \n\t\t\t\nresidents and visitors enjoy a number of annual community events, \n\n\n\n \n\t\t\t\nincluding Cowboy Heritage Days, Merry on Main, and a Fourth of July \n\n\n\n \n\t\t\t\ncelebration; and\n\n\n\n \n\t\t\t\n       WHEREAS, The citizens of Pleasanton are working to preserve \n\n\n\n \n\t\t\t\nthe best of their past while building a future of expanding \n\n\n\n \n\t\t\t\nopportunity, and its citizens may indeed take pride in the role \n\n\n\n \n\t\t\t\ntheir community plays in the story of the Lone Star State; now, \n\n\n\n \n\t\t\t\ntherefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby recognize March 8, 2023, as Pleasanton Day at \n\n\n\n \n\t\t\t\nthe State Capitol and extend a warm welcome to the visiting \n\n\n\n \n\t\t\t\ndelegation.\n\n\n\n"
    },
    "ocd-bill/a396bfa4-300b-4434-9765-43fdb9076b6e": {
        "id": "ocd-bill/a396bfa4-300b-4434-9765-43fdb9076b6e",
        "state": "Texas",
        "title": "Congratulating Sam Bennett of Texas A&M University on winning the 2022 U.S. Amateur golf championship.",
        "chamber": "House",
        "created_date": "2023-02-08",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00191I.HTM",
        "text": "\n\n\n88(R) HR 191 - Introduced version - Bill Text\n\n\n\n\n\n \n88R11384 EME-D\n\n\n \n\n\n \n\n\t\tBy: Kacal\nH.R. No. 191\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Sam Bennett of Texas A&M University reached a new \n\n\n\n \n\t\t\t\nlevel of achievement in his golf career by winning the 2022 \n\n\n\n \n\t\t\t\nU.S. Amateur championship; and\n\n\n\n \n\t\t\t\n       WHEREAS, Joining the nation's other top amateur players in \n\n\n\n \n\t\t\t\nParamus, New Jersey, from August 15 through 21, Mr. Bennett closed \n\n\n\n \n\t\t\t\nout the event with an exceptional performance in the 36-hole \n\n\n\n \n\t\t\t\nchampionship round; with Texas A&M golf coach Brian Kortan serving \n\n\n\n \n\t\t\t\nas his caddie, he gained a three-shot advantage over his match play \n\n\n\n \n\t\t\t\nopponent during the first 18 holes; he continued his momentum down \n\n\n\n \n\t\t\t\nthe stretch before finding himself clutching a one-shot lead on the \n\n\n\n \n\t\t\t\nfinal tee; demonstrating tremendous poise, he parred the hole to \n\n\n\n \n\t\t\t\nclaim a hard-fought victory and the right to hoist the coveted \n\n\n\n \n\t\t\t\nHavemeyer Trophy; and\n\n\n\n \n\t\t\t\n       WHEREAS, Mr. Bennett holds the No. 2 spot in the World \n\n\n\n \n\t\t\t\nAmateur Golf Rankings, and he defeated five players ranked in the \n\n\n\n \n\t\t\t\ntop 30 over the course of the U.S. Amateur tournament; by reaching \n\n\n\n \n\t\t\t\nthe title match, he earned an exemption to the 2023 U.S. Open and is \n\n\n\n \n\t\t\t\neligible to compete in that event as an amateur or a professional; \n\n\n\n \n\t\t\t\nhe also received amateur-status invitations to the 2023 British \n\n\n\n \n\t\t\t\nOpen Championship and the 2023 Masters Tournament; and\n\n\n\n \n\t\t\t\n       WHEREAS, During his tenure as a member of the Aggie golf team, \n\n\n\n \n\t\t\t\nMr. Bennett has twice been selected as a PING First Team \n\n\n\n \n\t\t\t\nAll-American; he was especially impressive over the course of the \n\n\n\n \n\t\t\t\n2021-2022 season, competing in 10 tournaments and breaking the \n\n\n\n \n\t\t\t\nschool record for lowest stroke average; his efforts earned him the \n\n\n\n \n\t\t\t\nSoutheastern Conference Golfer of the Year accolade for 2022, and \n\n\n\n \n\t\t\t\nhe was a finalist for the Ben Hogan and Fred Haskins Awards; and\n\n\n\n \n\t\t\t\n       WHEREAS, In conquering the U.S. Amateur field, Sam Bennett \n\n\n\n \n\t\t\t\nhas earned a place in the pantheon of elite golfers who have claimed \n\n\n\n \n\t\t\t\nthe tournament crown, and he may indeed reflect with pride on this \n\n\n\n \n\t\t\t\nexceptional accomplishment; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby congratulate Sam Bennett on winning the 2022 \n\n\n\n \n\t\t\t\nU.S. Amateur golf championship and extend to him sincere best \n\n\n\n \n\t\t\t\nwishes for continued success; and, be it further\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for Mr. Bennett as an expression of high regard by the \n\n\n\n \n\t\t\t\nTexas House of Representatives.\n\n\n\n"
    }
}{
    "ocd-bill/5d690c38-0685-45d7-abc2-1e5cc762e1cc": {
        "id": "ocd-bill/5d690c38-0685-45d7-abc2-1e5cc762e1cc",
        "state": "Texas",
        "title": "In memory of Mary Ellen Spiller of Jacksboro.",
        "chamber": "House",
        "created_date": "2022-11-16",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00007I.HTM",
        "text": "\n\n\n88(R) HR 7 - Introduced version - Bill Text\n\n\n\n\n\n \n88R1183 JRI-D\n\n\n \n\n\n \n\n\t\tBy: Spiller\nH.R. No. 7\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Family and friends have suffered an immeasurable \n\n\n\n \n\t\t\t\nloss with the passing of Mary Ellen Spiller of Jacksboro on March 7, \n\n\n\n \n\t\t\t\n2022, at the age of 87; and\n\n\n\n \n\t\t\t\n       WHEREAS, The daughter of Guy and Lillian Hutson, the former \n\n\n\n \n\t\t\t\nMary Hutson was born on October 5, 1934, in Grandfield, Oklahoma, \n\n\n\n \n\t\t\t\nand grew up with seven older siblings, Weldon, Harold, Raymond, \n\n\n\n \n\t\t\t\nMarie, Jerry, Jean, and Joyce; she graduated from Devol High School \n\n\n\n \n\t\t\t\nin Cotton County, Oklahoma, and continued her education at \n\n\n\n \n\t\t\t\nDraughon's Business College in Wichita Falls; and\n\n\n\n \n\t\t\t\n       WHEREAS, While living in Wichita Falls, she met her future \n\n\n\n \n\t\t\t\nhusband, James Spiller, who was stationed at Sheppard Air Force \n\n\n\n \n\t\t\t\nBase; the couple married on August 18, 1956, and became the proud \n\n\n\n \n\t\t\t\nparents of three children, David, Karen, and Scott; as the years \n\n\n\n \n\t\t\t\npassed, Mrs. Spiller had the privilege of seeing her family grow to \n\n\n\n \n\t\t\t\ninclude six grandsons and three great-grandchildren; and\n\n\n\n \n\t\t\t\n       WHEREAS, Mrs. Spiller skillfully balanced family life with a \n\n\n\n \n\t\t\t\nrewarding career as her husband's legal secretary in his solo \n\n\n\n \n\t\t\t\npractice and at Spiller & Spiller in Jacksboro; she also worked for \n\n\n\n \n\t\t\t\nSpiller Title for six decades; and\n\n\n\n \n\t\t\t\n       WHEREAS, Sustained by a strong faith, Mrs. Spiller took an \n\n\n\n \n\t\t\t\nactive role at First United Methodist Church, teaching Sunday \n\n\n\n \n\t\t\t\nschool and singing with the choir; moreover, she was a valued member \n\n\n\n \n\t\t\t\nof the Business & Professional Women's Club of Jacksboro; and\n\n\n\n \n\t\t\t\n       WHEREAS, Admired for her kindness, her strength of character, \n\n\n\n \n\t\t\t\nand her outgoing personality, Mary Spiller led a caring and \n\n\n\n \n\t\t\t\npurposeful life, and she will forever be a source of inspiration to \n\n\n\n \n\t\t\t\nthose she leaves behind; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby pay tribute to the memory of Mary Ellen Spiller \n\n\n\n \n\t\t\t\nand extend sincere condolences to the members of her family: to her \n\n\n\n \n\t\t\t\nchildren, David Spiller and his wife, Ginger, and Karen Forbis and \n\n\n\n \n\t\t\t\nher husband, Chris; to her daughter-in-law, Laura Spiller; to her \n\n\n\n \n\t\t\t\ngrandsons, Mason, Reid, Drew, and Kyle Spiller and Alex and Joel \n\n\n\n \n\t\t\t\nForbis; to her great-grandchildren, John, Carson, and Caroline \n\n\n\n \n\t\t\t\nSpiller; and to her other relatives and friends; and, be it further\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for her family and that when the Texas House of \n\n\n\n \n\t\t\t\nRepresentatives adjourns this day, it do so in memory of Mary Ellen \n\n\n\n \n\t\t\t\nSpiller.\n\n\n\n"
    },
    "ocd-bill/5eaa62cd-1ba5-400d-933d-acbfe79a10d5": {
        "id": "ocd-bill/5eaa62cd-1ba5-400d-933d-acbfe79a10d5",
        "state": "Texas",
        "title": "Relating to the processing of United States passport applications by a district court clerk; authorizing fees.",
        "chamber": "House",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HB03607I.HTM",
        "text": "\n\n\n88(R) HB 3607 - Introduced version - Bill Text\n\n\n\n\n\n \n88R5801 JTZ-F\n\n\n \n\n\n \n\n\t\tBy: Cole\nH.B. No. 3607\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA BILL TO BE ENTITLED\n\n\n\n\n \n\t\t\t\n\nAN ACT\n\n\n\n\n \n\t\t\t\nrelating to the processing of United States passport applications \n\n\n\n \n\t\t\t\nby a district court clerk; authorizing fees.\n\n\n\n \n\t\t\t\n       BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\n       SECTION 1.  Sections 51.3031(a) and (b), Government Code, \n\n\n\n \n\t\t\t\nare amended to read as follows:\n\n\n\n \n\t\t\t\n       (a)  A district clerk may perform all duties necessary to \n\n\n\n \n\t\t\t\nprocess an application for a United States passport, including \n\n\n\n \n\t\t\t\ntaking passport photographs and selling money orders to applicants \n\n\n\n \n\t\t\t\nfor payment purposes.\n\n\n\n \n\t\t\t\n       (b)  To recover the costs of taking passport photographs and \n\n\n\n \n\t\t\t\nselling money orders, a district clerk may collect [a] reasonable \n\n\n\n \n\t\t\t\nfees for the provided services [fee] in amounts [an amount] set by \n\n\n\n \n\t\t\t\nthe commissioners court of the county in which the district clerk's \n\n\n\n \n\t\t\t\noffice is located.\n\n\n\n \n\t\t\t\n       SECTION 2.  This Act takes effect September 1, 2023.\n\n\n\n"
    },
    "ocd-bill/d4bce314-20aa-4686-ae6e-3d471edc9a6b": {
        "id": "ocd-bill/d4bce314-20aa-4686-ae6e-3d471edc9a6b",
        "state": "Texas",
        "title": "Relating to the citizenship status of and the form of birth certificates for certain children born in this state.",
        "chamber": "House",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HB03612I.HTM",
        "text": "\n\n\n88(R) HB 3612 - Introduced version - Bill Text\n\n\n\n\n\n \n88R11322 MPF-D\n\n\n \n\n\n \n\n\t\tBy: Toth\nH.B. No. 3612\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA BILL TO BE ENTITLED\n\n\n\n\n \n\t\t\t\n\nAN ACT\n\n\n\n\n \n\t\t\t\nrelating to the citizenship status of and the form of birth \n\n\n\n \n\t\t\t\ncertificates for certain children born in this state.\n\n\n\n \n\t\t\t\n       BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\n       SECTION 1.  The Government Code is amended by adding Title 13 \n\n\n\n \n\t\t\t\nto read as follows:\n\n\n\n \n\t\t\t\nTITLE 13.  CITIZENSHIP\n\n\n\n \n\t\t\t\nCHAPTER 5001.  CITIZENSHIP OF CHILD BORN IN THIS STATE\n\n\n\n \n\t\t\t\n       Sec. 5001.001.  CITIZENSHIP STATUS OF CERTAIN CHILDREN.  \n\n\n\n \n\t\t\t\nNotwithstanding any other law, a child born in this state is not \n\n\n\n \n\t\t\t\nconsidered a United States citizen and may not be granted status as \n\n\n\n \n\t\t\t\na citizen in this state if neither of the child's parents are \n\n\n\n \n\t\t\t\ncitizens of the United States.\n\n\n\n \n\t\t\t\n       SECTION 2.  Section 192.002, Health and Safety Code, is \n\n\n\n \n\t\t\t\namended by adding Subsection (c-1) to read as follows:\n\n\n\n \n\t\t\t\n       (c-1)  The form must include a space for recording the \n\n\n\n \n\t\t\t\ncitizenship status of the mother and father.\n\n\n\n \n\t\t\t\n       SECTION 3.  This Act takes effect September 1, 2023.\n\n\n\n"
    },
    "ocd-bill/7e9287b0-6a5b-49e8-b54d-5ecda8967ed7": {
        "id": "ocd-bill/7e9287b0-6a5b-49e8-b54d-5ecda8967ed7",
        "state": "Texas",
        "title": "Congratulating Kaufman County on being named a Silver Star Affiliate by Keep Texas Beautiful.",
        "chamber": "House",
        "created_date": "2023-01-24",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00075I.HTM",
        "text": "\n\n\n88(R) HR 75 - Introduced version - Bill Text\n\n\n\n\n\n \n88R3828 CJM-D\n\n\n \n\n\n \n\n\t\tBy: Bell of Kaufman\nH.R. No. 75\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Kaufman County was named a Silver Star Affiliate by \n\n\n\n \n\t\t\t\nKeep Texas Beautiful in 2022; and\n\n\n\n \n\t\t\t\n       WHEREAS, Tracing its origins back to 1967, Keep Texas \n\n\n\n \n\t\t\t\nBeautiful is a grassroots nonprofit organization dedicated to \n\n\n\n \n\t\t\t\nimproving the environment and community; last year, the group's \n\n\n\n \n\t\t\t\nnearly 300 affiliates engaged more than 41,000 volunteers who \n\n\n\n \n\t\t\t\ncollected 3.25 million pounds of waste and recyclables from Texas \n\n\n\n \n\t\t\t\nroadways, trails, and waterways; and\n\n\n\n \n\t\t\t\n       WHEREAS, One of only 28 affiliates to receive this notable \n\n\n\n \n\t\t\t\ndesignation, Kaufman County was recognized for going above and \n\n\n\n \n\t\t\t\nbeyond the established Keep Texas Beautiful requirements; its Keep \n\n\n\n \n\t\t\t\nKaufman County Beautiful Committee has launched a number of \n\n\n\n \n\t\t\t\nsuccessful programs, including those dedicated to cleaning up \n\n\n\n \n\t\t\t\nlitter, reducing and recycling waste, and beautifying the \n\n\n\n \n\t\t\t\ncommunity; moreover, it endeavors to keep area residents informed \n\n\n\n \n\t\t\t\nthrough monthly cleanup schedules and educational initiatives at \n\n\n\n \n\t\t\t\nschools, libraries, and local events; and\n\n\n\n \n\t\t\t\n       WHEREAS, Through the Keep Kaufman County Beautiful \n\n\n\n \n\t\t\t\nCommittee, Kaufman County is working to protect and enhance the \n\n\n\n \n\t\t\t\nlocal environment, and it is indeed deserving of this recent honor; \n\n\n\n \n\t\t\t\nnow, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby congratulate Kaufman County on being named a \n\n\n\n \n\t\t\t\nSilver Star Affiliate by Keep Texas Beautiful and extend to all \n\n\n\n \n\t\t\t\nthose associated with the Keep Kaufman County Beautiful Committee \n\n\n\n \n\t\t\t\nsincere best wishes for continued success with their important \n\n\n\n \n\t\t\t\nwork; and, be it further\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for the county as an expression of high regard by the Texas \n\n\n\n \n\t\t\t\nHouse of Representatives.\n\n\n\n"
    },
    "ocd-bill/a3f3231a-ff28-4978-bc0e-45bc9de0fa84": {
        "id": "ocd-bill/a3f3231a-ff28-4978-bc0e-45bc9de0fa84",
        "state": "Texas",
        "title": "Relating to the creation of the criminal offense of prosecutorial misconduct.",
        "chamber": "House",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HB03677I.HTM",
        "text": "\n\n\n88(R) HB 3677 - Introduced version - Bill Text\n\n\n\n\n\n \n88R11311 CJD-D\n\n\n \n\n\n \n\n\t\tBy: Jones of Harris\nH.B. No. 3677\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA BILL TO BE ENTITLED\n\n\n\n\n \n\t\t\t\n\nAN ACT\n\n\n\n\n \n\t\t\t\nrelating to the creation of the criminal offense of prosecutorial \n\n\n\n \n\t\t\t\nmisconduct.\n\n\n\n \n\t\t\t\n       BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\n       SECTION 1.  Chapter 39, Penal Code, is amended by adding \n\n\n\n \n\t\t\t\nSection 39.08 to read as follows:\n\n\n\n \n\t\t\t\n       Sec. 39.08.  PROSECUTORIAL MISCONDUCT.  (a)  In this \n\n\n\n \n\t\t\t\nsection, \"attorney representing the state\" means a district \n\n\n\n \n\t\t\t\nattorney, criminal district attorney, or county attorney with \n\n\n\n \n\t\t\t\ncriminal jurisdiction.\n\n\n\n \n\t\t\t\n       (b)  An attorney representing the state commits an offense if \n\n\n\n \n\t\t\t\nthe attorney, while discharging the attorney's official duties in  \n\n\n\n \n\t\t\t\nthe prosecution of a criminal case:\n\n\n\n \n\t\t\t\n             (1)  with intent to deceive and with knowledge of the \n\n\n\n \n\t\t\t\nstatement's meaning, makes a false statement of a fact material to \n\n\n\n \n\t\t\t\nthe criminal case to the defendant, the attorney representing the \n\n\n\n \n\t\t\t\ndefendant, a witness, or the court;\n\n\n\n \n\t\t\t\n             (2)  makes, presents, or uses any record, document, or \n\n\n\n \n\t\t\t\nother item as evidence with knowledge of its falsity and with intent \n\n\n\n \n\t\t\t\nto affect the course or outcome of the criminal case;\n\n\n\n \n\t\t\t\n             (3)  with intent to influence the witness, coerces a \n\n\n\n \n\t\t\t\nwitness or a prospective witness in the criminal case to:\n\n\n\n \n\t\t\t\n                   (A)  testify falsely;\n\n\n\n \n\t\t\t\n                   (B)  withhold any testimony, information, \n\n\n\n \n\t\t\t\ndocument, or item;\n\n\n\n \n\t\t\t\n                   (C)  elude legal process summoning the witness to \n\n\n\n \n\t\t\t\ntestify or supply evidence;\n\n\n\n \n\t\t\t\n                   (D)  be absent from an official proceeding to \n\n\n\n \n\t\t\t\nwhich the witness has been legally summoned; or\n\n\n\n \n\t\t\t\n                   (E)  abstain from, discontinue, or delay the \n\n\n\n \n\t\t\t\nprosecution of another;\n\n\n\n \n\t\t\t\n             (4)  presents facts or evidence in the criminal case \n\n\n\n \n\t\t\t\nthat the attorney knows are inadmissible or prohibited by law;\n\n\n\n \n\t\t\t\n             (5)  engages in conduct prohibited under Article \n\n\n\n \n\t\t\t\n35.261, Code of Criminal Procedure; or\n\n\n\n \n\t\t\t\n             (6)  engages in conduct in violation of Article 39.14, \n\n\n\n \n\t\t\t\nCode of Criminal Procedure.\n\n\n\n \n\t\t\t\n       (c)  An offense under Subsection (b)(1) or (2) is a felony of \n\n\n\n \n\t\t\t\nthe third degree, except that if the most serious offense charged in \n\n\n\n \n\t\t\t\nthe criminal case being prosecuted by the attorney representing the \n\n\n\n \n\t\t\t\nstate during the commission of an offense under this section is a \n\n\n\n \n\t\t\t\nhigher category, then the offense under Subsection (b)(1) or (2) is \n\n\n\n \n\t\t\t\nthe same category as the most serious offense charged in that \n\n\n\n \n\t\t\t\ncriminal case.\n\n\n\n \n\t\t\t\n       (d)  An offense under Subsections (b)(3) through (6) is the \n\n\n\n \n\t\t\t\nsame category as the most serious offense charged in the criminal \n\n\n\n \n\t\t\t\ncase being prosecuted by the attorney representing the state during \n\n\n\n \n\t\t\t\nthe commission of an offense under this section.\n\n\n\n \n\t\t\t\n       (e)  Notwithstanding Subsection (c) or (d), if the most \n\n\n\n \n\t\t\t\nserious offense charged in the criminal case being prosecuted by \n\n\n\n \n\t\t\t\nthe attorney representing the state during the commission of an \n\n\n\n \n\t\t\t\noffense under this section is a capital felony, the offense under \n\n\n\n \n\t\t\t\nthis section is a felony of the first degree.\n\n\n\n \n\t\t\t\n       (f)  If conduct that constitutes an offense under this \n\n\n\n \n\t\t\t\nsection also constitutes an offense under any other law, the actor \n\n\n\n \n\t\t\t\nmay be prosecuted only under this section.\n\n\n\n \n\t\t\t\n       SECTION 2.  The change in law made by this Act applies only \n\n\n\n \n\t\t\t\nto an offense committed on or after the effective date of this Act.  \n\n\n\n \n\t\t\t\nAn offense committed before the effective date of this Act is \n\n\n\n \n\t\t\t\ngoverned by the law in effect on the date the offense was committed, \n\n\n\n \n\t\t\t\nand the former law is continued in effect for that purpose.  For \n\n\n\n \n\t\t\t\npurposes of this section, an offense was committed before the \n\n\n\n \n\t\t\t\neffective date of this Act if any element of the offense occurred \n\n\n\n \n\t\t\t\nbefore that date.\n\n\n\n \n\t\t\t\n       SECTION 3.  This Act takes effect September 1, 2023.\n\n\n\n"
    },
    "ocd-bill/7c97e63f-690a-41d1-9f5f-b038fc83e5b0": {
        "id": "ocd-bill/7c97e63f-690a-41d1-9f5f-b038fc83e5b0",
        "state": "Texas",
        "title": "Relating to the designation of portions of the state highway system as memorial highways for certain deceased peace officers.",
        "chamber": "House",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HB03672I.HTM",
        "text": "\n\n\n88(R) HB 3672 - Introduced version - Bill Text\n\n\n\n\n\n \n88R13428 MZM-D\n\n\n \n\n\n \n\n\t\tBy: Canales\nH.B. No. 3672\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA BILL TO BE ENTITLED\n\n\n\n\n \n\t\t\t\n\nAN ACT\n\n\n\n\n \n\t\t\t\nrelating to the designation of portions of the state highway system \n\n\n\n \n\t\t\t\nas memorial highways for certain deceased peace officers.\n\n\n\n \n\t\t\t\n       BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\n       SECTION 1.  Subchapter B, Chapter 225, Transportation Code, \n\n\n\n \n\t\t\t\nis amended by adding Sections 225.217, 225.218, 225.219, 225.220, \n\n\n\n \n\t\t\t\n225.221, and 225.222 to read as follows:\n\n\n\n \n\t\t\t\n       Sec. 225.217.  TROOPER RUSSELL LYNN BOYD MEMORIAL HIGHWAY.  \n\n\n\n \n\t\t\t\n(a)  The portion of State Highway 159 in the municipal limits of \n\n\n\n \n\t\t\t\nHempstead is designated as the Trooper Russell Lynn Boyd Memorial \n\n\n\n \n\t\t\t\nHighway. \n\n\n\n \n\t\t\t\n       (b)  Subject to Section 225.021(c), the department shall:\n\n\n\n \n\t\t\t\n             (1)  design and construct markers indicating the \n\n\n\n \n\t\t\t\ndesignation as the Trooper Russell Lynn Boyd Memorial Highway and \n\n\n\n \n\t\t\t\nany other appropriate information; and\n\n\n\n \n\t\t\t\n             (2)  erect a marker at each end of the highway and at \n\n\n\n \n\t\t\t\nappropriate intermediate sites along the highway.\n\n\n\n \n\t\t\t\n       Sec. 225.218.  RANGER STANLEY K. GUFFEY MEMORIAL HIGHWAY.  \n\n\n\n \n\t\t\t\n(a)  The portion of U.S. Highway 87 in the municipal limits of Brady \n\n\n\n \n\t\t\t\nis designated as the Ranger Stanley K. Guffey Memorial Highway.\n\n\n\n \n\t\t\t\n       (b)  Subject to Section 225.021(c), the department shall:\n\n\n\n \n\t\t\t\n             (1)  design and construct markers indicating the \n\n\n\n \n\t\t\t\ndesignation as the Ranger Stanley K. Guffey Memorial Highway and \n\n\n\n \n\t\t\t\nany other appropriate information; and \n\n\n\n \n\t\t\t\n             (2)  erect a marker at each end of the highway and at \n\n\n\n \n\t\t\t\nappropriate intermediate sites along the highway. \n\n\n\n \n\t\t\t\n       Sec. 225.219.  TROOPER MILTON ALEXANDER MEMORIAL HIGHWAY.  \n\n\n\n \n\t\t\t\n(a)  The portion of Interstate Highway 35 in the municipal limits of \n\n\n\n \n\t\t\t\nHillsboro is designated as the Trooper Milton Alexander Memorial \n\n\n\n \n\t\t\t\nHighway.\n\n\n\n \n\t\t\t\n       (b)  Subject to Section 225.021(c), the department shall:\n\n\n\n \n\t\t\t\n             (1)  design and construct markers indicating the \n\n\n\n \n\t\t\t\ndesignation as the Trooper Milton Alexander Memorial Highway and \n\n\n\n \n\t\t\t\nany other appropriate information; and\n\n\n\n \n\t\t\t\n             (2)  erect a marker at each end of the highway and at \n\n\n\n \n\t\t\t\nappropriate intermediate sites along the highway.\n\n\n\n \n\t\t\t\n       Sec. 225.220.  TROOPER ERNESTO ALANIS MEMORIAL HIGHWAY.  (a)  \n\n\n\n \n\t\t\t\nThe portion of Interstate Highway 2 in the municipal limits of \n\n\n\n \n\t\t\t\nMcAllen is designated as the Trooper Ernesto Alanis Memorial \n\n\n\n \n\t\t\t\nHighway.\n\n\n\n \n\t\t\t\n       (b)  Subject to Section 225.021(c), the department shall:\n\n\n\n \n\t\t\t\n             (1)  design and construct markers indicating the \n\n\n\n \n\t\t\t\ndesignation as the Trooper Ernesto Alanis Memorial Highway and any \n\n\n\n \n\t\t\t\nother appropriate information; and\n\n\n\n \n\t\t\t\n             (2)  erect a marker at each end of the highway and at \n\n\n\n \n\t\t\t\nappropriate intermediate sites along the highway.\n\n\n\n \n\t\t\t\n       Sec. 225.221.  TROOPER HOLLIS S. LACY MEMORIAL HIGHWAY.  (a)  \n\n\n\n \n\t\t\t\nThe portion of U.S. Highway 377 in the municipal limits of Denton is \n\n\n\n \n\t\t\t\ndesignated as the Trooper Hollis S. Lacy Memorial Highway.\n\n\n\n \n\t\t\t\n       (b)  Subject to Section 225.021(c), the department shall:\n\n\n\n \n\t\t\t\n             (1)  design and construct markers indicating the \n\n\n\n \n\t\t\t\ndesignation as the Trooper Hollis S. Lacy Memorial Highway and any \n\n\n\n \n\t\t\t\nother appropriate information; and\n\n\n\n \n\t\t\t\n             (2)  erect a marker at each end of the highway and at \n\n\n\n \n\t\t\t\nappropriate intermediate sites along the highway.\n\n\n\n \n\t\t\t\n       Sec. 225.222.  TROOPER HOWARD JORDAN MEMORIAL HIGHWAY.  (a)  \n\n\n\n \n\t\t\t\nThe portion of U.S. Highway 67 in the municipal limits of Texarkana \n\n\n\n \n\t\t\t\nis designated as the Trooper Howard Jordan Memorial Highway.\n\n\n\n \n\t\t\t\n       (b)  Subject to Section 225.021(c), the department shall:\n\n\n\n \n\t\t\t\n             (1)  design and construct markers indicating the \n\n\n\n \n\t\t\t\ndesignation as the Trooper Howard Jordan Memorial Highway and any \n\n\n\n \n\t\t\t\nother appropriate information; and\n\n\n\n \n\t\t\t\n             (2)  erect a marker at each end of the highway and at \n\n\n\n \n\t\t\t\nappropriate intermediate sites along the highway.\n\n\n\n \n\t\t\t\n       SECTION 2.  This Act takes effect September 1, 2023.\n\n\n\n"
    },
    "ocd-bill/cc1c3668-b058-4d48-8963-f917beac6730": {
        "id": "ocd-bill/cc1c3668-b058-4d48-8963-f917beac6730",
        "state": "Texas",
        "title": "Relating to the amendment of a certificate of convenience and necessity to provide electricity service to certain water control and improvement districts.",
        "chamber": "Senate",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/SB01655I.HTM",
        "text": "\n\n\n88(R) SB 1655 - Introduced version - Bill Text\n\n\n\n\n\n \n\n\n\n \n\n\n \n\n\t\tBy: Hancock\nS.B. No. 1655\n\n\n \n\n\n \n\n\n\n \n\n\n \n \n\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA BILL TO BE ENTITLED\n\n\n\n\n \n\t\t\t\n\nAN ACT\n\n\n\n\n \n\t\t\t\nrelating to the amendment of a certificate of convenience and \n\n\n\n \n\t\t\t\nnecessity to provide electricity service to certain water control \n\n\n\n \n\t\t\t\nand improvement districts.\n\n\n\n \n\t\t\t\n       BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\n       SECTION 1.  It is the intent of the legislature that this Act \n\n\n\n \n\t\t\t\nensure cost-effective and reliable operation in times of emergency \n\n\n\n \n\t\t\t\nof critical water infrastructure operated by a water control and \n\n\n\n \n\t\t\t\nimprovement district.\n\n\n\n \n\t\t\t\n       SECTION 2.  Subchapter B, Chapter 37, Utilities Code, is \n\n\n\n \n\t\t\t\namended by adding Section 37.062 to read as follows:\n\n\n\n \n\t\t\t\n       Sec. 37.062.  AMENDMENT OF CERTIFICATE REQUESTED BY CERTAIN \n\n\n\n \n\t\t\t\nWATER CONTROL AND IMPROVEMENT DISTRICTS.  (a)  In this section:\n\n\n\n \n\t\t\t\n             (1)  \"Consenting entity\" means an electric utility that \n\n\n\n \n\t\t\t\nconsents to provide a water control and improvement district with \n\n\n\n \n\t\t\t\nretail electric service.\n\n\n\n \n\t\t\t\n             (2)  \"District facility\" means an existing or future \n\n\n\n \n\t\t\t\ntransmission-level power-consuming facility that is owned or will \n\n\n\n \n\t\t\t\nbe owned by a water control and improvement district.\n\n\n\n \n\t\t\t\n       (b)  This section applies only to a water control and \n\n\n\n \n\t\t\t\nimprovement district that:\n\n\n\n \n\t\t\t\n             (1)  owns or will own a district facility in an area \n\n\n\n \n\t\t\t\ncertificated by an electric cooperative to provide retail electric \n\n\n\n \n\t\t\t\nservice; and\n\n\n\n \n\t\t\t\n             (2)  has a service area in 10 counties or more.\n\n\n\n \n\t\t\t\n       (c)  Notwithstanding any other provision of this chapter, on \n\n\n\n \n\t\t\t\nthe request of a water control and improvement district in an area \n\n\n\n \n\t\t\t\ncertificated by an electric cooperative whose wholesale power \n\n\n\n \n\t\t\t\npurchase agreement has previously been interrupted by the \n\n\n\n \n\t\t\t\nbankruptcy of its wholesale power supplier, a consenting entity may \n\n\n\n \n\t\t\t\napply to the commission to amend its certificate to allow the \n\n\n\n \n\t\t\t\nconsenting entity to provide retail electric service at \n\n\n\n \n\t\t\t\ntransmission voltage to a district facility if the consenting \n\n\n\n \n\t\t\t\nentity is already certificated on the date the application is filed \n\n\n\n \n\t\t\t\nto provide transmission service to a location that is not more than \n\n\n\n \n\t\t\t\n10 miles from the district facility.\n\n\n\n \n\t\t\t\n       (d)  The commission shall approve an application received \n\n\n\n \n\t\t\t\nunder Subsection (c) not later than the 45th day after the date a \n\n\n\n \n\t\t\t\ncomplete application is filed and amend the consenting entity's \n\n\n\n \n\t\t\t\ncertificate to include the locations of the district facilities \n\n\n\n \n\t\t\t\nidentified in the application, making those facilities multiply \n\n\n\n \n\t\t\t\ncertificated by the consenting entity and the electric cooperative \n\n\n\n \n\t\t\t\nreferenced in Subsection (b)(1).\n\n\n\n \n\t\t\t\n       (e)  The consent of an electric cooperative referenced in \n\n\n\n \n\t\t\t\nSubsection (b)(1) is not required for the commission to approve an \n\n\n\n \n\t\t\t\napplication filed under Subsection (c).\n\n\n\n \n\t\t\t\n       (f)  Section 37.056(c) does not apply to an application filed \n\n\n\n \n\t\t\t\nunder Subsection (c).\n\n\n\n \n\t\t\t\n       (g)  A water control and improvement district that requests \n\n\n\n \n\t\t\t\nretail electric service from a consenting entity who files an \n\n\n\n \n\t\t\t\napplication under this section that is approved by the commission \n\n\n\n \n\t\t\t\nis:\n\n\n\n \n\t\t\t\n             (1)  responsible for paying the construction costs of \n\n\n\n \n\t\t\t\nany new transmission facilities required to interconnect the \n\n\n\n \n\t\t\t\ndistrict facilities identified in the application to the ERCOT \n\n\n\n \n\t\t\t\ntransmission system if those costs are not otherwise recoverable in \n\n\n\n \n\t\t\t\nthe consenting entity's wholesale transmission rates;\n\n\n\n \n\t\t\t\n             (2)  responsible for any nonbypassable charges and \n\n\n\n \n\t\t\t\nother amounts that the district is contractually obligated to pay \n\n\n\n \n\t\t\t\nto the electric cooperative that provided retail electric service \n\n\n\n \n\t\t\t\nto the district on the date the application was filed, if \n\n\n\n \n\t\t\t\napplicable; and\n\n\n\n \n\t\t\t\n             (3)  subject to the relevant provisions of 16 T.A.C. \n\n\n\n \n\t\t\t\nSection 25.27.\n\n\n\n \n\t\t\t\n       (h)  If the commission approves an application under this \n\n\n\n \n\t\t\t\nsection, the commission may not approve another application \n\n\n\n \n\t\t\t\nregarding any district facility included in the approved \n\n\n\n \n\t\t\t\napplication.\n\n\n\n \n\t\t\t\n       SECTION 3.  This Act takes effect September 1, 2023.\n\n\n\n"
    },
    "ocd-bill/7902b517-dc9f-46d3-ae7a-34df282610e8": {
        "id": "ocd-bill/7902b517-dc9f-46d3-ae7a-34df282610e8",
        "state": "Texas",
        "title": "Relating to justice court security.",
        "chamber": "House",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HB03671I.HTM",
        "text": "\n\n\n88(R) HB 3671 - Introduced version - Bill Text\n\n\n\n\n\n \n88R13634 TSS-D\n\n\n \n\n\n \n\n\t\tBy: Jones of Harris\nH.B. No. 3671\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA BILL TO BE ENTITLED\n\n\n\n\n \n\t\t\t\n\nAN ACT\n\n\n\n\n \n\t\t\t\nrelating to justice court security.\n\n\n\n \n\t\t\t\n       BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\n       SECTION 1.  Subchapter A, Chapter 27, Government Code, is \n\n\n\n \n\t\t\t\namended by adding Section 27.007 to read as follows:\n\n\n\n \n\t\t\t\n       Sec. 27.007.  JUSTICE COURT SECURITY.  (a)  The \n\n\n\n \n\t\t\t\ncommissioners court of a county shall provide each justice court \n\n\n\n \n\t\t\t\nwith a walkthrough metal detector and an armed bailiff, deputy \n\n\n\n \n\t\t\t\nsheriff, or contract security guard for each door of the court open \n\n\n\n \n\t\t\t\nto the public. \n\n\n\n \n\t\t\t\n       (b)  A justice of the peace shall require each person who \n\n\n\n \n\t\t\t\nenters the justice court, other than court employees, while the \n\n\n\n \n\t\t\t\ncourt is in session to walk through a metal detector and be subject \n\n\n\n \n\t\t\t\nto further security procedures.\n\n\n\n \n\t\t\t\n       (c)  In complying with this section, the commissioners court \n\n\n\n \n\t\t\t\nshall first use money in the county's courthouse security fund \n\n\n\n \n\t\t\t\nestablished under Article 102.017, Code of Criminal Procedure, and \n\n\n\n \n\t\t\t\nonly if necessary, money from the general revenue fund of the \n\n\n\n \n\t\t\t\ncounty. \n\n\n\n \n\t\t\t\n       SECTION 2.  This Act takes effect September 1, 2023.\n\n\n\n"
    },
    "ocd-bill/22039818-da38-4c30-90bd-369d0887acc3": {
        "id": "ocd-bill/22039818-da38-4c30-90bd-369d0887acc3",
        "state": "Texas",
        "title": "Commemorating the 150th anniversary of Mineola.",
        "chamber": "House",
        "created_date": "2023-03-01",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HC00070I.HTM",
        "text": "\n\n\n88(R) HCR 70 - Introduced version - Bill Text\n\n\n\n\n\n \n88R14692 BK-D\n\n\n \n\n\n \n\n\t\tBy: Hefner\nH.C.R. No. 70\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nCONCURRENT RESOLUTION\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Proud residents of Mineola are celebrating the 150th \n\n\n\n \n\t\t\t\nanniversary of their community's founding in 2023; and\n\n\n\n \n\t\t\t\n       WHEREAS, Mineola was established in 1873 when the \n\n\n\n \n\t\t\t\nInternational-Great Northern Railroad and the Texas and Pacific \n\n\n\n \n\t\t\t\nRailway built lines through the northeastern region of the state; \n\n\n\n \n\t\t\t\nthe town became a vital part of the area's commerce, and trains \n\n\n\n \n\t\t\t\noften stopped for crew and passengers to drink from the \n\n\n\n \n\t\t\t\n\"health-giving\" waters of the community's artesian well; and\n\n\n\n \n\t\t\t\n       WHEREAS, By 1890, the population of Mineola had grown to \n\n\n\n \n\t\t\t\n2,000 people, and the town boasted seven churches and several \n\n\n\n \n\t\t\t\nschools, hotels, and banks; the local economy was supported by the \n\n\n\n \n\t\t\t\ntimber industry, as well as cattle raising and the production of a \n\n\n\n \n\t\t\t\nvariety of agricultural crops; a chair factory was opened in 1886, \n\n\n\n \n\t\t\t\nand the facility later operated as a crate and basket factory until \n\n\n\n \n\t\t\t\n1952; in the 1940s, the discovery of oil in Wood County and the \n\n\n\n \n\t\t\t\nconstruction of a railroad shop further bolstered the town's \n\n\n\n \n\t\t\t\neconomy; and\n\n\n\n \n\t\t\t\n       WHEREAS, Today, Mineola is a designated \"National Main Street \n\n\n\n \n\t\t\t\nCity,\" and its picturesque downtown is a popular destination for \n\n\n\n \n\t\t\t\ntourists; in addition to a variety of local shops and restaurants, \n\n\n\n \n\t\t\t\nresidents and visitors alike enjoy such attractions as the annual \n\n\n\n \n\t\t\t\nIron Horse Heritage Festival, the Mineola Nature Preserve, and the \n\n\n\n \n\t\t\t\nLake Country Playhouse and the Historic Select Theater; and\n\n\n\n \n\t\t\t\n       WHEREAS, Celebrating their rich history as they work to build \n\n\n\n \n\t\t\t\nan even brighter future, the people of Mineola are justifiably \n\n\n\n \n\t\t\t\nproud of their community, and it is indeed a pleasure to honor their \n\n\n\n \n\t\t\t\ncontributions to the story of the Lone Star State on this milestone \n\n\n\n \n\t\t\t\noccasion; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the 88th Legislature of the State of Texas \n\n\n\n \n\t\t\t\nhereby commemorate the 150th anniversary of the city of Mineola and \n\n\n\n \n\t\t\t\nextend to its citizens sincere best wishes for the future.\n\n\n\n"
    },
    "ocd-bill/1a8d3219-204e-4542-b114-6081faab4cb6": {
        "id": "ocd-bill/1a8d3219-204e-4542-b114-6081faab4cb6",
        "state": "Texas",
        "title": "Relating to a study on the establishment of a program administered by the Texas Workforce Commission to train individuals in certain skills related to artificial intelligence systems.",
        "chamber": "House",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HB03633I.HTM",
        "text": "\n\n\n88(R) HB 3633 - Introduced version - Bill Text\n\n\n\n\n\n \n88R14110 RDS-D\n\n\n \n\n\n \n\n\t\tBy: Lalani\nH.B. No. 3633\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA BILL TO BE ENTITLED\n\n\n\n\n \n\t\t\t\n\nAN ACT\n\n\n\n\n \n\t\t\t\nrelating to a study on the establishment of a program administered \n\n\n\n \n\t\t\t\nby the Texas Workforce Commission to train individuals in certain \n\n\n\n \n\t\t\t\nskills related to artificial intelligence systems.\n\n\n\n \n\t\t\t\n       BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\n       SECTION 1.  (a)  The standing committee of the house of \n\n\n\n \n\t\t\t\nrepresentatives having jurisdiction over workforce development \n\n\n\n \n\t\t\t\nshall conduct a study on whether to establish a program \n\n\n\n \n\t\t\t\nadministered by the Texas Workforce Commission to train individuals \n\n\n\n \n\t\t\t\ncurrently in the workforce in skills related to the use, operation, \n\n\n\n \n\t\t\t\nand creation of artificial intelligence systems.\n\n\n\n \n\t\t\t\n       (b)  Not later than December 1, 2024, the committee shall \n\n\n\n \n\t\t\t\nreport the results of the study conducted under Subsection (a) of \n\n\n\n \n\t\t\t\nthis section to the governor, the lieutenant governor, the speaker \n\n\n\n \n\t\t\t\nof the house of representatives, and the standing committee of the \n\n\n\n \n\t\t\t\nsenate with jurisdiction over workforce development.\n\n\n\n \n\t\t\t\n       (c)  This section expires September 1, 2025.\n\n\n\n \n\t\t\t\n       SECTION 2.  This Act takes effect September 1, 2023.\n\n\n\n"
    },
    "ocd-bill/83a47517-5fbc-4ad0-9aa7-7f5afc830ae8": {
        "id": "ocd-bill/83a47517-5fbc-4ad0-9aa7-7f5afc830ae8",
        "state": "Texas",
        "title": "Congratulating East Chambers High School boys' basketball coach Todd Sutherland on recording 900 wins.",
        "chamber": "House",
        "created_date": "2023-02-21",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00283I.HTM",
        "text": "\n\n\n88(R) HR 283 - Introduced version - Bill Text\n\n\n\n\n\n \n88R12951 JRI-D\n\n\n \n\n\n \n\n\t\tBy: Leo-Wilson\nH.R. No. 283\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Todd Sutherland, head coach of the boys' basketball \n\n\n\n \n\t\t\t\nteam at East Chambers High School in Winnie, recorded his 900th \n\n\n\n \n\t\t\t\ncareer win on February 3, 2023; and\n\n\n\n \n\t\t\t\n       WHEREAS, The winningest high school basketball coach in \n\n\n\n \n\t\t\t\nsoutheast Texas, Mr. Sutherland attained the landmark victory in a \n\n\n\n \n\t\t\t\nmatchup against Orangefield High School; the Buccaneers triumphed \n\n\n\n \n\t\t\t\n47-38, lifting their coach to a new level of success; and\n\n\n\n \n\t\t\t\n       WHEREAS, Over the course of his exceptional career, \n\n\n\n \n\t\t\t\nMr. Sutherland has also coached at Hardin-Jefferson, West \n\n\n\n \n\t\t\t\nOrange-Stark, and Kountze High Schools; in addition to taking the \n\n\n\n \n\t\t\t\nBuccaneers to the state tournament in 2016 and 2019, he guided two \n\n\n\n \n\t\t\t\nteams to state championships, having won titles with Kountze in \n\n\n\n \n\t\t\t\n2004 and Hardin-Jefferson in 2007; moreover, he has distinguished \n\n\n\n \n\t\t\t\nhimself as an algebra teacher at East Chambers High; and\n\n\n\n \n\t\t\t\n       WHEREAS, In all his endeavors, Coach Sutherland enjoys the \n\n\n\n \n\t\t\t\nlove and support of his wife, Jenny Ney Sutherland, with whom he has \n\n\n\n \n\t\t\t\nshared a rewarding marriage that has spanned more than four \n\n\n\n \n\t\t\t\ndecades; he takes tremendous pride in his children, Whitney Harris, \n\n\n\n \n\t\t\t\nTaylor Sutherland, and Grayson Sutherland; and\n\n\n\n \n\t\t\t\n       WHEREAS, In reaching the 900-win plateau, Todd Sutherland has \n\n\n\n \n\t\t\t\nearned a special place in the pantheon of Lone Star State basketball \n\n\n\n \n\t\t\t\ncoaches, and this rare feat is indeed deserving of commendation; \n\n\n\n \n\t\t\t\nnow, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby congratulate Todd Sutherland on his 900th career \n\n\n\n \n\t\t\t\nvictory and extend to him sincere best wishes for the future; and, \n\n\n\n \n\t\t\t\nbe it further\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for Coach Sutherland as an expression of high regard by the \n\n\n\n \n\t\t\t\nTexas House of Representatives.\n\n\n\n"
    },
    "ocd-bill/712e014f-56e6-4969-a3cf-090a4eb3dc24": {
        "id": "ocd-bill/712e014f-56e6-4969-a3cf-090a4eb3dc24",
        "state": "Texas",
        "title": "Relating to a prohibition against affirmative action in governmental employment and in higher education admissions.",
        "chamber": "House",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HB03682I.HTM",
        "text": "\n\n\n88(R) HB 3682 - Introduced version - Bill Text\n\n\n\n\n\n \n88R12321 CXP-D\n\n\n \n\n\n \n\n\t\tBy: Tepper\nH.B. No. 3682\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA BILL TO BE ENTITLED\n\n\n\n\n \n\t\t\t\n\nAN ACT\n\n\n\n\n \n\t\t\t\nrelating to a prohibition against affirmative action in \n\n\n\n \n\t\t\t\ngovernmental employment and in higher education admissions.\n\n\n\n \n\t\t\t\n       BE IT ENACTED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\nARTICLE 1.  PROHIBITION AGAINST AFFIRMATIVE ACTION IN GOVERNMENTAL \n\n\n\n \n\t\t\t\nEMPLOYMENT AND IN HIGHER EDUCATION ADMISSIONS\n\n\n\n \n\t\t\t\n       SECTION 1.01.  Section 51.805, Education Code, is amended by \n\n\n\n \n\t\t\t\nadding Subsection (b-1) to read as follows:\n\n\n\n \n\t\t\t\n       (b-1)  A general academic teaching institution may not \n\n\n\n \n\t\t\t\nconsider an applicant's race, color, or any other protected \n\n\n\n \n\t\t\t\ncharacteristic under applicable state or federal law as a factor in \n\n\n\n \n\t\t\t\nmaking admissions decisions.  An applicant may seek any appropriate \n\n\n\n \n\t\t\t\nremedy available under state or federal law for a violation of this \n\n\n\n \n\t\t\t\nsubsection.  To the extent of any conflict, this subsection \n\n\n\n \n\t\t\t\nprevails over any other law relating to admissions decisions made \n\n\n\n \n\t\t\t\nby a general academic teaching institution.  Nothing in this \n\n\n\n \n\t\t\t\nsubsection may be construed to impair the enforcement of any \n\n\n\n \n\t\t\t\napplicable state or federal civil rights law.\n\n\n\n \n\t\t\t\n       SECTION 1.02.  Section 51.808, Education Code, is amended by \n\n\n\n \n\t\t\t\nadding Subsection (b-1) to read as follows:\n\n\n\n \n\t\t\t\n       (b-1)  A general academic teaching institution or medical \n\n\n\n \n\t\t\t\nand dental unit may not adopt a policy under this section under \n\n\n\n \n\t\t\t\nwhich the institution may consider an applicant's race, color, or \n\n\n\n \n\t\t\t\nany other protected characteristic under applicable state or \n\n\n\n \n\t\t\t\nfederal law as a factor in making admissions decisions.  An \n\n\n\n \n\t\t\t\napplicant may seek any appropriate remedy available under state or \n\n\n\n \n\t\t\t\nfederal law for a violation of this subsection.  To the extent of \n\n\n\n \n\t\t\t\nany conflict, this subsection prevails over any other law relating \n\n\n\n \n\t\t\t\nto admissions decisions made by a general academic teaching \n\n\n\n \n\t\t\t\ninstitution or medical and dental unit.  Nothing in this subsection \n\n\n\n \n\t\t\t\nmay be construed to impair the enforcement of any applicable state \n\n\n\n \n\t\t\t\nor federal civil rights law.\n\n\n\n \n\t\t\t\n       SECTION 1.03.  Chapter 1, Government Code, is amended by \n\n\n\n \n\t\t\t\nadding Section 1.004 to read as follows:\n\n\n\n \n\t\t\t\n       Sec. 1.004.  PROHIBITION AGAINST AFFIRMATIVE ACTION IN \n\n\n\n \n\t\t\t\nGOVERNMENTAL EMPLOYMENT.  (a)  In this section:\n\n\n\n \n\t\t\t\n             (1)  \"Employment decision\" includes a decision \n\n\n\n \n\t\t\t\nregarding a person's hiring, termination, promotion, demotion, \n\n\n\n \n\t\t\t\ntransfer, conditions of employment, or wages.\n\n\n\n \n\t\t\t\n             (2)  \"Government agency\" has the meaning assigned by \n\n\n\n \n\t\t\t\nSection 110.001, Civil Practice and Remedies Code.\n\n\n\n \n\t\t\t\n       (b)  Notwithstanding any other law, a government agency may \n\n\n\n \n\t\t\t\nnot consider the race, color, or any other protected characteristic \n\n\n\n \n\t\t\t\nunder applicable state or federal law of a person as a factor in \n\n\n\n \n\t\t\t\nmaking an employment decision regarding the person.\n\n\n\n \n\t\t\t\n       (c)  A person may seek any appropriate remedy available under \n\n\n\n \n\t\t\t\nstate or federal law for a violation of this section.\n\n\n\n \n\t\t\t\n       (d)  To the extent of any conflict, this section prevails \n\n\n\n \n\t\t\t\nover any other law relating to an employment decision made by a \n\n\n\n \n\t\t\t\ngovernment agency.\n\n\n\n \n\t\t\t\n       (e)  Nothing in this section may be construed to impair the \n\n\n\n \n\t\t\t\napplication or enforcement of any applicable state or federal civil \n\n\n\n \n\t\t\t\nrights law.\n\n\n\n \n\t\t\t\nARTICLE 2. CONFORMING AMENDMENTS\n\n\n\n \n\t\t\t\n       SECTION 2.01.  Section 901.659, Occupations Code, is amended \n\n\n\n \n\t\t\t\nto read as follows:\n\n\n\n \n\t\t\t\n       Sec. 901.659.  [MINORITY AND] DISADVANTAGED STUDENT \n\n\n\n \n\t\t\t\nINTERNSHIPS. (a)  The board shall adopt rules to encourage \n\n\n\n \n\t\t\t\ninternships for [minority and] disadvantaged students and \n\n\n\n \n\t\t\t\ncertified public accountant examination candidates who notify the \n\n\n\n \n\t\t\t\nboard not later than 90 days after the date of being accepted into \n\n\n\n \n\t\t\t\nan accounting internship program.\n\n\n\n \n\t\t\t\n       (b)  The rules adopted by the board shall include standards \n\n\n\n \n\t\t\t\nfor appropriate recognition of an accounting firm for its efforts \n\n\n\n \n\t\t\t\nin training and hiring [minority or] disadvantaged students.\n\n\n\n \n\t\t\t\n       SECTION 2.02.  Section 51.803(k), Education Code, is \n\n\n\n \n\t\t\t\nrepealed.\n\n\n\n \n\t\t\t\nARTICLE 3.  TRANSITION AND EFFECTIVE DATE\n\n\n\n \n\t\t\t\n       SECTION 3.01.  The change in law made by this Act to \n\n\n\n \n\t\t\t\nSubchapter U, Chapter 51, Education Code, applies beginning with \n\n\n\n \n\t\t\t\nadmissions to a general academic teaching institution for the \n\n\n\n \n\t\t\t\n2024-2025 academic year.  Admissions for an academic period \n\n\n\n \n\t\t\t\npreceding that academic year are covered by the law in effect \n\n\n\n \n\t\t\t\nimmediately before the effective date of this Act, and the prior law \n\n\n\n \n\t\t\t\nis continued in effect for that purpose.\n\n\n\n \n\t\t\t\n       SECTION 3.02.  This Act takes effect September 1, 2023.\n\n\n\n"
    },
    "ocd-bill/637df700-87d8-40ca-b02c-5babe7954c80": {
        "id": "ocd-bill/637df700-87d8-40ca-b02c-5babe7954c80",
        "state": "Texas",
        "title": "Congratulating Rosa Navejar on her election as board chair of the Fort Worth Chamber of Commerce.",
        "chamber": "House",
        "created_date": "2023-01-30",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00120I.HTM",
        "text": "\n\n\n88(R) HR 120 - Introduced version - Bill Text\n\n\n\n\n\n \n88R10441 BHH-D\n\n\n \n\n\n \n\n\t\tBy: Romero, Jr.\nH.R. No. 120\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Rosa Navejar has been elected as board chair of the \n\n\n\n \n\t\t\t\nFort Worth Chamber of Commerce, becoming the first Latina to hold \n\n\n\n \n\t\t\t\nthat position in the chamber's 140-year history; and\n\n\n\n \n\t\t\t\n       WHEREAS, Ms. Navejar is president of The Rios Group, Inc., \n\n\n\n \n\t\t\t\nwhich she established in 2012; she previously spent 25 years in the \n\n\n\n \n\t\t\t\nbanking industry, followed by more than a decade as president of the \n\n\n\n \n\t\t\t\nFort Worth Hispanic Chamber of Commerce; and\n\n\n\n \n\t\t\t\n       WHEREAS, Deeply dedicated to her community, Ms. Navejar has \n\n\n\n \n\t\t\t\nserved on numerous boards and committees, including the Fort Worth \n\n\n\n \n\t\t\t\nExecutive Roundtable and the Safe City Commission, as well as the \n\n\n\n \n\t\t\t\nCity of Fort Worth Task Force on Race and Culture and Transportation \n\n\n\n \n\t\t\t\nand Infrastructure Committee; moreover, she was appointed by U.S. \n\n\n\n \n\t\t\t\nSecretary of Transportation Ray LaHood to the National Freight \n\n\n\n \n\t\t\t\nAdvisory Committee, and she was vice chair of Trinity Metro; her \n\n\n\n \n\t\t\t\naccolades include the John V. McMillan Hall of Fame Award from the \n\n\n\n \n\t\t\t\nFort Worth Hispanic Chamber of Commerce, the Women's Transportation \n\n\n\n \n\t\t\t\nSeminar Rosa Parks Diversity Leadership Award, and the Fort Worth \n\n\n\n \n\t\t\t\nBusiness Press Minority Leader in Business award, and in 2016, she \n\n\n\n \n\t\t\t\nwas inducted into the Fort Worth Business Press Entrepreneur Hall \n\n\n\n \n\t\t\t\nof Fame; and\n\n\n\n \n\t\t\t\n       WHEREAS, With her outstanding leadership, professionalism, \n\n\n\n \n\t\t\t\nand commitment to excellence, Rosa Navejar has earned the lasting \n\n\n\n \n\t\t\t\nrespect and admiration of her colleagues and fellow citizens, and \n\n\n\n \n\t\t\t\nher experience and expertise are sure to serve her well as she takes \n\n\n\n \n\t\t\t\non this exciting new role; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby congratulate Rosa Navejar on her election as \n\n\n\n \n\t\t\t\nboard chair of the Fort Worth Chamber of Commerce and that she be \n\n\n\n \n\t\t\t\nextended sincere best wishes for a productive tenure; and, be it \n\n\n\n \n\t\t\t\nfurther\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for Ms. Navejar as an expression of high regard by the \n\n\n\n \n\t\t\t\nTexas House of Representatives.\n\n\n\n"
    },
    "ocd-bill/b571e4dc-ac8e-4693-8e71-fcc71608828b": {
        "id": "ocd-bill/b571e4dc-ac8e-4693-8e71-fcc71608828b",
        "state": "Texas",
        "title": "Commemorating the 175th anniversary of Starr County.",
        "chamber": "House",
        "created_date": "2023-02-09",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00203I.HTM",
        "text": "\n\n\n88(R) HR 203 - Introduced version - Bill Text\n\n\n\n\n\n \n88R11066 JRI-D\n\n\n \n\n\n \n\n\t\tBy: Guillen\nH.R. No. 203\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, February 10, 2023, marks the 175th anniversary of \n\n\n\n \n\t\t\t\nthe founding of Starr County; and\n\n\n\n \n\t\t\t\n       WHEREAS, Located in South Texas along the Rio Grande and the \n\n\n\n \n\t\t\t\nU.S. border with Mexico, Starr County was visited by Spanish \n\n\n\n \n\t\t\t\nexplorers in the 17th century, but it was not until 1749 that the \n\n\n\n \n\t\t\t\nSpanish crown issued land grants to settle the region; in 1763, the \n\n\n\n \n\t\t\t\nfirst settlement was made by Francisco de la Garza Martinéz, who \n\n\n\n \n\t\t\t\nfounded Rancho Carnestolendas; another early settlement was \n\n\n\n \n\t\t\t\nestablished later that year by the Saenz family; by 1850, Los Saenz \n\n\n\n \n\t\t\t\nhad been renamed Roma-Los Saenz and was a thriving community with an \n\n\n\n \n\t\t\t\neconomy based on cattle and sheep ranching; and\n\n\n\n \n\t\t\t\n       WHEREAS, For a time following the Texas Revolution, both \n\n\n\n \n\t\t\t\nMexico and the Republic of Texas laid claim to the area, which \n\n\n\n \n\t\t\t\nbecame part of Nueces County after the Treaty of Guadalupe Hidalgo \n\n\n\n \n\t\t\t\nended the Mexican War in 1848; that year, the county was organized \n\n\n\n \n\t\t\t\nand named for James Harper Starr; and\n\n\n\n \n\t\t\t\n       WHEREAS, Rio Grande City, the county seat, is located in the \n\n\n\n \n\t\t\t\nheart of Los Caminos del Rio Heritage Corridor, which contains \n\n\n\n \n\t\t\t\nnumerous architectural and historical treasures from the 18th and \n\n\n\n \n\t\t\t\n19th centuries; Roma, the second largest city in the county, is one \n\n\n\n \n\t\t\t\nof the best remaining Spanish colonial townsites in the lower Rio \n\n\n\n \n\t\t\t\nGrande Valley; the city was designated as a national historic \n\n\n\n \n\t\t\t\ndistrict and was used in the filming of Viva Zapata, starring Marlon \n\n\n\n \n\t\t\t\nBrando; other notable towns include Escobares and La Grulla; and\n\n\n\n \n\t\t\t\n       WHEREAS, Residents and visitors alike benefit from the \n\n\n\n \n\t\t\t\nrecreational opportunities afforded by Las Palomas State Wildlife \n\n\n\n \n\t\t\t\nManagement Area and Falcon International Reservoir as well as \n\n\n\n \n\t\t\t\nyear-round hunting; in addition, the county hosts a number of \n\n\n\n \n\t\t\t\nannual events, including the Starr County Fair and the Fourth of \n\n\n\n \n\t\t\t\nJuly Parade and Festival, held in Rio Grande City; and\n\n\n\n \n\t\t\t\n       WHEREAS, The people of Starr County share a rich and colorful \n\n\n\n \n\t\t\t\nheritage, and they may indeed take great pride in their home as they \n\n\n\n \n\t\t\t\ncelebrate this milestone anniversary; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby commemorate the 175th anniversary of Starr \n\n\n\n \n\t\t\t\nCounty and extend to its citizens sincere best wishes for the \n\n\n\n \n\t\t\t\nfuture.\n\n\n\n"
    },
    "ocd-bill/bc1c376d-7274-48a9-bc29-39c57c8b2141": {
        "id": "ocd-bill/bc1c376d-7274-48a9-bc29-39c57c8b2141",
        "state": "Texas",
        "title": "Congratulating Hector Gutierrez Jr. on his receipt of a 2023 Distinguished Alumnus Award from Texas A&M University.",
        "chamber": "Senate",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/SR00285I.HTM",
        "text": "\n\n\n88(R) SR 285 - Introduced version - Bill Text\n\n\n\n\n\n \n88R15899 CW-D\n\n\n \n\n\n \n\n\t\tBy: Blanco\nS.R. No. 285\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, Hector Gutierrez Jr. is the recipient of a 2023 \n\n\n\n \n\t\t\t\nDistinguished Alumnus Award from Texas A&M University; and\n\n\n\n \n\t\t\t\n       WHEREAS, The highest honor bestowed upon former students of \n\n\n\n \n\t\t\t\nTexas A&M, the Distinguished Alumnus Award has been presented to \n\n\n\n \n\t\t\t\nonly 328 of the university's more than 574,000 alumni since 1962; \n\n\n\n \n\t\t\t\nthe accolade is given jointly by Texas A&M and The Association of \n\n\n\n \n\t\t\t\nFormer Students to recognize Aggies who have achieved excellence in \n\n\n\n \n\t\t\t\ntheir chosen professions and who have made meaningful contributions \n\n\n\n \n\t\t\t\nto the school and their local communities; and\n\n\n\n \n\t\t\t\n       WHEREAS, A member of the Class of 1969, Hector Gutierrez \n\n\n\n \n\t\t\t\ngraduated with a mathematics degree; he was commander of the Texas \n\n\n\n \n\t\t\t\nA&M University Corps of Cadets and belonged to Squadron 9 and the \n\n\n\n \n\t\t\t\nRoss Volunteers; additionally, he was president of the Honor \n\n\n\n \n\t\t\t\nCouncil and a member of Town Hall and the Student Conference on \n\n\n\n \n\t\t\t\nNational Affairs; and\n\n\n\n \n\t\t\t\n       WHEREAS, Mr. Gutierrez has given back to his alma mater in \n\n\n\n \n\t\t\t\nmany ways, including by holding a seat on the boards of directors \n\n\n\n \n\t\t\t\nfor both Texas A&M University Press and The Association of Former \n\n\n\n \n\t\t\t\nStudents; furthermore, he served on the Corps of Cadets Development \n\n\n\n \n\t\t\t\nCouncil and the Development Foundation Board of the Texas A&M \n\n\n\n \n\t\t\t\nHealth Science Center; through his efforts as founding chair of the \n\n\n\n \n\t\t\t\nTexas A&M Hispanic Network, he helped make possible the \n\n\n\n \n\t\t\t\nuniversity's designation as a Hispanic Serving Institution; and\n\n\n\n \n\t\t\t\n       WHEREAS, This esteemed Texan served 5 years in the U.S. Air \n\n\n\n \n\t\t\t\nForce and 16 years in the Air Force Reserve, rising to the rank of \n\n\n\n \n\t\t\t\nlieutenant colonel; over the course of his 34-year civilian career, \n\n\n\n \n\t\t\t\nhe worked for El Paso Electric and HillCo Partners, and he served as \n\n\n\n \n\t\t\t\na public affairs consultant for the City of El Paso, the El Paso \n\n\n\n \n\t\t\t\nWater Public Service Board, AT&T, Motorola, and the American Heart \n\n\n\n \n\t\t\t\nAssociation; moreover, he owned Hector Gutierrez Consulting, a \n\n\n\n \n\t\t\t\npublic relations and communications firm; and\n\n\n\n \n\t\t\t\n       WHEREAS, Hector Gutierrez has distinguished himself through \n\n\n\n \n\t\t\t\nhis professional and civic endeavors, and he is indeed deserving of \n\n\n\n \n\t\t\t\nrecognition for his exemplary record of achievement and for the \n\n\n\n \n\t\t\t\npositive impact he has had on the Texas A&M community; now, \n\n\n\n \n\t\t\t\ntherefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the Senate of the 88th Texas Legislature \n\n\n\n \n\t\t\t\nhereby congratulate Hector Gutierrez Jr. on receiving a 2023 \n\n\n\n \n\t\t\t\nDistinguished Alumnus Award from Texas A&M University and extend to \n\n\n\n \n\t\t\t\nhim sincere best wishes for the future; and, be it further\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for Hector Gutierrez as an expression of high regard by the \n\n\n\n \n\t\t\t\nTexas Senate.\n\n\n\n"
    },
    "ocd-bill/c0479849-c8d6-4dc5-a2cf-c6a560e89ee2": {
        "id": "ocd-bill/c0479849-c8d6-4dc5-a2cf-c6a560e89ee2",
        "state": "Texas",
        "title": "Proposing a constitutional amendment to repeal the constitutional provision that prohibits the appropriation of state money or property for the benefit of any sect, religious society, or theological or religious seminary.",
        "chamber": "Senate",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/SJ00076I.HTM",
        "text": "\n\n\n88(R) SJR 76 - Introduced version - Bill Text\n\n\n\n\n\n \n88R12255 KBB-D\n\n\n \n\n\n \n\n\t\tBy: Paxton\nS.J.R. No. 76\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nA JOINT RESOLUTION\n\n\n\n\n \n\t\t\t\nproposing a constitutional amendment to repeal the constitutional \n\n\n\n \n\t\t\t\nprovision that prohibits the appropriation of state money or \n\n\n\n \n\t\t\t\nproperty for the benefit of any sect, religious society, or \n\n\n\n \n\t\t\t\ntheological or religious seminary.\n\n\n\n \n\t\t\t\n       BE IT RESOLVED BY THE LEGISLATURE OF THE STATE OF TEXAS:\n\n\n\n \n\t\t\t\n       SECTION 1.  Section 7, Article I, Texas Constitution, is \n\n\n\n \n\t\t\t\nrepealed.\n\n\n\n \n\t\t\t\n       SECTION 2.  This proposed constitutional amendment shall be \n\n\n\n \n\t\t\t\nsubmitted to the voters at an election to be held November 7, 2023.  \n\n\n\n \n\t\t\t\nThe ballot shall be printed to permit voting for or against the \n\n\n\n \n\t\t\t\nproposition:  \"The constitutional amendment repealing the \n\n\n\n \n\t\t\t\nconstitutional provision that prohibits the appropriation of state \n\n\n\n \n\t\t\t\nmoney or property for the benefit of any sect, religious society, or \n\n\n\n \n\t\t\t\ntheological or religious seminary.\"\n\n\n\n"
    },
    "ocd-bill/d1e41cad-eb4f-4972-81a6-a90fb023d48d": {
        "id": "ocd-bill/d1e41cad-eb4f-4972-81a6-a90fb023d48d",
        "state": "Texas",
        "title": "In memory of U.S. Army Lieutenant Colonel (Ret.) Richard Grimes Castle of Salado.",
        "chamber": "House",
        "created_date": "2023-02-14",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00229I.HTM",
        "text": "\n\n\n88(R) HR 229 - Introduced version - Bill Text\n\n\n\n\n\n \n88R8479 CW-D\n\n\n \n\n\n \n\n\t\tBy: Buckley\nH.R. No. 229\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, A life made rich through meaningful service drew to \n\n\n\n \n\t\t\t\na close with the passing of U.S. Army Lieutenant Colonel (Ret.) \n\n\n\n \n\t\t\t\nRichard Grimes Castle of Salado on December 1, 2022, at the age of \n\n\n\n \n\t\t\t\n75; and\n\n\n\n \n\t\t\t\n       WHEREAS, The son of Alfred and Adele Castle, Rich Castle was \n\n\n\n \n\t\t\t\nborn in Rochester, New York, on December 21, 1946, and he grew up \n\n\n\n \n\t\t\t\nwith two siblings, Edward and Charles; in 1958, he moved with his \n\n\n\n \n\t\t\t\nfamily to Dayton, Ohio; he graduated from Oakwood High School and \n\n\n\n \n\t\t\t\nreceived a business degree from Ohio University in 1968; and\n\n\n\n \n\t\t\t\n       WHEREAS, Answering his nation's call to duty, Mr. Castle \n\n\n\n \n\t\t\t\ncompleted U.S. Army basic training in 1969 and Officer Candidate \n\n\n\n \n\t\t\t\nSchool at Fort Benning, Georgia, where he was commissioned as a \n\n\n\n \n\t\t\t\nsecond lieutenant the following year; he subsequently transferred \n\n\n\n \n\t\t\t\nto Fort Ord, California, and became a training officer, and in 1971 \n\n\n\n \n\t\t\t\nand 1972, he served overseas with Military Assistance Command Teams \n\n\n\n \n\t\t\t\nVietnam; next assigned to Fort Hood in Killeen, he rose to the rank \n\n\n\n \n\t\t\t\nof captain, and he was later sent to Hawaii, where he became a major \n\n\n\n \n\t\t\t\nand battalion executive officer; he next attended Command and \n\n\n\n \n\t\t\t\nGeneral Staff College before returning to Fort Hood; and\n\n\n\n \n\t\t\t\n       WHEREAS, While assigned to the 13th Corps Support Command at \n\n\n\n \n\t\t\t\nFort Hood, Mr. Castle met his future wife, Captain Deborah \"Borah\" \n\n\n\n \n\t\t\t\nVan Dormolen; they exchanged wedding vows on December 18, 1987, and \n\n\n\n \n\t\t\t\nshared more than a quarter century together before Mrs. Castle's \n\n\n\n \n\t\t\t\ndeath in 2013; the couple moved to Germany, where Mr. Castle was \n\n\n\n \n\t\t\t\npromoted to lieutenant colonel, and he retired at Fort Hood in 1991; \n\n\n\n \n\t\t\t\nhis military awards included the Bronze Star Medal, the Army \n\n\n\n \n\t\t\t\nAchievement Medal, the National Defense Service Medal, and the \n\n\n\n \n\t\t\t\nRepublic of Vietnam Gallantry Cross with Palm Ribbon; and\n\n\n\n \n\t\t\t\n       WHEREAS, After settling in Salado, Mr. Castle went on to \n\n\n\n \n\t\t\t\ncofound the ElectriChef grill company; he and his wife traveled to \n\n\n\n \n\t\t\t\nAlaska, Canada, and Scotland to pursue their love of fly-fishing, \n\n\n\n \n\t\t\t\nand they also made happy memories on a cruise to Australia; \n\n\n\n \n\t\t\t\nMr. Castle's other interests included cooking and cheering on the \n\n\n\n \n\t\t\t\nCleveland Browns and Ohio State football teams; known for his \n\n\n\n \n\t\t\t\ngenerosity, he assisted others with their college loan debt and \n\n\n\n \n\t\t\t\nhousing needs, and he supported a number of charitable entities; \n\n\n\n \n\t\t\t\nand\n\n\n\n \n\t\t\t\n       WHEREAS, Rich Castle earned the lasting respect and \n\n\n\n \n\t\t\t\nadmiration of all who were privileged to know him, and he leaves \n\n\n\n \n\t\t\t\nbehind a legacy that his loved ones can remember with pride; now, \n\n\n\n \n\t\t\t\ntherefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby pay tribute to the memory of U.S. Army \n\n\n\n \n\t\t\t\nLieutenant Colonel (Ret.) Richard Grimes Castle and extend \n\n\n\n \n\t\t\t\nheartfelt condolences to his relatives and friends; and, be it \n\n\n\n \n\t\t\t\nfurther\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for his family and that when the Texas House of \n\n\n\n \n\t\t\t\nRepresentatives adjourns this day, it do so in memory of Rich \n\n\n\n \n\t\t\t\nCastle.\n\n\n\n"
    },
    "ocd-bill/8690d6f5-34a6-46d6-84d8-77b68e479f0c": {
        "id": "ocd-bill/8690d6f5-34a6-46d6-84d8-77b68e479f0c",
        "state": "Texas",
        "title": "Commending Haydee Torres for her service as Kimble County district clerk.",
        "chamber": "House",
        "created_date": "2023-02-28",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/HR00392I.HTM",
        "text": "\n\n\n88(R) HR 392 - Introduced version - Bill Text\n\n\n\n\n\n \n88R10614(1) TBO-D\n\n\n \n\n\n \n\n\t\tBy: Murr\nH.R. No. 392\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nR E S O L U T I O N\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, The service of an admired Kimble County official \n\n\n\n \n\t\t\t\ndrew to a close when Haydee Torres retired as district clerk in \n\n\n\n \n\t\t\t\nDecember 2022; and\n\n\n\n \n\t\t\t\n       WHEREAS, Ms. Torres served as deputy clerk from 1993 to 2003, \n\n\n\n \n\t\t\t\nand she subsequently worked as district clerk until her retirement; \n\n\n\n \n\t\t\t\nover the course of her tenure, she served her fellow citizens with \n\n\n\n \n\t\t\t\ndistinction, ably meeting the myriad responsibilities of her \n\n\n\n \n\t\t\t\noffice; and\n\n\n\n \n\t\t\t\n       WHEREAS, Through her dedicated leadership and commitment to \n\n\n\n \n\t\t\t\ngood governance, Haydee Torres has helped make Kimble County an \n\n\n\n \n\t\t\t\neven better place in which to live and work, and she has set a \n\n\n\n \n\t\t\t\nstandard of excellence to which others may aspire; now, therefore, \n\n\n\n \n\t\t\t\nbe it\n\n\n\n \n\t\t\t\n       RESOLVED, That the House of Representatives of the 88th Texas \n\n\n\n \n\t\t\t\nLegislature hereby commend Haydee Torres for her service as Kimble \n\n\n\n \n\t\t\t\nCounty district clerk and extend to her sincere best wishes for the \n\n\n\n \n\t\t\t\nfuture; and, be it further\n\n\n\n \n\t\t\t\n       RESOLVED, That an official copy of this resolution be \n\n\n\n \n\t\t\t\nprepared for Ms. Torres as an expression of high regard by the Texas \n\n\n\n \n\t\t\t\nHouse of Representatives.\n\n\n\n"
    },
    "ocd-bill/25181586-8058-49f2-a1f3-9ce9f367574c": {
        "id": "ocd-bill/25181586-8058-49f2-a1f3-9ce9f367574c",
        "state": "Texas",
        "title": "Authorizing the State Preservation Board to approve the construction of a replica of the National Life Monument at the State Capitol Complex.",
        "chamber": "Senate",
        "created_date": "2023-03-06",
        "link": "http://capitol.texas.gov/tlodocs/88R/billtext/html/SC00024I.HTM",
        "text": "\n\n\n88(R) SCR 24 - Introduced version - Bill Text\n\n\n\n\n\n \n88R11567 AMB-D\n\n\n \n\n\n \n\n\t\tBy: Parker\nS.C.R. No. 24\n\n\n\n\n \n\n\n \n\n\n\n \t\t\n\t\t\t\n\nCONCURRENT RESOLUTION\n\n\n\n\n \t\t\n\t\t\t\n       WHEREAS, The National Life Monument celebrates the miracle of \n\n\n\n \n\t\t\t\nlife and the women at the center of that miracle; and\n\n\n\n \n\t\t\t\n       WHEREAS, Sculpted by artist Timothy Schmalz, the bronze \n\n\n\n \n\t\t\t\nsculpture depicts a mother with an unborn child cradled in a \n\n\n\n \n\t\t\t\nworld-shaped womb; and\n\n\n\n \n\t\t\t\n       WHEREAS, The eight-foot bronze statue was permanently \n\n\n\n \n\t\t\t\ninstalled at the Church of San Marcello al Corso in Rome in May \n\n\n\n \n\t\t\t\n2022, and after a tour of the U.S., the original Life Monument was \n\n\n\n \n\t\t\t\ninstalled at the Theological College in Washington, D.C.; and\n\n\n\n \n\t\t\t\n       WHEREAS, Under Chapter 443, Government Code, and rules of the \n\n\n\n \n\t\t\t\nState Preservation Board, a portion of the north Capitol grounds is \n\n\n\n \n\t\t\t\navailable for new monuments, subject to legislative approval, \n\n\n\n \n\t\t\t\nspecified procedural requirements, the provision of funding from \n\n\n\n \n\t\t\t\nprivate donors, conformity to certain size and design limitations \n\n\n\n \n\t\t\t\nand parameters, and completion on a timely basis; and\n\n\n\n \n\t\t\t\n       WHEREAS, A replica of the monument on the Capitol grounds \n\n\n\n \n\t\t\t\nwould provide a communal place for Texans to celebrate the beauty of \n\n\n\n \n\t\t\t\nhuman life; now, therefore, be it\n\n\n\n \n\t\t\t\n       RESOLVED, That the 88th Legislature of the State of Texas \n\n\n\n \n\t\t\t\nhereby authorize the State Preservation Board, subject to state law \n\n\n\n \n\t\t\t\nand rules of the board, to approve the construction of a replica of \n\n\n\n \n\t\t\t\nthe National Life Monument at the State Capitol Complex, at a site \n\n\n\n \n\t\t\t\noutside of the historic Capitol grounds; and, be it further\n\n\n\n \n\t\t\t\n       RESOLVED, That the Texas secretary of state forward an \n\n\n\n \n\t\t\t\nofficial copy of this resolution to the executive director of the \n\n\n\n \n\t\t\t\nState Preservation Board.\n\n\n\n"
    }
}