{
    "ocd-bill/aa0733bc-8ba2-45a8-bb50-13869cebdb75": {
        "id": "ocd-bill/aa0733bc-8ba2-45a8-bb50-13869cebdb75",
        "state": "Illinois",
        "title": "FIREFIGHTERS TASK FORCE",
        "chamber": "Senate",
        "created_date": "2023-02-01",
        "link": "https://ilga.gov/legislation/103/SJR/PDF/10300SJ0007.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SJR0007\n\n\n\n\nSJ0007 103RD GENERAL ASSEMBLY  \r\n\r\n  SJ0007LRB103 00144 MST 45149 r\r\n  1SENATE JOINT RESOLUTION\r\n   \r\n\r\n\r\n\r\n\r\n\r\n  2    RESOLVED, BY THE SENATE OF THE ONE HUNDRED THIRD GENERAL 3ASSEMBLY OF THE STATE OF ILLINOIS, THE HOUSE OF 4REPRESENTATIVES CONCURRING HEREIN, that the Recruiting & 5Retaining Public Employee Firefighters and Paramedics Task 6Force is created to identify solutions to the shortage of 7eligible applicants for the position of firefighter and/or 8paramedic and is charged with examining the following:9        (1) The barriers to the recruitment and retention of 10    public employee firefighters and paramedics;11        (2) The steps that the State of Illinois can take to 12    assist local governments to recruit and retain public 13    employee firefighters and paramedics;14        (3) What community colleges, the Illinois Fire Service 15    Institute, the Illinois Department of Public Health, and 16    the Office of the State Fire Marshal can do to assist local 17    governments to recruit and retain public employee 18    firefighters and paramedics;19        (4) How Monetary Award Program (MAP) grants can be 20    utilized to recruit and retain public employee 21    firefighters and paramedics;22        (5) How paramedic licensure and testing/certification 23    requirements affect the recruitment and retainment of  24    public employee firefighters and paramedics;25        (6) The statewide hiring provisions currently in   SJ0007- 2 -LRB103 00144 MST 45149 r1    statute as an alternative method of selecting and hiring 2    firefighters;3        (7) How apprenticeship Programs (local, regional, 4    statewide) can be utilized to recruit and retain public 5    employee firefighters and paramedics;6        (8) How the minimum requirements to apply to an 7    Illinois local government fire department affect the 8    recruitment and retention of public employee firefighters 9    and paramedics;10        (9) The requirement for fire department sponsorship in 11    order to attend an Illinois fire academy;12        (10) How well the State of Illinois provides a pathway 13    for qualified individuals to obtain the necessary skills 14    to seek employment as a firefighter and paramedic as a 15    public employee in the State of Illinois; and16        (11) All other areas that the Task Force deems 17    necessary to examine to assist in the recruitment and 18    retention of public employee firefighters and paramedics; 19    and be it further 20    RESOLVED, That the Task Force will be comprised of the 21following 19 members, who shall serve without compensation:22        (1) 4 members of the Illinois General Assembly, one 23    each appointed by the Senate President, the Speaker of the 24    House, the Senate Minority Leader, and the House Minority 25    Leader; the General Assembly members appointed by the   SJ0007- 3 -LRB103 00144 MST 45149 r1    Senate President and Speaker of the House shall serve as 2    Co-Chairs;3        (2) 3 members representing the Associated Fire 4    Fighters of Illinois\r\nand 3 members representing the 5    Illinois Fire Chiefs Association, all appointed by the 6    Senate President;7        (3) 3 members representing a statewide organization of 8    municipalities as authorized by Section 1-8-1 of the 9    Illinois Municipal Code, all appointed by the Speaker of 10    the House;11        (4) 1 member representing the Northern Illinois 12    Alliance of Fire Protection Districts\r\nand 1 member 13    representing the Illinois Fire Service Institute, both  14    appointed by the Minority Leader of the Senate;15        (5) 1 member representing the Illinois Association of 16    Fire Protection Districts\r\nand 1 member representing the 17    Illinois Community College Systems, both appointed by the 18    Minority Leader of the House; and19        (6) 1 member representing the Office of the State Fire 20    Marshal\r\nand 1 member representing the Illinois Department 21    of Public Health, both appointed by the Governor; and be 22    it further 23    RESOLVED, That the Task Force shall convene at the call of 24the Co-Chairs and shall hold at least five meetings; and be it 25further   SJ0007- 4 -LRB103 00144 MST 45149 r1    RESOLVED, That the Office of the State Fire Marshal shall 2provide administrative support for the Task\r\nForce; and be it 3further 4    RESOLVED, That the Task Force shall submit its final 5report to the General Assembly and the Governor no later than 6January 1, 2024, and upon the filing of its final report, the 7Task Force is dissolved.\n\n\n\n\n\n"
    },
    "ocd-bill/4f8153ad-22e1-44d3-8eb0-d0ccab30c770": {
        "id": "ocd-bill/4f8153ad-22e1-44d3-8eb0-d0ccab30c770",
        "state": "Illinois",
        "title": "SCHOOL CODE-VARIOUS",
        "chamber": "Senate",
        "created_date": "2023-02-11",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB2390sam002.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB2390\n\n\n\n\nSB2390sam002 103RD GENERAL ASSEMBLY  Sen. Cristina H. Pacione-ZayasFiled: 3/6/2023   \r\n10300SB2390sam002LRB103 28048 RJT 58631 a\r\n1AMENDMENT TO SENATE BILL 2390\r\n\r\n2    AMENDMENT NO. ______. Amend Senate Bill 2390 on page 38, 3line 19, by replacing \"up to 4 phases:\" with \"up to 3 4 4phases:\"; and\r\n\r\n 5on page 39, by replacing line 5 with the following:6    \"enter the residency.  In residency, the candidate must: be 7    assigned an effective, fully licensed teacher by the 8    principal or principal equivalent to act as a mentor and 9    coach the candidate through residency, and must complete 10    additional program\"; and 11on page 39, by replacing line 15 through 19 with:12        \"(3) (Blank). If needed, a  second year of residency, 13    which shall include the candidate's assignment to a 14    full-time teaching position for one school year. The 15    candidate must be assigned an experienced teacher to act 16    as a mentor and coach the candidate through the second   10300SB2390sam002- 2 -LRB103 28048 RJT 58631 a1    year of residency.\"; and 2on page 41, line 11, after \"area of\" by inserting \"early 3childhood\".\n\n\n\n\n\n"
    },
    "ocd-bill/c6c4db2b-7019-44f1-9069-a734b439f8a1": {
        "id": "ocd-bill/c6c4db2b-7019-44f1-9069-a734b439f8a1",
        "state": "Illinois",
        "title": "ADMIN HEARING-LANGUAGES",
        "chamber": "Senate",
        "created_date": "2023-02-11",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB2376sam002.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB2376\n\n\n\n\nSB2376sam002 103RD GENERAL ASSEMBLY  Sen. Karina VillaFiled: 3/6/2023   \r\n10300SB2376sam002LRB103 28553 DTM 58635 a\r\n1AMENDMENT TO SENATE BILL 2376\r\n\r\n2    AMENDMENT NO. ______. Amend Senate Bill 2376 on page 3, 3line 2, immediately after \"for\" by inserting  \"receiving 4language\"; and\r\n\r\n 5on page 5, line 3, by replacing \"must be\" with \"are\"; and 6on page 5, line 7, by replacing \"must be\" with \"are\".\r\n\r\n\n\n\n\n"
    },
    "ocd-bill/0cd6408b-6a2c-439d-beae-90e2f16ae09c": {
        "id": "ocd-bill/0cd6408b-6a2c-439d-beae-90e2f16ae09c",
        "state": "Illinois",
        "title": "MEDICAID-SUPP LIVING FACILITY",
        "chamber": "Senate",
        "created_date": "2023-02-11",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB2341.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB2341\n\n\n\n\nSB2341 103RD GENERAL ASSEMBLY  \r\n  \r\n  103RD GENERAL ASSEMBLY\r\nState of Illinois\r\n2023 and 2024SB2341 Introduced 2/10/2023, by Sen. Dale Fowler SYNOPSIS AS INTRODUCED: \r\n \r\n305 ILCS 5/5-5.01a\r\n\r\n     Amends the Medical Assistance Article of the Illinois Public Aid Code. In provisions concerning the supportive living facilities program, provides that a facility selected by the Department of Healthcare and Family Services  to participate in the supportive living facilities program may employ direct support persons who are at least 18 years of age and have successfully completed a direct support persons training program, approved by the Department of Human Services, within 120 days of their date of hire or the date they were first assigned direct support responsibilities at the facility. Requires the facility to check the Department of Public Health's Health Care Worker Registry to verify that an individual hired to provide direct support services is listed on the Registry as eligible to work for a health care employer. Provides that the responsibilities of a direct support person hired in accordance with the amendatory Act shall include, but not be limited to: (i) following and helping to carry out a facility resident's written service plan; (ii) providing personal care services to facility residents, including, but not limited to, bathing, eating, dressing, personal hygiene, grooming, toileting, ambulation, medication reminders, and assistance with transfer; (iii) observing a facility resident's functioning, maintaining written records of those observations, and reporting  any changes to a licensed nurse on duty at the facility; and (iv)  attending initial training and in-service training sessions and staff conferences.\r\n  LRB103 28660 KTG 55041 b  A BILL FOR \r\n  SB2341LRB103 28660 KTG 55041 b\r\n  1    AN ACT concerning public aid.\r\n   2    Be it enacted by the People of the State of Illinois,\r\n 3represented in the General Assembly:\r\n  \r\n  4    Section 5. The Illinois Public Aid Code is amended  by 5changing Section 5-5.01a as follows: \r\n\r\n\r\n6    (305 ILCS 5/5-5.01a)\r\n\r\n\r\n7    Sec. 5-5.01a. Supportive living facilities program. 8    (a) The\r\n\r\nDepartment shall establish and provide oversight 9for a program of supportive living facilities that seek to 10promote\r\nresident independence, dignity, respect, and 11well-being in the most\r\ncost-effective manner.\r\n12    A supportive living facility is (i) a free-standing 13facility or (ii) a distinct\r\nphysical and operational entity 14within a mixed-use building that meets the criteria 15established in subsection (d).  A supportive\r\nliving facility 16integrates housing with health, personal care, and supportive\r\n17services and is a designated setting that offers residents 18their own\r\nseparate, private, and distinct living units.\r\n19    Sites for the operation of the program\r\n\r\nshall be selected 20by the Department based upon criteria\r\nthat may include the 21need for services in a geographic area, the\r\navailability of 22funding, and the site's ability to meet the standards.\r\n23    (b) Beginning July 1, 2014, subject to federal approval,   SB2341- 2 -LRB103 28660 KTG 55041 b1the Medicaid rates for supportive living facilities shall be 2equal to the supportive living facility Medicaid rate 3effective on June 30, 2014 increased by 8.85%.\r\nOnce the 4assessment imposed at Article V-G of this Code is determined 5to be a permissible tax under Title XIX of the Social Security 6Act, the Department shall increase the Medicaid rates for 7supportive living facilities effective on July 1, 2014 by 89.09%. The Department shall apply this increase retroactively 9to coincide with the imposition of the assessment in Article 10V-G of this Code in accordance with the approval for federal 11financial participation by the Centers for Medicare and 12Medicaid Services. 13    The Medicaid rates for supportive living facilities 14effective on July 1, 2017 must be equal to the rates in effect 15for supportive living facilities on June 30, 2017 increased by 162.8%. 17    The Medicaid rates for supportive living facilities 18effective on July 1, 2018 must be equal to the rates in effect 19for supportive living facilities on June 30, 2018. 20    Subject to federal approval, the Medicaid rates for 21supportive living services on and after July 1, 2019 must be at 22least 54.3% of the average total nursing facility services per 23diem for the geographic areas defined by the Department while 24maintaining the rate differential for dementia care and must 25be updated whenever the total nursing facility service per 26diems are updated. Beginning July 1, 2022, upon the   SB2341- 3 -LRB103 28660 KTG 55041 b1implementation of the Patient Driven Payment Model, Medicaid 2rates for supportive living services must be at least 54.3% of 3the average total nursing services per diem rate for the 4geographic areas. For purposes of this provision, the average 5total nursing services per diem rate shall include all add-ons 6for nursing facilities for the geographic area provided for in 7Section 5-5.2. The rate differential for dementia care must be 8maintained in these rates and the rates shall be updated 9whenever nursing facility per diem rates are updated. 10    (c) The Department may adopt rules to implement this 11Section.  Rules that\r\nestablish or modify the services, 12standards, and conditions for participation\r\nin the program 13shall be adopted by the Department in consultation\r\nwith the 14Department on Aging, the Department of Rehabilitation 15Services, and\r\nthe Department of Mental Health and 16Developmental Disabilities (or their\r\nsuccessor agencies).\n17    (c-5) A facility selected by the Department to participate 18in the supportive living facilities program may employ direct 19support persons who are at least 18 years of age and have 20successfully completed a direct support persons training 21program, approved by the Department of Human Services, within 22120 days of their date of hire or the date they were first 23assigned direct support responsibilities at the facility. The 24facility must check the Department of Public Health's Health 25Care Worker Registry to verify that an individual hired to 26provide direct support services is listed on the Registry as   SB2341- 4 -LRB103 28660 KTG 55041 b1eligible to work for a health care employer. The 2responsibilities of a direct support person hired in 3accordance with this subsection shall include, but not be 4limited to:5        (1) Following and helping to carry out a facility 6    resident's written service plan.7        (2) Providing personal care services to facility 8    residents, including, but not limited to, bathing, eating, 9    dressing, personal hygiene, grooming, toileting, 10    ambulation, medication reminders, and assistance with 11    transfer.12        (3) Observing a facility resident's functioning, 13    maintaining written records of those observations, and 14    reporting  any changes to a licensed nurse on duty at the 15    facility.16        (4) Attending initial training and in-service training 17    sessions and staff conferences.18    (d) Subject to federal approval by the Centers for 19Medicare and Medicaid Services, the Department shall accept 20for consideration of certification under the program any 21application for a site or building where distinct parts of the 22site or building are designated for purposes other than the 23provision of supportive living services, but only if: 24        (1) those distinct parts of the site or building are 25    not designated for the purpose of providing assisted 26    living services as required under the Assisted Living and   SB2341- 5 -LRB103 28660 KTG 55041 b1    Shared Housing Act; 2        (2) those distinct parts of the site or building are 3    completely separate from the part of the building used for 4    the provision of supportive living program services, 5    including separate entrances; 6        (3) those distinct parts of the site or building do 7    not share any common spaces with the part of the building 8    used for the provision of supportive living program 9    services; and 10        (4) those distinct parts of the site or building do 11    not share staffing with the part of the building used for 12    the provision of supportive living program services. 13    (e) Facilities or distinct parts of facilities which are 14selected as supportive\r\nliving facilities and are in good 15standing with the Department's rules are\r\nexempt from the 16provisions of the Nursing Home Care Act and the Illinois 17Health\r\nFacilities Planning Act.\n18    (f) Section 9817 of the American Rescue Plan Act of 2021 19(Public Law 117-2) authorizes a 10% enhanced federal medical 20assistance percentage for supportive living services for a 2112-month period from April 1, 2021 through March 31, 2022.  22Subject to federal approval, including the approval of any 23necessary waiver amendments or other federally required 24documents or assurances, for a 12-month period the Department 25must pay a supplemental $26 per diem rate to all supportive 26living facilities with the additional federal financial   SB2341- 6 -LRB103 28660 KTG 55041 b1participation funds that result from the enhanced federal 2medical assistance percentage from April 1, 2021 through March 331, 2022. The Department may issue parameters around how the 4supplemental payment should be spent, including quality 5improvement activities.  The Department may alter the form, 6methods, or timeframes concerning the supplemental per diem 7rate to comply with any subsequent changes to federal law, 8changes made by guidance issued by the federal Centers for 9Medicare and Medicaid Services, or other changes necessary to 10receive the enhanced federal medical assistance percentage. 11(Source: P.A. 101-10, eff. 6-5-19; 102-43, eff. 7-6-21; 12102-699, eff. 4-19-22.)\n\n\n\n\n\n\n"
    },
    "ocd-bill/b6ea548b-fb74-4594-bb74-8d481b83b108": {
        "id": "ocd-bill/b6ea548b-fb74-4594-bb74-8d481b83b108",
        "state": "Illinois",
        "title": "LABOR-WORK-RELATED NOTICES",
        "chamber": "Senate",
        "created_date": "2023-02-11",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB2280sam002.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB2280\n\n\n\n\nSB2280sam002 103RD GENERAL ASSEMBLY  Sen. Ram VillivalamFiled: 3/6/2023   \r\n10300SB2280sam002LRB103 30715 SPS 58638 a\r\n1AMENDMENT TO SENATE BILL 2280\r\n\r\n2    AMENDMENT NO. ______. Amend Senate Bill 2280 by replacing 3everything after the enacting clause with the following:\r\n\r\n  4    \"Section 5. The State Finance Act is amended by changing 5Section 5.942 as follows: \r\n \r\n6    (30 ILCS 105/5.942)\r\n\r\n 7    Sec. 5.942. The Equal Pay Registration Fund.8(Source: P.A. 101-656, eff. 3-23-21; 102-813, eff. 5-13-22.)\r\n   9    Section 10. The Personnel Record Review Act is amended  by 10changing Section 2 as follows: \r\n\r\n\r\n11    (820 ILCS 40/2)  (from Ch. 48, par. 2002)\r\n\r\n\r\n12    Sec. 2. Open Records. Every employer shall, upon an 13employee's request\r\n which the employer may require be in 14writing on a form supplied by the\r\nemployer, permit the   10300SB2280sam002- 2 -LRB103 30715 SPS 58638 a1employee to inspect any personnel documents which are,\r\nhave 2been or are intended to be used in determining that employee's 3qualifications for\r\nemployment, promotion, transfer,\r\nadditional 4compensation, discharge or other disciplinary action,\r\nexcept 5as provided in Section 10. The inspection right\r\nencompasses 6personnel documents in\r\nthe possession of a person, 7corporation, partnership, or other association\r\nhaving a 8contractual agreement with the employer to keep or supply a 9personnel\r\nrecord. An employee may request all or any part of 10his or her\r\nrecords, except as provided in Section 10. The 11employer shall grant at least\r\n2 inspection requests by an 12employee in a calendar year when requests are\r\nmade at 13reasonable intervals, unless otherwise\r\nprovided in a 14collective bargaining agreement. The employer\r\nshall provide 15the employee with the inspection opportunity within 7 working\r\n16days after the employee makes the request or if the employer 17can reasonably\r\nshow that such deadline cannot be met, the 18employer shall have an\r\nadditional 7 days to comply. The 19inspection shall take place\r\nat a location reasonably near the 20employee's place of employment and during\r\nnormal working 21hours.\r\nThe employer may allow the inspection to take place at a 22time other than\r\nworking hours or at a place other than where 23the records are maintained\r\nif that time or place would be more 24convenient for the employee.\r\nNothing in this Act shall be 25construed as a requirement that an\r\nemployee be permitted to 26remove any part of such personnel records or any\r\npart of such   10300SB2280sam002- 3 -LRB103 30715 SPS 58638 a1records from the place on the employer's premises where it is\r\n2made available for inspection.  Each employer shall retain the 3right to\r\nprotect his records from loss, damage, or alteration 4to insure the integrity\r\nof the records. The\nIf an employee 5demonstrates that he or she is unable to review his or her 6personnel record\r\nat the employing unit, the employer shall,  7upon the employee's written\r\nrequest, email or mail a copy of 8the requested record to the employee by the email address or 9mailing address identified by the employee for the purpose of 10receiving the copy of requested record. An employer may charge 11a fee for providing a copy of the requested record. The fee 12shall be limited to the actual cost of duplicating the 13requested record.\n14(Source: P.A. 83-1362.)\n \n15    (820 ILCS 40/3 rep.)\n16    Section 15. The Personnel Record Review Act is amended  by 17repealing Section 3. 18    Section 20. The Minimum Wage Law is amended  by changing 19Sections 9 and 12 as follows: \n\n\n20    (820 ILCS 105/9)  (from Ch. 48, par. 1009)\n\n\n21    Sec. 9. \nEvery employer subject to any provision of this 22Act or of any\r\nregulations issued under this Act shall keep a 23summary of this Act approved\r\nby the Director, and copies of any   10300SB2280sam002- 4 -LRB103 30715 SPS 58638 a1applicable regulations issued under this\r\nAct or a summary of 2such regulations, posted in a conspicuous and\r\naccessible place 3in or about the premises wherever any person subject to\r\nthis 4Act is employed. Every employer subject to any provision of 5this Act or any regulations issued under this Act with 6employees who do not regularly report to a physical workplace, 7such as employees who work remotely or travel for work, shall 8also provide the summaries and regulations by email to its 9employees or conspicuous posting on the employer's website or 10intranet site, if such site is regularly used by the employer 11to communicate work-related information to employees and is  12able to be regularly accessed by all employees, freely and 13without interference. Employers shall be furnished copies of 14such summaries\r\nand regulations by the State on request without 15charge.\n16(Source: P.A. 77-1451.)\n \n\n\n17    (820 ILCS 105/12)  (from Ch. 48, par. 1012)\n\n18    Sec. 12. (a) If any employee is paid by his employer less 19than the wage\r\nto which he is entitled under the provisions of 20this Act, the employee may\r\nrecover in a civil\r\naction treble the 21amount of any such underpayments together with costs and such\r\n22reasonable attorney's fees as may be allowed by the Court, and 23damages of 5% of the amount of any such underpayments for each 24month following the date of payment during which such 25underpayments remain unpaid. Any\r\n\r\nagreement between the   10300SB2280sam002- 5 -LRB103 30715 SPS 58638 a1employee and the employer to work for less than such wage is\r\nno 2defense to such action.  At the request of the employee or on 3motion\r\nof the Director of Labor, the\r\nDepartment of Labor may 4make an assignment of such wage claim in trust for\r\nthe 5assigning employee and may bring any legal action necessary to 6collect\r\nsuch claim, and the employer shall be required to pay 7the costs incurred in\r\ncollecting such claim.  Every such action 8shall be brought within\r\n3 years from the date of the 9underpayment.  Such employer shall be liable\r\nto the Department 10of Labor for a penalty in an amount of up to 20% of the total 11employer's underpayment\r\nwhere the employer's conduct is proven 12by a preponderance of the evidence to be willful, repeated, or 13with reckless disregard of this Act or any rule adopted under 14this Act. Such employer shall be liable to the Department for 15an additional penalty of $1,500. All administrative penalties 16ordered under this Act shall be paid by certified check, money 17order, or by an electronic payment system designated by the 18Department, and shall be made , payable to or deposited into 19the Department's Wage Theft Enforcement Fund. Such employer 20shall be additionally\r\nliable to the employee for damages in 21the amount of 5% of the amount\r\nof any such underpayments for 22each month following the date of payment\r\nduring which such 23underpayments\r\nremain unpaid. These penalties and damages may 24be recovered in a\r\ncivil action brought by the Director of Labor 25in any circuit court.  In any\r\nsuch action, the Director of Labor 26shall be represented by the Attorney\r\nGeneral.\n  10300SB2280sam002- 6 -LRB103 30715 SPS 58638 a1    If an employee collects damages of 5% of the amount\r\nof 2underpayments as a result of  an action brought by the Director 3of Labor, the employee may not also collect those damages in a 4private action brought by the employee for the same violation. 5If an employee collects damages of 5% of the amount\r\nof 6underpayments in  a private action brought by the employee, the 7employee may not also collect those damages as a result of an 8action brought by the Director of Labor for the same 9violation.\r\n10    (b) If an employee has not collected damages under 11subsection (a) for the same violation, the Director is 12authorized to supervise the payment of the unpaid\r\nminimum 13wages and the unpaid overtime compensation owing to any 14employee\r\nor employees under Sections 4 and 4a of this Act and 15may bring any legal\r\naction necessary to recover the amount of 16the unpaid minimum wages and unpaid\r\novertime compensation and 17an equal additional amount as\r\ndamages,\r\nand the employer shall 18be required to pay the costs incurred in collecting such 19claim. Such employer shall be additionally liable to the 20Department of Labor for up to 20% of the total employer's 21underpayment where the employer's conduct is proven by a 22preponderance of the evidence to be willful, repeated, or with 23reckless disregard of this Act or any rule adopted under this 24Act. Such employer shall be liable to the Department of Labor 25for an additional penalty of $1,500, payable to the 26Department's Wage Theft Enforcement Fund.\r\n\r\nThe action shall be   10300SB2280sam002- 7 -LRB103 30715 SPS 58638 a1brought within 5 years from the date of the failure to\r\npay\r\nthe 2wages or compensation.\r\nAny sums thus recovered\r\nby the Director 3on behalf of an employee pursuant to this subsection shall\r\nbe 4paid to the employee or employees affected.  Any sums which, 5more than one\r\nyear after being thus recovered, the Director is 6unable to pay to\r\nan employee shall be deposited into the 7General Revenue Fund.\n8(Source: P.A. 101-1, eff. 2-19-19.)\n 9    Section 25. The Equal Pay Act of 2003 is amended  by 10changing Sections 11, 30, and 40, and by adding Section 33 as 11follows: 12    (820 ILCS 112/11)13    Sec. 11. Equal pay registration certificate requirements; 14application. For the purposes of this Section 11 only, 15\"business\" means any private employer who has 100 or more 16employees in the State of Illinois and is required to file an 17Annual Employer Information Report EEO-1 with the Equal 18Employment Opportunity Commission, but does not include the 19State of Illinois or any political subdivision, municipal 20corporation, or other governmental unit or agency. 21    (a) A business must obtain an equal pay registration 22certificate from the Department. 23    (b) Any business subject to the requirements of this 24Section that is authorized to transact business in this State   10300SB2280sam002- 8 -LRB103 30715 SPS 58638 a1on March 23, 2021 shall submit an application to obtain an 2equal pay registration certificate, between March 24, 2022 and 3March 23, 2024, and must recertify every 2 years thereafter. 4Any business subject to the requirements of this Section that 5is authorized to transact business in this State after March 623, 2021 must submit an application to obtain an equal pay 7registration certificate within 3 years of commencing business 8operations, but not before January 1, 2024, and must recertify 9every 2 years thereafter. The Department shall collect contact 10information from each business subject to this Section.  The 11Department shall assign each business a date by which it must 12submit an application to obtain an equal pay registration 13certificate.  The business shall recertify every 2 years at a 14date to be determined by the Department.  When a business 15receives a notice from the Department to recertify for its 16equal pay registration certificate, if the business has fewer 17than 100 employees, the business must certify in writing to 18the Department that it is exempt from this Section.  Any new 19business that is subject to this Section and authorized to 20conduct business in this State, after the effective date of 21this amendatory Act of the 102nd General Assembly, shall 22submit its contact information to the Department by January 1 23of the following year and shall be assigned a date by which it 24must submit an application to obtain an equal pay registration 25certificate. The Department's failure to assign a business a 26registration date does not exempt the business from compliance   10300SB2280sam002- 9 -LRB103 30715 SPS 58638 a1with this Section. The failure of the Department to notify a 2business of its recertification deadline may be a mitigating 3factor when making a determination of a violation of this 4Section. 5    (c) Application.6        (1) A business shall apply for an equal pay 7    registration certificate by paying a $150 filing fee and 8    submitting wage records and an equal pay compliance 9    statement to the Director as follows:10            (A) Wage Records. Any business that  is required to 11        file an annual Employer Information Report EEO-1 with 12        the Equal Employment Opportunity Commission must also 13        submit to the Director a copy of the business's most 14        recently filed Employer Information Report EEO-1. The 15        business shall also compile a list of all employees 16        during the past calendar year, separated by gender and 17        the race and ethnicity categories as reported in the 18        business's most recently filed Employer Information 19        Report EEO-1, and the county in which the employee 20        works, the date the employee started working for the 21        business, any other information the Department deems 22        necessary to determine if pay equity exists among 23        employees, and report the total wages as defined by 24        Section 2 of the Illinois Wage Payment and Collection 25        Act paid to each employee during the past calendar 26        year, rounded to the nearest $100, to the Director.   10300SB2280sam002- 10 -LRB103 30715 SPS 58638 a1            (B)  Equal Pay Compliance Statement.    The business 2        must submit a statement signed by a corporate officer, 3        legal counsel, or authorized agent of the business 4        certifying: 5                (i) that the business is in compliance with 6            this Act and other relevant laws, including but 7            not limited to: Title VII of the Civil Rights Act 8            of 1964, the Equal Pay Act of 1963, the Illinois 9            Human Rights Act, and the Equal Wage Act;10                (ii) that the average compensation for its 11            female and minority employees is not consistently 12            below the average compensation, as determined by 13            rule by the United States Department of Labor, for 14            its male and non-minority employees within each of 15            the major job categories in the Employer 16            Information Report EEO-1 for which an employee is 17            expected to perform work, taking into account 18            factors such as length of service, requirements of 19            specific jobs, experience, skill, effort, 20            responsibility, working conditions of the job, 21            education or training, job location, use of a 22            collective bargaining agreement, or other 23            mitigating factors; as used in this subparagraph, 24            \"minority\" has the meaning ascribed to that term 25            in paragraph (1) of subsection (A) of Section 2 of 26            the Business Enterprise for Minorities, Women, and   10300SB2280sam002- 11 -LRB103 30715 SPS 58638 a1            Persons with Disabilities Act; and as used in this 2            subparagraph, \"compensation\" means remuneration or 3            compensation an employee receives in return for 4            services rendered to an employer, including hourly 5            wages, overtime wages, commissions, piece rate 6            work, salary, bonuses, or any other basis of 7            calculation for services performed; 8                (iii) that the business does not restrict 9            employees of one sex to certain job 10            classifications, and makes retention and promotion 11            decisions without regard to sex; 12                (iv) that wage and benefit disparities are 13            corrected when identified to ensure compliance 14            with the Acts cited in item (i); 15                (v) how often wages and benefits are 16            evaluated; and17                (vi)  the approach the business takes in 18            determining  what level of wages and benefits to 19            pay its employees; acceptable approaches include, 20            but are not limited to, a wage and salary survey.21            (C) Filing fee. The business shall pay to the 22        Department a filing fee of $150. Proceeds from the 23        fees collected under this Section shall be deposited 24        into the Equal Pay Registration Fund, a special fund 25        created in the State treasury. Moneys in the Fund 26        shall be appropriated to the Department for the   10300SB2280sam002- 12 -LRB103 30715 SPS 58638 a1        purposes of this Section. 2        (2) Receipt of the equal pay compliance application 3    and statement by the Director does not establish 4    compliance with the Acts set forth in item (i) of 5    subparagraph (B) of paragraph (1) of this subsection (c).6        (3) A business that has employees in multiple 7    locations or facilities in\r\nIllinois shall submit a single 8    application to the Department regarding all of its\r\n9    operations in Illinois. 10    (d) Issuance or rejection of registration certificate. 11After January 1, 2022, the Director must issue an equal pay 12registration certificate, or a statement of why the 13application was rejected, within 45 calendar days of receipt 14of the application. Applicants shall have the opportunity to 15cure any deficiencies in its application that led to the 16rejection, and re-submit the revised application to the 17Department within 30 calendar days of receiving a rejection. 18Applicants shall have the ability to appeal rejected 19applications.  An application may be rejected only if it does 20not comply with the requirements of subsection (c), or the 21business is otherwise found to be in violation of this Act. The 22receipt of an application by the Department, or the issuance 23of a registration certificate by the Department, shall not 24establish compliance  with the Equal Pay Act of 2003 as to all 25Sections except Section 11. The issuance of a registration 26certificate shall not be a defense against any Equal Pay Act   10300SB2280sam002- 13 -LRB103 30715 SPS 58638 a1violation found by the Department, nor a basis for mitigation 2of damages. 3    (e)  Revocation of registration certificate. An equal pay 4registration certificate for a business may be suspended or 5revoked by the Director when the business fails to make a good 6faith effort to comply with the Acts identified in item (i) of 7subparagraph (B) of paragraph (1) of subsection (c), fails to 8make a good faith effort to comply with this Section, or has 9multiple violations of this Section or the Acts identified in 10item (i) of subparagraph (B) of paragraph (1) of subsection 11(c). Prior to suspending or revoking a registration 12certificate, the Director must first have sought to conciliate 13with the business regarding wages and benefits due to 14employees. 15    Consistent with Section 25, prior to or in connection with 16the suspension or revocation of an equal pay registration 17certificate, the  Director, or his or her authorized 18representative, may interview workers, administer oaths, take 19or cause to be taken the depositions of witnesses, and require 20by subpoena the attendance and testimony of witnesses, and the 21production of personnel and compensation information relative 22to the matter under investigation,  hearing or a 23department-initiated audit. 24    Neither the Department nor the Director shall be held 25liable for good faith errors in issuing, denying, suspending 26or revoking certificates.   10300SB2280sam002- 14 -LRB103 30715 SPS 58638 a1    (f) Administrative review. A business may obtain an 2administrative hearing in accordance with the Illinois 3Administrative Procedure Act before the suspension or 4revocation of its certificate or imposition of civil penalties 5as provided by subsection (i) is effective by filing a written 6request for hearing within 20 calendar days after service of 7notice by the Director.8    (g) Technical assistance. The Director must provide 9technical assistance to any business that requests assistance 10regarding this Section. 11    (h) Access to data. 12        (1) Any individually identifiable information 13    submitted  to the Director within or related to an equal 14    pay registration  application or otherwise provided by an 15    employer in its equal pay compliance statement under 16    subsection (c) shall be considered confidential 17    information and not subject to disclosure pursuant to the 18    Illinois Freedom of Information Act. As used in this 19    Section, \"individually identifiable information\" means 20    data submitted pursuant to this Section that is associated 21    with a specific person or business. Aggregate data or 22    reports that are reasonably calculated to prevent the 23    association of any data with any individual business or 24    person are not confidential information. Aggregate data 25    shall include the job category and the average hourly wage 26    by county for each gender, race, and ethnicity category on   10300SB2280sam002- 15 -LRB103 30715 SPS 58638 a1    the registration certificate applications. The Department 2    of Labor may compile aggregate data from registration 3    certificate applications.4        (2) The Director's decision to issue, not issue, 5    revoke, or suspend an equal pay registration certificate 6    is public information.7        (3) Notwithstanding this subsection (h), a current 8    employee of a covered business may request anonymized data 9    regarding their job classification or title and the pay 10    for that classification. No individually identifiable 11    information may be provided to an employee making a 12    request under this paragraph.13        (4) Notwithstanding this subsection (h), the 14    Department may share data and identifiable information 15    with the Department of Human Rights, pursuant to its 16    enforcement of Article 2 of the Illinois Human Rights Act, 17    or the Office of the Attorney General, pursuant to its 18    enforcement of Section 10-104 of the Illinois Human Rights 19    Act. 20        (5) Any Department employee who willfully and 21    knowingly divulges, except in accordance with a proper 22    judicial order or otherwise provided by law, confidential 23    information received by the Department from any business 24    pursuant to this Act shall be deemed to have violated the 25    State Officials and Employees Ethics Act and be subject to 26    the penalties established under subsections (e) and (f) of   10300SB2280sam002- 16 -LRB103 30715 SPS 58638 a1    Section 50-5 of that Act after investigation and 2    opportunity for hearing before the Executive Ethics 3    Commission in accordance with Section 20-50 of that Act. 4    (i) Penalty. Falsification or misrepresentation of 5information on an application submitted to the Department 6shall constitute a violation of this Act and the Department 7may seek to suspend or revoke an equal pay registration 8certificate or impose civil penalties as provided under 9subsection (c) of Section 30. \n10(Source: P.A. 101-656, eff. 3-23-21; 102-36, eff. 6-25-21; 11102-705, eff. 4-22-22.) \n\n12    (820 ILCS 112/30)\n\n\n13    Sec. 30. Violations; fines and penalties. \n14    (a) If an employee is paid by his or her employer less than 15the wage to\r\nwhich he or\r\nshe is entitled in\r\nviolation of Section 1610 or 11 of this Act, the employee may recover in a civil 17action\r\nthe entire amount of any\r\nunderpayment together with 18interest, compensatory damages if the employee demonstrates 19that the employer acted with malice or reckless indifference, 20punitive damages as may be appropriate, injunctive relief as 21may be appropriate, and the costs and reasonable attorney's\r\n22fees as may be\r\nallowed by the\r\ncourt and as necessary to make 23the employee whole.  At the request of the\r\nemployee or on a 24motion of the Director,\r\nthe Department may\r\nmake an assignment 25of the wage claim in trust for the assigning employee and\r\nmay   10300SB2280sam002- 17 -LRB103 30715 SPS 58638 a1bring any\r\nlegal action necessary to collect the claim, and the 2employer shall be required\r\nto pay the costs\r\nincurred in 3collecting the claim.  Every such action shall be brought 4within 5\r\nyears from the date\r\n of the underpayment. For purposes 5of this Act, \"date of the underpayment\" means each time wages 6are underpaid.\n7    (a-5) If an employer violates subsection (b), (b-5), 8(b-10), or (b-20) of Section 10, the employee may recover in a 9civil action any damages incurred, special damages not to 10exceed $10,000, injunctive relief as may be appropriate, and 11costs and reasonable attorney's fees as may be allowed by the 12court and as necessary to make the employee whole. If special 13damages are available, an employee may recover compensatory 14damages only to the extent such damages exceed the amount of 15special damages. Such action shall be brought within 5 years 16from the date of the violation. 17    (b) The Director is authorized to supervise the payment of 18the unpaid wages under subsection (a) or damages under 19subsection (b), (b-5), (b-10), or (b-20) of Section 10\r\nowing 20to any\r\nemployee or employees under this Act and may bring any 21legal action necessary\r\nto recover the\r\namount of unpaid wages, 22damages, and penalties or to seek injunctive relief, and the 23employer shall be required to pay\r\nthe costs.  Any\r\nsums 24recovered by the Director on behalf of an employee under this\r\n25Section shall be\r\npaid to the employee or employees affected.\n26    (c) Employers who violate any provision of this Act or any   10300SB2280sam002- 18 -LRB103 30715 SPS 58638 a1rule\r\nadopted under the Act are subject to a civil penalty, 2payable to the Department, for each employee affected as 3follows: 4        (1) An employer with fewer than 4 employees: first 5    offense, a fine not to exceed $500; second offense, a fine 6    not to exceed $2,500; third or subsequent offense, a fine 7    not to exceed $5,000.8        (2) An employer with between 4  and 99 employees: first 9    offense, a fine not to exceed $2,500; second offense, a 10    fine not to exceed $3,000; third or subsequent offense, a 11    fine not to exceed $5,000.12        (3)  An employer with 100 or more employees who 13    violates any Section of this Act except for Section 11 14    shall be fined up to $10,000 per employee affected. An 15    employer with 100 or more employees that is a business as 16    defined under Section 11 and commits a violation of 17    Section 11 shall be fined up to $10,000. 18    Before any imposition of a penalty under this subsection, 19an employer with 100 or more employees who violates item (b) of 20Section 11 and inadvertently fails to file an initial 21application or recertification shall be provided 30 calendar 22days by the Department to submit the application or 23recertification. 24    An employer or person who violates subsection (b), (b-5), 25(b-10), (b-20), or (c) of Section 10 is subject to a civil 26penalty not to exceed $5,000 for each violation for each   10300SB2280sam002- 19 -LRB103 30715 SPS 58638 a1employee affected, payable to the Department.2    (d)  In determining the amount of the penalty, the\r\n3appropriateness of the\r\npenalty to the size of the business of 4the employer charged and the gravity of\r\nthe violation shall\r\nbe 5considered. The penalty may be recovered in a civil action 6brought by the\r\nDirector in\r\nany circuit court.\n7(Source: P.A. 101-177, eff. 9-29-19; 102-36, eff. 6-25-21.)\n 8    (820 ILCS 112/33 new)9    Sec. 33. Equal Pay Fund. All moneys owed to the Department 10under this Act shall be deposited into the Equal Pay Fund and 11may be appropriated to the Department for the administration 12and enforcement of this Act. \n\n\n13    (820 ILCS 112/40)\n\n\n14    Sec. 40. Notification. Every employer covered by this Act 15shall post and\r\nkeep posted, in conspicuous places on the 16premises of the employer where\r\nnotices to employees are 17customarily posted, a notice, to be prepared or\r\napproved by 18the Director, summarizing the requirements of this Act and\r\n19information pertaining to the filing of a charge. Every 20employer with employees who do not regularly report to a 21physical workplace, such as employees who work remotely or 22travel for work, shall also provide the summary and notice by 23email to its employees or conspicuous posting on the 24employer's website or intranet site, if such site is regularly   10300SB2280sam002- 20 -LRB103 30715 SPS 58638 a1used by the employer to communicate work-related information 2to employees and is able to be regularly accessed by all 3employees, freely and without interference. The Director shall 4furnish\r\ncopies of summaries and rules to employers upon 5request without charge.\n6(Source: P.A. 93-6, eff. 1-1-04.)\n 7    Section 30. The Illinois Wage Payment and Collection Act 8is amended  by changing Sections 3 and 11 as follows: \n\n\n9    (820 ILCS 115/3)  (from Ch. 48, par. 39m-3)\n\n\n10    Sec. 3. \nEvery employer shall be required, at least 11semi-monthly, to pay\r\nevery\r\nemployee all wages earned during 12the semi-monthly pay period. Wages of\r\nexecutive, 13administrative and professional employees, as defined in the\r\n14Federal Fair Labor Standards Act of 1939, may be paid once a 15month.\r\nCommissions may be paid once a month.\r\nAt the request of 16a person employed by an employment or labor placement\r\nagency 17which, in the ordinary course of business, makes daily wage 18payments to\r\nemployees,\r\nthe agency shall hold the daily wages 19and make either weekly or semi-monthly\r\npayments.\r\nUpon the 20written request of the employee, the wage shall be paid in a 21single\r\ncheck representing the wages earned during the period, 22either weekly or\r\nsemi-monthly, designated by the employee in 23accordance with Section 4 of this\r\nAct.  Employment and labor 24placement agencies that make daily wage payments\r\nshall provide   10300SB2280sam002- 21 -LRB103 30715 SPS 58638 a1written notification to all daily\r\nwage payment employees of 2the right to request weekly or semi-monthly checks.\r\nThe 3employer may provide this notice by conspicuously posting the 4notice at the\r\nlocation where the wages are received by the 5daily wage employees. Every employer with employees who do not 6regularly report to a physical workplace, such as employees 7who work remotely or travel for work, shall also provide the 8summary and notice by email to its employees or conspicuous 9posting on the employer's website or intranet site, if such 10site is regularly used by the employer to communicate 11work-related information to employees and is able to be 12regularly accessed by all employees, freely and without 13interference. \n14(Source: P.A. 89-364, eff. 8-18-95.)\n \n\n15    (820 ILCS 115/11)  (from Ch. 48, par. 39m-11)\n\n\n16    Sec. 11. It shall be the duty of the Department of Labor to 17inquire diligently\r\nfor any violations of this Act, and to 18institute the actions for violations and penalties\r\nherein 19provided, at the request of the employee or on motion of the 20Director of Labor, and to enforce generally the provisions of 21this Act.\n22    An employee may file a complaint with the Department 23alleging violations of the Act by submitting a signed, 24completed wage claim application on the form provided by the 25Department and by submitting copies of all supporting   10300SB2280sam002- 22 -LRB103 30715 SPS 58638 a1documentation.  Complaints shall be filed within one year after 2the wages, final compensation, or wage supplements were due.3    Wage claim applications Applications shall be reviewed by 4the Department to determine whether there is cause and 5sufficient resources for investigation.\r\n6    The Department shall have the following powers:\n7        (a) To investigate and attempt equitably to adjust 8    controversies between\r\nemployees and employers in respect 9    of wage claims arising under this Act\r\nand to that end the 10    Department through the Director of Labor or any other\r\n11    person in the Department of Labor designated by him or 12    her, shall have the\r\npower to administer oaths, subpoena 13    and examine witnesses, to issue subpoenas\r\nduces tecum 14    requiring the production of such books, papers, records 15    and\r\ndocuments as may be evidence of any matter under 16    inquiry and to examine and\r\ninspect the same as may relate 17    to the question in dispute.  Service of such\r\nsubpoenas 18    shall be made by any sheriff or any person.  Any\r\ncourt in 19    this State, upon the application of the Department\r\nmay 20    compel attendance of witnesses, the\r\nproduction of books 21    and papers, and the giving of testimony before the\r\n22    Department by attachment for contempt or in any other way 23    as the production\r\nof evidence may be compelled before such 24    court.\n25        (b) To take assignments of wage claims in the name of 26    the Director of\r\nLabor and his or her successors in office   10300SB2280sam002- 23 -LRB103 30715 SPS 58638 a1    and prosecute actions for the\r\ncollection of wages for 2    persons financially unable to prosecute such claims when 3    in\r\nthe judgment of the Department such claims are valid 4    and enforceable in the\r\ncourts.  No court costs or any fees 5    for necessary process and\r\nproceedings shall be payable in 6    advance by the Department for prosecuting\r\nsuch actions.  In 7    the event there is a judgment rendered against the\r\n8    defendant, the court shall assess as part of such judgment 9    the costs of\r\nsuch proceeding.  Upon collection of such 10    judgments the Department shall pay\r\nfrom the proceeds of 11    such judgment such costs to such person who is by law\r\n12    entitled to same.  The Department may join in a single 13    proceeding any number\r\nof wage claims against the same 14    employer but the court shall have\r\ndiscretionary power to 15    order a severance or separate trial for hearings.\n16        (c) To make complaint in any court of competent 17    jurisdiction of\r\nviolations of this Act.\n18        (d) In addition to the aforementioned powers, subject 19    to appropriation, the Department may establish an 20    administrative procedure to adjudicate claims and to issue 21    final and binding administrative decisions on such claims 22    subject to the Administrative Review Law. To establish 23    such a procedure, the Director of Labor or her or his 24    authorized representative may promulgate rules and 25    regulations. The adoption, amendment or rescission of 26    rules and regulations for such a procedure shall be in   10300SB2280sam002- 24 -LRB103 30715 SPS 58638 a1    conformity with the requirements of the Illinois 2    Administrative Procedure Act. If a final and binding 3    administrative decision issued by the Department requires 4    an employer or other party to pay wages, penalties, or 5    other amounts in connection with a wage claim, and the 6    employer or other party has neither: (i) made the required 7    payment within 35 days of the issuance of the final and 8    binding administrative decision; nor (ii) timely filed a 9    complaint seeking review of the final and binding 10    administrative decision pursuant to the Administrative 11    Review Law in a court of competent jurisdiction, the 12    Department may file a verified petition against the 13    employer or other party to enforce the final 14    administrative decision and to collect any amounts due in 15    connection therewith in the circuit court of any county 16    where an official office of the Department is located.17    Nothing herein shall be construed to prevent any employee 18from making\r\ncomplaint or prosecuting his or her own claim for 19wages. Any employee aggrieved by a violation of this Act or any 20rule adopted under this Act may file suit in circuit court of 21Illinois, in the county where the alleged violation occurred 22or where any employee who is party to the action resides, 23without regard to exhaustion of any alternative administrative 24remedies provided in this Act. Actions may be brought by one or 25more employees for and on behalf of themselves and other 26employees similarly situated. \n  10300SB2280sam002- 25 -LRB103 30715 SPS 58638 a1    Nothing herein shall be construed to limit the authority 2of the State's\r\nattorney of any county to prosecute actions for 3violation of this Act or\r\nto enforce the provisions thereof 4independently and without specific direction\r\nof the Department 5of Labor.\n6(Source: P.A. 101-509, eff. 1-1-20.)\n \n7    (820 ILCS 125/Act rep.)\n8    Section 35. The Wages of Women and Minors Act is repealed. 9    Section 40. The Day and Temporary Labor Services Act is 10amended  by changing Section 45 as follows: \n\n11    (820 ILCS 175/45)\n\n\n12    Sec. 45. Registration; Department of Labor. 13    (a) A day and temporary\r\nlabor service\r\nagency which is 14located, operates or transacts business within this State 15shall register with the Department of Labor in accordance with 16rules\r\nadopted by the Department for day and temporary labor 17service\r\nagencies and shall be subject to this Act and any rules 18adopted under this Act.  Each day and temporary labor service 19agency shall provide proof of an employer account number 20issued by the Department of Employment Security for the 21payment of unemployment insurance contributions as required 22under the Unemployment Insurance Act, and proof of valid 23workers' compensation insurance in effect at the time of   10300SB2280sam002- 26 -LRB103 30715 SPS 58638 a1registration covering all of its employees. If, at any time, a 2day and temporary labor service agency's workers' compensation 3insurance coverage lapses, the agency shall have an 4affirmative duty to report the lapse of such coverage to the 5Department and the agency's registration shall be suspended 6until the agency's workers' compensation insurance is 7reinstated. The Department may assess each day and temporary 8labor service agency a non-refundable\r\nregistration fee\r\nnot 9exceeding $1,000 per year per agency and a non-refundable fee 10not to exceed $250 for each branch office or other location 11where the agency regularly contracts with day or temporary 12laborers for services.  The fee may be paid by check, money 13order, or the State Treasurer's E-Pay program or any successor 14program,\r\nand the Department may not refuse to accept a check on 15the basis that it is\r\nnot a certified check or a cashier's 16check.  The Department may charge an\r\nadditional fee to be paid 17by a day and temporary labor service agency if the agency, or 18any person on the\r\nagency's behalf, issues or delivers a check 19to the Department that is not\r\nhonored by the financial 20institution upon which it is drawn.  The Department\r\nshall also 21adopt rules\r\nfor violation\r\nhearings and penalties for 22violations of this Act or the Department's rules\r\nin 23conjunction with the penalties set forth in this Act.24    (a-1) At the time of registration with the Department of 25Labor each year, the day and temporary labor service agency 26shall submit to the Department of Labor a report containing   10300SB2280sam002- 27 -LRB103 30715 SPS 58638 a1the information identified in paragraph (9) of subsection (a) 2of Section 12, broken down by branch office, in the aggregate 3for all day or temporary laborers assigned within Illinois and 4subject to this Act during the preceding year.  This 5information shall be submitted on a form created by the 6Department of Labor. The Department of Labor shall aggregate 7the information submitted by all registering day and temporary 8labor service agencies by removing identifying data and shall 9have the information available to the public only on a 10municipal and county basis. As used in this paragraph, 11\"identifying data\" means any and all information that: (i) 12provides specific information on individual worker identity; 13(ii) identifies the service agency in any manner; and (iii) 14identifies clients utilizing the day and temporary labor 15service agency or any other information that can be traced 16back to any specific registering day and temporary labor 17service agency or its client.  The information and reports 18submitted to the Department of Labor under this subsection by 19the registering day and temporary labor service agencies are 20exempt from inspection and copying under Section 7.5 of the 21Freedom of Information Act. 22    (b) It is a violation of this Act to operate a day and 23temporary labor service agency without first registering with 24the Department in accordance with  subsection (a) of this 25Section. The Department shall create and maintain at regular 26intervals on its website, accessible to the public: (1)  a list   10300SB2280sam002- 28 -LRB103 30715 SPS 58638 a1of all registered day and temporary labor service agencies in 2the State whose registration is in good standing; (2) a list of 3day and temporary labor service agencies in the State whose 4registration has been suspended, including the reason for the 5suspension, the date the suspension was initiated, and the 6date, if known, the suspension is to be lifted; and (3) a list 7of day and temporary labor service agencies in the State whose 8registration has been revoked, including the reason for the 9revocation and the date the registration was revoked. The 10Department has the authority to assess a penalty against any 11day and temporary labor service agency that fails to register 12with the Department of Labor in accordance with this Act or any 13rules adopted under this Act of $500 for each violation. Each 14day during which a day and temporary labor service agency 15operates without registering with the Department shall be a 16separate and distinct violation of this Act.17    (c) An applicant is not eligible to register to operate a 18day and temporary labor service agency under this Act if the 19applicant or any of its officers, directors, partners, or 20managers or any owner of 25% or greater beneficial interest:21        (1) has been involved, as owner, officer, director, 22    partner, or manager, of any day and temporary labor 23    service agency whose registration has been revoked or has 24    been suspended without being reinstated within the 5 years 25    immediately preceding the filing of  the application; or26        (2) is under the age of 18.  10300SB2280sam002- 29 -LRB103 30715 SPS 58638 a1    (d) Every agency shall post and keep posted at each 2location, in a position easily accessible to all day or 3temporary laborers employees, notices as supplied and required 4by the Department containing a copy or summary of the 5provisions of the Act and\r\n\r\na notice which informs\r\nthe public of 6a toll-free telephone number for day or temporary laborers\r\nand 7the public to\r\nfile wage dispute complaints and other alleged 8violations by\r\nday and temporary labor service\r\nagencies. Every 9day and temporary\r\nlabor service\r\nagency employing day or 10temporary laborers who communicate with the day and temporary\r\n11labor service\r\nagency by electronic communication shall also 12provide all required notices by email to its day or temporary 13laborers or on a website, regularly used by the employer to 14communicate work-related information, that all day or 15temporary laborers are able to regularly access, freely and 16without interference. Such notices shall be in English and or 17any other language generally understood in the locale of the 18day and temporary labor service agency.\r\n\n19(Source: P.A. 100-517, eff. 6-1-18.)\n 20    Section 45. The Child Labor Law is amended  by changing 21Sections 5, 17, and 17.3 as follows: \n\n\n22    (820 ILCS 205/5)  (from Ch. 48, par. 31.5)\n\n\n23    Sec. 5. \nEvery employer covered by this Act shall post in a 24conspicuous\r\nplace where minors under 16 years of age are   10300SB2280sam002- 30 -LRB103 30715 SPS 58638 a1employed, or allowed to work, a\r\nprinted summary abstract of 2this Act and a list of the occupations prohibited to\r\nsuch 3minors, to be furnished by the Department of Labor. Such 4employers\r\nshall post in a conspicuous place where minors under 516 years of age are\r\nemployed, or allowed to work a printed 6notice stating the hours of\r\ncommencing and stopping work, the 7hours when the time or times allowed\r\nfor dinner or other meals, 8begin and end, and the Department's toll free\r\ntelephone number 9established under Section 17.4. An employer with employees who 10do not regularly report to a physical workplace, such as 11employees who work remotely or travel for work, shall also 12provide the summary and notice by email to its employees or  13conspicuous posting on the employer's website or intranet 14site, if such site is regularly used by the employer to 15communicate work-related information to employees and is  able 16to be regularly accessed by all employees, freely and without 17interference. The Department of Labor shall furnish this 18printed summary form of such\r\nnotice shall be furnished by the 19Department of Labor.\n20(Source: P.A. 88-365.)\n \n\n\n21    (820 ILCS 205/17)  (from Ch. 48, par. 31.17)\n\n\n22    Sec. 17. \nIt shall be the duty of the Department of Labor to 23enforce\r\nthe provisions of this Act.  The Department of Labor 24shall have the power\r\nto conduct investigations in connection 25with the administration and enforcement\r\nof this Act and the   10300SB2280sam002- 31 -LRB103 30715 SPS 58638 a1authorized\r\nofficers and employees of the Department of Labor 2are hereby\r\nauthorized and empowered, to visit and inspect, at 3all reasonable times\r\nand as often as possible, all places 4covered by this Act. Truant\r\nofficers and other school 5officials authorized by the board of education\r\nor school 6directors shall report violations under this Act to the\r\n7Department of Labor, and may enter any place in which children 8are, or\r\nare believed to be employed and inspect the work 9certificates on file.\r\nSuch truant officers or other school 10officials also are authorized to\r\nfile complaints against any 11employer found violating the provisions of\r\nthis Act in case no 12complaints for such violations are pending; and when\r\nsuch 13complaints are filed by truant officers or other school 14officials\r\nthe State's attorneys of this state shall appear for 15the people, and\r\nattend to the prosecution of such complaints.  16The Department of Labor shall\r\nconduct hearings in accordance 17with \"The Illinois Administrative Procedure\r\nAct\", approved 18September 22, 1975, as amended, upon written complaint by\r\nan 19investigator of the Department of Labor, truant officer or 20other school\r\nofficial, or any interested person of a violation 21of the Act or to revoke\r\nany certificate under this Act.  After 22such hearing, if supported by the\r\nevidence, the Department of 23Labor may issue and cause to be served on any\r\nparty an order to 24cease and desist from violation of the Act, take such\r\nfurther 25affirmative or other action as deemed reasonable to eliminate 26the\r\neffect of the violation, and may revoke any certificate   10300SB2280sam002- 32 -LRB103 30715 SPS 58638 a1issued under the\r\nAct and determine the amount of any civil 2penalty allowed by the Act. The Department may serve such 3orders by certified mail or by sending a copy by email to an 4email address previously designated by the party for purposes 5of receiving notice under this Act. An email address provided 6by the party in the course of the administrative proceeding 7shall not be used in any subsequent proceedings, unless the 8party designates that email address for the subsequent 9proceeding.  The\r\nDirector of Labor or his authorized 10representative may compel by subpoena,\r\nthe attendance and 11testimony of witnesses and the production of books,\r\npayrolls, 12records, papers and other evidence in any investigation or\r\n13hearing and may administer oaths to witnesses.\n14(Source: P.A. 80-1482.)\n \n\n15    (820 ILCS 205/17.3)  (from Ch. 48, par. 31.17-3)\n\n\n16    Sec. 17.3. \nAny employer who violates any of the provisions 17of this\r\nAct or any rule or regulation issued under the Act 18shall be subject to a\r\ncivil penalty of not to exceed $5,000 for 19each such violation.  In\r\ndetermining the amount of such 20penalty, the appropriateness of such\r\npenalty to the size of 21the business of the employer charged and the\r\ngravity of the 22violation shall be considered.  The amount of such\r\npenalty, 23when finally determined, may be\n24        (1) recovered in a civil action brought by the 25    Director of Labor in\r\nany circuit court, in which   10300SB2280sam002- 33 -LRB103 30715 SPS 58638 a1    litigation the Director of Labor\r\nshall be represented by 2    the Attorney General;\n3        (2) ordered by the court, in an action brought for 4    violation under\r\nSection 19, to be paid to the Director of 5    Labor.\n6    Any administrative determination by the Department of 7Labor of the\r\namount of each penalty shall be final unless 8reviewed as provided in\r\nSection 17.1 of this Act.\n9    Civil penalties recovered under this Section shall be paid 10by certified check, money order, or  by an electronic payment 11system designated by the Department, and deposited into the\r\n12Child Labor and Day and Temporary Labor Services Enforcement 13Fund, a special fund\r\nwhich\r\nis hereby\r\ncreated in the\r\nState 14treasury.  Moneys in the Fund may be used,\r\nsubject to\r\n15appropriation, for exemplary programs, demonstration projects, 16and other\r\nactivities or purposes related to the enforcement of 17this Act or for the\r\nactivities or purposes related to the 18enforcement of the Day and Temporary\r\nLabor Services Act, or 19for the activities or purposes related to the enforcement of 20the Private Employment Agency Act.\n21(Source: P.A. 98-463, eff. 8-16-13; 99-422, eff. 1-1-16.)\".\n\n\n\n\n\n\n\n"
    },
    "ocd-bill/b766b713-1d08-4e47-8b60-ecc2257233d5": {
        "id": "ocd-bill/b766b713-1d08-4e47-8b60-ecc2257233d5",
        "state": "Illinois",
        "title": "ELECTIONS-VACANCY APPOINTMENT",
        "chamber": "Senate",
        "created_date": "2023-02-11",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB2289sam001.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB2289\n\n\n\n\nSB2289sam001 103RD GENERAL ASSEMBLY  Sen. Sue RezinFiled: 3/3/2023   \r\n10300SB2289sam001LRB103 28798 BMS 58594 a\r\n1AMENDMENT TO SENATE BILL 2289 \r\n\r\n2    AMENDMENT NO. ______. Amend Senate Bill 2289 by replacing 3everything after the enacting clause with the following:\r\n 4    \"Section 5. The Election Code is amended  by changing 5Section 25-11 as follows: \r\n\r\n6    (10 ILCS 5/25-11)  (from Ch. 46, par. 25-11)\r\n\r\n\r\n\r\n7    Sec. 25-11. \r\nExcept as otherwise provided in this 8paragraph, when a vacancy occurs in any elective county 9office, or in a\r\ncounty of less than 3,000,000 population in the 10office of clerk of the circuit\r\ncourt, in a county which is not 11a home rule unit, the county board or board\r\nof county 12commissioners shall declare that such vacancy exists and\r\n13notification thereof\r\nshall be given to the county central 14committee or the appropriate county board\r\nor board of county 15commissioners district committee of each established\r\npolitical 16party within 3 days of the\r\noccurrence of the vacancy.  The   10300SB2289sam001- 2 -LRB103 28798 BMS 58594 a1vacancy shall be filled\r\nwithin 60 days by appointment of the 2chair of the county board\r\nor board of county commissioners 3with the advice and consent of the county\r\nboard or board of 4county commissioners.\r\nIn a county In counties other than 5Champaign County operating under the county executive form of 6government under Division 2-5 of the Counties Code, when a 7vacancy occurs in an elected county office other than in the 8office of an elected member of the county board, the county 9executive shall declare that such vacancy exists and then 10notification of the vacancy shall be given to the county 11central committee of each established political party within 3 12days of the occurrence of the vacancy, and the vacancy shall be 13filled within 60 days by appointment of the county executive 14with the advice and consent of the county board. However,   when 15a vacancy occurs in the office of an elected member of the 16county board in a county other than Champaign County that is 17operating under the county executive form of government under 18Division 2-5 of the Counties Code, the elected county board 19speaker or county board chair, as the case may be, shall 20declare that such vacancy exists and then notification shall 21be given to the appropriate county board district committee of 22each established political party within 3 days of the 23occurrence of the vacancy, and the vacancy shall be filled 24within 60 days by appointment of the elected county board 25speaker or county board chair, as the case may be, with the 26advice and consent of the county board. In Champaign County   10300SB2289sam001- 3 -LRB103 28798 BMS 58594 a1while operating under the county executive form of government 2under Division 2-5 of the Counties Code, when a vacancy occurs 3in an elected county office or in the office of an elected 4member of the county board, the elected county board speaker 5or county board chair, as the case may be, shall declare that 6such vacancy exists and then notification shall be given to 7the county central committee or the appropriate county board 8district committee of each established political party within 93 days of the occurrence of the vacancy; and the vacancy shall 10be filled within 60 days by appointment of the elected county 11board speaker or county board chair, as the case may be, with 12the advice and consent of the county board. In counties in 13which forest preserve district commissioners are\r\nelected by 14districts and are not also members of the county board, 15however,\r\nvacancies in the office of forest preserve district 16commissioner shall be\r\nfilled within 60 days by appointment of 17the president of the forest preserve\r\ndistrict board of 18commissioners with the advice and consent of the forest\r\n19preserve district board of commissioners. In counties in which 20the forest\r\npreserve district president is not also a member of 21the county board, vacancies\r\nin\r\nthe office of forest preserve 22district president shall be filled within 60 days\r\nby the 23forest preserve district board of commissioners by appointing 24one of the\r\ncommissioners to serve as president.\r\nThe appointee\r\n25shall be a member of the same political party as the person he\r\n26succeeds was at the time of his election and shall be otherwise\r\n  10300SB2289sam001- 4 -LRB103 28798 BMS 58594 a1eligible to serve.\r\nThe appointee shall serve the remainder of 2the unexpired term.  However, if\r\nmore than 28 months remain in 3the term, the appointment shall be until the\r\nnext general 4election at which time the vacated office shall be\r\nfilled by 5election for the remainder of the term.  In the\r\ncase of a 6vacancy in a seat on a county board or board of county\r\n7commissioners which\r\nhas been divided into districts under 8Section 2-3003 or 2-4006.5 of\r\nthe Counties Code, the appointee 9must also be a resident of the\r\ncounty board or county 10commission district.\r\nIf a county commissioner ceases to reside 11in the district that he or\r\nshe represents, a vacancy in that 12office exists.\n13    Except as otherwise provided by county ordinance or by 14law, in\r\nany county which is a home rule unit, vacancies in 15elective\r\ncounty offices, other than the office of chief 16executive officer,\r\nand vacancies in the office of clerk of the 17circuit court in a county of\r\nless than 3,000,000 population, 18shall be filled\r\nby the county board or board of county 19commissioners.20    For any vacancy in any elective office filled under this 21Section, the appointee shall be a member of the same political 22party as the person he or she succeeds was at the time of his 23or her election and shall be otherwise eligible to serve. \n24(Source: P.A. 102-1120, eff. 1-23-23.)\n 25    Section 10. The Counties Code is amended  by changing   10300SB2289sam001- 5 -LRB103 28798 BMS 58594 a1Section 2-5009 as follows: \n\n\n2    (55 ILCS 5/2-5009)  (from Ch. 34, par. 2-5009)\n\n\n3    Sec. 2-5009. Duties and powers of county executive. Any 4county executive elected under this Division shall:\n5    (a) see that all of the orders, resolutions and 6regulations of the board\r\nare faithfully executed;\n7    (b) coordinate and direct by executive order or otherwise 8all\r\nadministrative and management functions of the county 9government except the\r\noffices of elected county officers;\n10    (b-5) control the internal operations of the county 11executive's office and procure the necessary equipment, 12materials, and services to perform the duties of that office; 13    (c) prepare and submit to the board for its approval the 14annual budget\r\nfor the county required by Division 6-1 of this 15Code;\n16    (d) appoint, with the advice and consent of the board, 17persons to serve\r\non the various boards and commissions to 18which appointments are provided by\r\nlaw to be made by the board;\n19    (d-5) make appointments to fill vacancies occurring in the 20office of an elected county officer other than the office of an 21elected member of the county board in accordance with Section 2225-11 of the Election Code in counties, other than Champaign 23County, operating under the county executive form of 24government under this Division; 25    (e) appoint, with the advice and consent of the board,   10300SB2289sam001- 6 -LRB103 28798 BMS 58594 a1persons to serve\r\non various special districts within the 2county except where appointment to\r\nserve on such districts is 3otherwise provided by law;\n4    (e-5) except as otherwise provided by law, remove or 5suspend, in the county executive's discretion and after notice 6and hearing, anyone whom the county executive has the power to 7appoint under subsection (d) or (e); 8    (f) make an annual report to the board on the affairs of 9the county, on\r\nsuch date and at such time as the board shall 10designate, and keep the board\r\nfully advised as to the 11financial condition of the county and its future\r\nfinancial 12needs;\n13    (f-5) appoint, with the advice and consent of the board, 14all department heads for any county departments; 15    (g) hire such subordinate\r\ndeputies, employees and 16appointees for the general administration of county\r\naffairs as 17considered necessary, except those deputies, employees and\r\n18appointees in the office of an elected county officer or 19county board member;\n20    (h) except as otherwise provided by law, remove or 21suspend, in the discretion of the county executive, department 22heads for a county department and\r\nanyone whom the county 23executive has the power to hire under subsection (g);\n24    (i) require reports and examine accounts, records and 25operations of all\r\ncounty administrative units;\n26    (j) supervise the care and custody of all county property   10300SB2289sam001- 7 -LRB103 28798 BMS 58594 a1including\r\ninstitutions and agencies;\n2    (k) approve or veto ordinances or resolutions pursuant to 3Section\r\n2-5010;\n4    (l) preside over board meetings; however, the county 5executive\r\nis not entitled to vote except to break a tie vote;\n6    (l-5) for a county executive of a county that has adopted 7the executive form of government on or before the effective 8date of this amendatory Act of the 96th General Assembly, if 9the County Executive is temporarily not available to preside 10over a board meeting, the County Executive shall designate a 11board member to preside over the board meeting; 12    (m) call a special meeting of the county board, by a 13written\r\nexecutive order signed by the county executive and 14upon 24 hours notice by delivery of a\r\ncopy of such order to the 15residence of each board member;\n16    (n) with the advice and consent of the county board, enter 17into\r\nintergovernmental agreements with other governmental 18units;\n19    (o) with the advice and consent of the county board, 20negotiate on\r\nbehalf of the county with governmental units and 21the private sector for the\r\npurpose of promoting economic 22growth and development;\n23    (p) at the discretion of the county executive, appoint a 24person to serve as legal counsel at\r\nan annual salary no greater\r\n25than the annual salary of the state's attorney of the county;\n26    (q) perform such other duties as shall be required of the   10300SB2289sam001- 8 -LRB103 28798 BMS 58594 a1county executive by the board.\n2(Source: P.A. 102-1120, eff. 1-23-23.)\".\n\n\n\n\n\n\n\n"
    },
    "ocd-bill/311d15bc-eb4b-45f4-bba3-22693099cc73": {
        "id": "ocd-bill/311d15bc-eb4b-45f4-bba3-22693099cc73",
        "state": "Illinois",
        "title": "LIQUOR-BEER-VARIOUS",
        "chamber": "Senate",
        "created_date": "2023-02-11",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB2216.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB2216\n\n\n\n\nSB2216 103RD GENERAL ASSEMBLY  \r\n  \r\n  103RD GENERAL ASSEMBLY\r\nState of Illinois\r\n2023 and 2024SB2216 Introduced 2/10/2023, by Sen. Cristina Castro SYNOPSIS AS INTRODUCED: \r\n 235 ILCS 5/1-3.43235 ILCS 5/5-1  from Ch. 43, par. 115235 ILCS 5/6-40 new235 ILCS 5/8-10.5\r\n     Amends the Liquor Control Act of 1934. Authorizes a class 1 brewer or class 2 brewer to obtain a beer showcase permit. Makes conforming changes. Provides that a class 3 brewer licensee who meets certain criteria may  obtain a self-distribution exemption to allow the sale of not more than 77,500 (instead of 6,200) gallons of beer from each in-state or out-of-state class 3 brewery premises, which shall not exceed 232,500 (instead of 18,600) gallons annually in the aggregate, to retail licensees and certain brewers. Provides that a class 2 brewer may transfer up to 139,500 gallons (instead of 31,000 gallons) of beer to a brew pub wholly owned and operated by the class 2 brewer.  With regard to special event retailer's licenses and special use permit licenses, provides that those licenses shall allow the licensee to sell and offer for sale, at retail, alcoholic liquors for consumption on or off the premises specified in the license (instead of for use or consumption), but not for resale in any form.  Removes a provision requiring certain brewers to file a report of their water usage. Provides that any retail licensee or licensed manufacturer with retail privileges may offer incentives to consumers for participation in a consumer loyalty and reward program.\r\n  LRB103 26981 RPS 53348 b  A BILL FOR \r\n  SB2216LRB103 26981 RPS 53348 b\r\n  1    AN ACT concerning liquor.\r\n   2    Be it enacted by the People of the State of Illinois,\r\n 3represented in the General Assembly:\r\n  \r\n  4    Section 5. The Liquor Control Act of 1934 is amended  by 5changing Sections 1-3.43, 5-1,  and 8-10.5 and by adding 6Section 6-40 as follows: 7    (235 ILCS 5/1-3.43)8    Sec. 1-3.43. Beer showcase permit license.  \"Beer showcase 9permit\" means a license for use by a class 1 brewer, class 2 10brewer, class 3 brewer, or distributor to allow for the 11transfer of beer only from an existing licensed premises of a 12class 3 brewer or distributor to a designated site for a 13specific event.\r\n14(Source: P.A. 102-442, eff. 8-20-21; revised 2-28-22.) 15    (235 ILCS 5/5-1)  (from Ch. 43, par. 115)16    Sec. 5-1. Licenses issued by the Illinois Liquor Control 17Commission\r\nshall be of the following classes:18    (a) Manufacturer's license - Class 1.\r\nDistiller, Class 2.  19Rectifier, Class 3.  Brewer, Class 4.  First Class Wine\r\n20Manufacturer,  Class 5.  Second Class Wine Manufacturer,  Class 216. First Class Winemaker, Class 7. Second Class Winemaker, 22Class 8.\r\nLimited Wine Manufacturer, Class 9. Craft Distiller,   SB2216- 2 -LRB103 26981 RPS 53348 b1Class 10. Class 1 Craft Distiller, Class 11. Class 2 Craft 2Distiller,  Class 12. Class 1 Brewer, Class 13. Class 2 Brewer, 3Class 14. Class 3 Brewer, 4    (b) Distributor's license,5    (c) Importing Distributor's license,6    (d) Retailer's license,7    (e) Special Event Retailer's license (not-for-profit),8    (f) Railroad license,9    (g) Boat license,10    (h) Non-Beverage User's license,11    (i) Wine-maker's premises license,12    (j) Airplane license,13    (k) Foreign importer's license,14    (l) Broker's license,15    (m) Non-resident dealer's\r\nlicense,16    (n) Brew Pub license,17    (o) Auction liquor license,18    (p) Caterer retailer license,19    (q) Special use permit license,20    (r) Winery shipper's license,21    (s) Craft distiller tasting permit,22    (t) Brewer warehouse permit, 23    (u) Distilling pub license, 24    (v) Craft distiller warehouse permit,25    (w)    Beer showcase permit. 26    No\r\nperson, firm, partnership, corporation, or other legal   SB2216- 3 -LRB103 26981 RPS 53348 b1business entity that is\r\nengaged in the manufacturing of wine 2may concurrently obtain and hold a\r\nwine-maker's license and a 3wine manufacturer's license.4    (a) A manufacturer's license shall allow the manufacture,\r\n5importation in bulk, storage, distribution and sale of 6alcoholic liquor\r\nto persons without the State, as may be 7permitted by law and to licensees\r\nin this State as follows:8    Class 1. A Distiller may make sales and deliveries of 9alcoholic liquor to\r\ndistillers, rectifiers, importing 10distributors, distributors and\r\nnon-beverage users and to no 11other licensees.12    Class 2. A Rectifier, who is not a distiller, as defined 13herein, may make\r\nsales and deliveries of alcoholic liquor to 14rectifiers, importing distributors,\r\ndistributors, retailers 15and non-beverage users and to no other licensees.16    Class 3. A Brewer may make sales and deliveries of beer to 17importing\r\ndistributors and distributors and may make sales as 18authorized under subsection (e) of Section 6-4 of this Act, 19including any alcoholic liquor that subsection (e) of Section 206-4 authorizes a brewer to sell in its original package only to 21a non-licensee for pick-up by a non-licensee either within the 22interior of the brewery premises or at outside of the brewery 23premises at a curb-side or parking lot adjacent to the brewery 24premises, subject to any local ordinance.25    Class 4. A first class wine-manufacturer may make sales 26and deliveries of\r\nup to 50,000 gallons of wine to   SB2216- 4 -LRB103 26981 RPS 53348 b1manufacturers,\r\nimporting\r\ndistributors and distributors, and to 2no other licensees. If a first-class wine-manufacturer 3manufactures beer, it shall also obtain and shall only be 4eligible for, in addition to any current license, a class 1 5brewer license, shall not manufacture more than 930,000 6gallons of beer per year, and shall not be a member of or 7affiliated with, directly or indirectly, a manufacturer that 8produces more than 930,000 gallons of beer per year. If the 9first-class wine-manufacturer manufactures spirits, it shall 10also obtain and shall only be eligible for, in addition to any 11current license, a class 1 craft distiller license, shall not 12manufacture more than 50,000 gallons of spirits per year, and 13shall not be a member of or affiliated with, directly or 14indirectly, a manufacturer that produces more than 50,000 15gallons of spirits per year. A first-class wine-manufacturer 16shall be permitted to sell wine manufactured at the 17first-class wine-manufacturer premises to non-licensees. 18    Class 5. A second class Wine manufacturer may make sales 19and deliveries\r\nof more than 50,000 gallons of wine to 20manufacturers, importing distributors\r\nand distributors and to 21no other licensees.22    Class 6. A first-class wine-maker's license shall allow 23the manufacture\r\nof up to 50,000 gallons of wine per year, and 24the\r\nstorage\r\nand sale of such\r\nwine to distributors in the State 25and to persons without the\r\nState, as may be permitted by law.  A 26person who, prior to June 1, 2008 (the effective date of Public   SB2216- 5 -LRB103 26981 RPS 53348 b1Act 95-634), is a holder of a first-class wine-maker's license 2and annually produces more than 25,000 gallons of its own wine 3and who distributes its wine to licensed retailers shall cease 4this practice on or before July 1, 2008 in compliance with 5Public Act 95-634. If a first-class wine-maker manufactures 6beer, it shall also obtain and shall only be eligible for, in 7addition to any current license, a class 1 brewer license, 8shall not manufacture more than 930,000 gallons of beer per 9year, and shall not be a member of or affiliated with, directly 10or indirectly, a manufacturer that produces more than 930,000 11gallons of beer per year. If the first-class wine-maker 12manufactures spirits, it shall also obtain and shall only be 13eligible for, in addition to any current license, a class 1 14craft distiller license, shall not manufacture more than 1550,000 gallons of spirits per year, and shall not be a member 16of or affiliated with, directly or indirectly, a manufacturer 17that produces more than 50,000 gallons of spirits per year. A 18first-class wine-maker holding a class 1 brewer license or a 19class 1 craft distiller license shall not be eligible for a 20wine-maker's premises license but shall be permitted to sell 21wine manufactured at the first-class wine-maker premises to 22non-licensees. 23    Class 7. A second-class wine-maker's license shall allow 24the manufacture\r\nof up to 150,000 gallons of wine per year, and\r\n25the\r\nstorage and sale of such wine\r\nto distributors in this State 26and to persons without the State, as may be\r\npermitted by law. A   SB2216- 6 -LRB103 26981 RPS 53348 b1person who, prior to June 1, 2008 (the effective date of Public 2Act 95-634), is a holder of a second-class wine-maker's 3license and annually produces more than 25,000 gallons of its 4own wine and who distributes its wine to licensed retailers 5shall cease this practice on or before July 1, 2008 in 6compliance with Public Act 95-634. If a second-class 7wine-maker manufactures beer, it shall also obtain and shall 8only be eligible for, in addition to any current license, a 9class 2 brewer license, shall not manufacture more than 103,720,000 gallons of beer per year, and shall not be a member 11of or affiliated with, directly or indirectly, a manufacturer 12that produces more than 3,720,000 gallons of beer per year. If  13a second-class wine-maker manufactures spirits, it shall also 14obtain and shall only be eligible for, in addition to any 15current license, a class 2 craft distiller license, shall not 16manufacture more than 100,000 gallons of spirits per year, and 17shall not be a member of or affiliated with, directly or 18indirectly, a manufacturer that produces more than 100,000 19gallons of spirits per year. 20    Class 8. A limited wine-manufacturer may make sales and 21deliveries not to\r\nexceed 40,000 gallons of wine per year to 22distributors, and to\r\nnon-licensees in accordance with the 23provisions of this Act.24    Class 9. A craft distiller license, which may only be held 25by a class 1 craft distiller licensee or class 2 craft 26distiller licensee but not held by both a class 1 craft   SB2216- 7 -LRB103 26981 RPS 53348 b1distiller licensee and a class 2 craft distiller licensee, 2shall grant all rights conveyed by either: (i) a class 1 craft 3distiller license if the craft distiller holds a class 1 craft 4distiller license; or (ii) a  class 2 craft distiller licensee 5if the  craft distiller holds a class 2 craft distiller 6license. 7    Class 10.   A class 1 craft distiller license, which may 8only be issued to a licensed craft distiller or licensed 9non-resident dealer,  shall allow the manufacture of up to 1050,000 gallons of spirits  per year provided that the class 1 11craft distiller licensee does not  manufacture more than a 12combined 50,000 gallons of spirits per  year and is not a member 13of or affiliated with, directly or  indirectly, a manufacturer 14that produces more than 50,000  gallons of spirits per year. If 15a class 1 craft distiller manufactures beer, it shall also 16obtain and shall only be eligible for, in addition to any 17current license, a class 1 brewer license, shall not 18manufacture more than 930,000 gallons of beer per year, and 19shall not be a member of or affiliated with, directly or 20indirectly, a manufacturer that produces more than 930,000 21gallons of beer per year. If a class 1 craft distiller 22manufactures wine, it shall also obtain and shall only be 23eligible for, in addition to any current license, a 24first-class wine-manufacturer license or a first-class 25wine-maker's license, shall not manufacture more than 50,000 26gallons of wine per year, and shall not be a member of or   SB2216- 8 -LRB103 26981 RPS 53348 b1affiliated with, directly or indirectly, a manufacturer that 2produces more than 50,000 gallons of wine per year. A class  1 3craft distiller licensee may make sales and deliveries to 4importing  distributors and distributors and to retail 5licensees in  accordance with the conditions set forth in 6paragraph (19) of subsection (a) of Section 3-12 of this Act. 7However, the aggregate amount of spirits sold to non-licensees 8and sold or delivered to retail licensees may not exceed 5,000 9gallons per year.10    A class 1 craft distiller licensee may sell up to 5,000 11gallons of such spirits to non-licensees to the extent 12permitted by any exemption approved by the State Commission 13pursuant to Section 6-4 of this Act. A class 1 craft distiller 14license holder may store such spirits at a  non-contiguous 15licensed location, but at no time shall a class 1 craft  16distiller license holder directly or indirectly produce in the  17aggregate more than 50,000 gallons of spirits per year. 18    A class 1 craft distiller licensee may hold more than one 19class 1 craft distiller's license. However, a class 1 craft 20distiller that holds more  than one class 1 craft distiller 21license shall not manufacture, in the  aggregate, more than 2250,000 gallons of spirits by distillation  per year and shall 23not sell, in the aggregate, more than 5,000 gallons of such 24spirits to non-licensees in accordance  with an exemption 25approved by the State Commission pursuant to  Section 6-4 of 26this Act.   SB2216- 9 -LRB103 26981 RPS 53348 b1    Class 11. A class 2 craft distiller license, which may 2only be issued to a licensed craft distiller or licensed 3non-resident dealer, shall allow the manufacture of up to 4100,000 gallons of spirits  per year provided that the class 2 5craft distiller licensee does not  manufacture more than a 6combined 100,000 gallons of spirits per  year and is not a 7member of or affiliated with, directly or  indirectly, a 8manufacturer that produces more than 100,000  gallons of 9spirits per year. If a class 2 craft distiller manufactures 10beer, it shall also obtain and shall only be eligible for, in 11addition to any current license, a class 2 brewer license, 12shall not manufacture more than 3,720,000 gallons of beer per 13year, and shall not be a member of or affiliated with, directly 14or indirectly, a manufacturer that produces more than 153,720,000 gallons of beer per year. If a class 2 craft 16distiller manufactures wine, it shall also obtain and shall 17only be eligible for, in addition to any current license, a 18second-class wine-maker's license, shall not manufacture more 19than 150,000 gallons of wine per year, and shall not be a 20member of or affiliated with, directly or indirectly, a 21manufacturer that produces more than 150,000 gallons of wine 22per year. A class  2 craft distiller licensee may make sales and 23deliveries to importing  distributors and distributors, but 24shall not make sales or  deliveries to any other licensee. If 25the State Commission  provides prior approval, a class 2 craft 26distiller licensee may annually  transfer up to 100,000 gallons   SB2216- 10 -LRB103 26981 RPS 53348 b1of spirits manufactured by that  class 2 craft distiller 2licensee to the premises of a licensed class 2  craft distiller 3wholly owned and operated by the same licensee.     A class 2 craft 4distiller may transfer spirits to a distilling pub wholly 5owned and operated by the class 2 craft distiller subject to 6the following limitations and restrictions: (i) the transfer 7shall    not annually exceed more than 5,000 gallons; (ii) the 8annual    amount transferred shall reduce the distilling pub's 9annual permitted production limit; (iii) all spirits 10transferred shall be subject  to Article VIII of this Act; (iv) 11a written record shall be   maintained by the distiller and 12distilling pub specifying the amount,  date of delivery, and 13receipt of the product by the distilling pub;  and (v) the 14distilling pub shall be located no farther than 80 miles  from 15the class 2 craft distiller's licensed location. 16    A class 2 craft distiller shall, prior to transferring 17spirits to a distilling pub wholly owned by the class 2 craft 18distiller, furnish a written  notice to the State Commission of 19intent to transfer spirits  setting forth the name and address 20of the distilling pub and shall  annually submit to the State 21Commission a verified report  identifying the total gallons of 22spirits transferred to the distilling  pub wholly owned by the 23class 2 craft distiller. 24    A class 2 craft  distiller license holder may store such 25spirits at a  non-contiguous licensed location, but at no time 26shall a class 2 craft  distiller license holder directly or   SB2216- 11 -LRB103 26981 RPS 53348 b1indirectly produce in the  aggregate more than 100,000 gallons 2of spirits per year. 3    Class 12. A class 1 brewer license, which may only be 4issued to a licensed brewer or licensed non-resident dealer, 5shall allow the manufacture of up to 930,000 gallons of beer 6per year provided that the class 1 brewer licensee does not 7manufacture more than a combined 930,000 gallons of beer per 8year and is not a member of or affiliated with, directly or 9indirectly, a manufacturer that produces more than 930,000 10gallons of beer per year. If a class 1 brewer manufactures 11spirits, it shall also obtain and shall only be eligible for, 12in addition to any current license, a class 1 craft distiller 13license, shall not manufacture more than 50,000 gallons of 14spirits per year, and shall not be a member of or affiliated 15with, directly or indirectly, a manufacturer that produces 16more than 50,000 gallons of spirits per year. If a class 1 17craft brewer manufactures wine, it shall also obtain and shall 18only be eligible for, in addition to any current license, a 19first-class wine-manufacturer license or a first-class 20wine-maker's license, shall not manufacture more than 50,000 21gallons of wine per year, and shall not be a member of or 22affiliated with, directly or indirectly, a manufacturer that 23produces more than 50,000 gallons of wine per year. A class 1 24brewer licensee may make sales and deliveries to importing 25distributors and distributors and to retail licensees in 26accordance with the conditions set forth in paragraph (18) of   SB2216- 12 -LRB103 26981 RPS 53348 b1subsection (a) of Section 3-12 of this Act. If the State 2Commission provides prior approval, a class 1 brewer may 3annually transfer up to 930,000 gallons of beer manufactured 4by that class 1 brewer to the premises of a licensed class 1 5brewer wholly owned and operated by the same licensee. 6    Class 13.  A class 2 brewer license, which may only be 7issued to a licensed brewer or licensed non-resident dealer, 8shall allow the manufacture of up to 3,720,000 gallons of beer 9per year provided that the class 2 brewer licensee does not 10manufacture more than a combined 3,720,000 gallons of beer per 11year and is not a member of or affiliated with, directly or 12indirectly, a manufacturer that produces more than 3,720,000 13gallons of beer per year.   If a class 2 brewer manufactures 14spirits, it shall also obtain and shall only be eligible for, 15in addition to any current license, a class 2 craft distiller 16license, shall not manufacture more than 100,000 gallons of 17spirits per year, and shall not be a member of or affiliated 18with, directly or indirectly, a manufacturer that produces 19more than 100,000 gallons of spirits per year. If a class 2 20craft distiller manufactures wine, it shall also obtain and 21shall only be eligible for, in addition to any current 22license, a second-class wine-maker's license, shall not 23manufacture more than 150,000 gallons of wine per year, and 24shall not be a member of or affiliated with, directly or 25indirectly, a manufacturer that produces more than 150,000 26gallons of wine a year. A class 2 brewer licensee may make   SB2216- 13 -LRB103 26981 RPS 53348 b1sales and deliveries to importing distributors and 2distributors, but shall not make sales or deliveries to any 3other licensee. If the State Commission provides prior 4approval, a class 2 brewer licensee may annually transfer up 5to 3,720,000 gallons of beer manufactured by that class 2 6brewer licensee to the premises of a licensed class 2 brewer 7wholly owned and operated by the same licensee.8    A class 2 brewer may transfer beer to a brew pub wholly 9owned and operated by the class 2 brewer subject to the 10following limitations and restrictions: (i)  the transfer shall 11not annually exceed more than 139,500 31,000 gallons; (ii)  the 12annual amount transferred shall reduce the brew pub's annual 13permitted production limit; (iii)  all beer transferred shall 14be subject to Article VIII of this Act; (iv)  a written record 15shall be maintained by the brewer and brew pub specifying the 16amount, date of delivery, and receipt of the product by the 17brew pub; and (v)  the brew pub shall be located no farther than 1880 miles from the class 2 brewer's licensed location. 19    A class 2 brewer shall, prior to transferring beer to a 20brew pub wholly owned by the class 2 brewer, furnish a written 21notice to the State Commission of intent to transfer beer 22setting forth the name and address of the brew pub and shall 23annually submit to the State Commission a verified report 24identifying the total gallons of beer transferred to the brew 25pub wholly owned by the class 2 brewer. 26    Class 14. A class 3 brewer license, which may be issued to   SB2216- 14 -LRB103 26981 RPS 53348 b1a brewer or a non-resident dealer, shall allow the manufacture 2of no more than 465,000 gallons of beer per year and no more 3than 155,000 gallons at a single brewery premises, and shall 4allow the sale of no more than 77,500 6,200 gallons of beer 5from each in-state or out-of-state class 3 brewery premises, 6or 232,500 18,600 gallons in the aggregate, to retail 7licensees, class 1 brewers, class 2 brewers, and class 3 8brewers as long as the class 3 brewer licensee does not 9manufacture more than a combined 465,000 gallons of beer per 10year and is not a member of or affiliated with, directly or 11indirectly, a manufacturer that produces more than 465,000 12gallons of beer per year to make sales to importing 13distributors, distributors, retail licensees, brewers, class 1 14brewers, class 2 brewers, and class 3 brewers in accordance 15with the conditions set forth in paragraph (20) of subsection 16(a) of Section 3-12. If the State Commission provides prior 17approval, a class 3 brewer may annually transfer up to 155,000 18gallons of beer manufactured by that class 3 brewer to the 19premises of a licensed class 3 brewer wholly owned and 20operated by the same licensee. A class 3 brewer shall 21manufacture beer at the brewer's class 3 designated licensed 22premises, and may sell beer as otherwise provided in this Act. 23    (a-1) A manufacturer which is licensed in this State to 24make sales or\r\ndeliveries of alcoholic liquor to licensed 25distributors or importing distributors and which enlists 26agents, representatives, or\r\nindividuals acting on its behalf   SB2216- 15 -LRB103 26981 RPS 53348 b1who contact licensed retailers on a regular\r\nand continual 2basis in this State must register those agents, 3representatives,\r\nor persons acting on its behalf with the 4State Commission.5    Registration of agents, representatives, or persons acting 6on behalf of a\r\nmanufacturer is fulfilled by submitting a form 7to the Commission.  The form\r\nshall be developed by the 8Commission and shall include the name and address of\r\nthe 9applicant, the name and address of the manufacturer he or she 10represents,\r\nthe territory or areas assigned to sell to or 11discuss pricing terms of\r\nalcoholic liquor, and any other 12questions deemed appropriate and necessary.\r\nAll statements in 13the forms required to be made by law or by rule shall be\r\ndeemed 14material, and any person who knowingly misstates any material 15fact under\r\noath in an application is guilty of a Class B 16misdemeanor.  Fraud,\r\nmisrepresentation, false statements, 17misleading statements, evasions, or\r\nsuppression of material 18facts in the securing of a registration are grounds for\r\n19suspension or revocation of the registration. The State 20Commission shall post a list of registered agents on the 21Commission's website.22    (b) A distributor's license shall allow (i) the wholesale 23purchase and storage\r\nof alcoholic liquors and sale of 24alcoholic liquors to licensees in this State and to persons 25without the State, as may be permitted by law; (ii) the sale of 26beer, cider, mead, or any combination thereof to brewers,   SB2216- 16 -LRB103 26981 RPS 53348 b1class 1 brewers, and class 2 brewers that, pursuant to 2subsection (e) of Section 6-4 of this Act, sell beer, cider, 3mead, or any combination thereof to non-licensees at their 4breweries; (iii) the sale of vermouth to class 1 craft 5distillers and class 2 craft distillers that, pursuant to 6subsection (e) of Section 6-4 of this Act, sell spirits, 7vermouth, or both spirits and vermouth to non-licensees at 8their distilleries; or (iv) as otherwise provided in this Act. 9No person licensed as a distributor shall be granted a 10non-resident dealer's license.11    (c) An importing distributor's license may be issued to 12and held by\r\nthose only who are duly licensed distributors, 13upon the filing of an\r\napplication by a duly licensed 14distributor, with the Commission and\r\nthe Commission shall, 15without the\r\npayment of any fee, immediately issue such 16importing distributor's\r\nlicense to the applicant, which shall 17allow the importation of alcoholic\r\nliquor by the licensee into 18this State from any point in the United\r\nStates outside this 19State, and the purchase of alcoholic liquor in\r\nbarrels, casks 20or other bulk containers and the bottling of such\r\nalcoholic 21liquors before resale thereof, but all bottles or containers\r\n22so filled shall be sealed, labeled, stamped and otherwise made 23to comply\r\nwith all provisions, rules and regulations governing 24manufacturers in\r\nthe preparation and bottling of alcoholic 25liquors.  The importing\r\ndistributor's license shall permit such 26licensee to purchase alcoholic\r\nliquor from Illinois licensed   SB2216- 17 -LRB103 26981 RPS 53348 b1non-resident dealers and foreign importers only. No person 2licensed as an importing distributor shall be granted a 3non-resident dealer's license.4    (d) A retailer's license shall allow the licensee to sell 5and offer\r\nfor sale at retail, only in the premises specified in 6the license,\r\nalcoholic liquor for use or consumption, but not 7for resale in any form. Except as provided in Section 6-16, 86-29, or 6-29.1, nothing in this Act shall deny, limit, 9remove, or restrict the ability of a holder of a retailer's 10license to transfer or ship alcoholic liquor to the purchaser 11for use or consumption subject to any applicable local law or 12ordinance. For the purposes of this Section, \"shipping\" means 13the movement of alcoholic liquor from a licensed retailer to a 14consumer via a common carrier. Except as provided in Section 156-16, 6-29, or 6-29.1, nothing in this Act shall deny, limit, 16remove, or restrict the ability of a holder of a retailer's 17license to deliver alcoholic liquor to the purchaser for use 18or consumption. The delivery shall be made only within 12 19hours from the time the alcoholic liquor leaves the licensed 20premises of the retailer for delivery. For the purposes of 21this Section, \"delivery\" means the movement of alcoholic 22liquor purchased from a licensed retailer to a consumer 23through the following methods:24        (1) delivery within licensed retailer's parking lot, 25    including curbside, for pickup by the consumer;26        (2) delivery by an owner, officer, director,   SB2216- 18 -LRB103 26981 RPS 53348 b1    shareholder, or employee of the licensed retailer; or2        (3) delivery by a third-party contractor, independent 3    contractor, or agent with whom the licensed retailer has 4    contracted to make deliveries of alcoholic liquors. 5    Under subsection (1), (2), or (3), delivery shall not 6include the use of common carriers. 7    Any retail license issued to a manufacturer shall only\r\n8permit the manufacturer to sell beer at retail on the premises 9actually\r\noccupied by the manufacturer. For the purpose of 10further describing the type of business conducted at a retail 11licensed premises, a  retailer's licensee may be designated by 12the State Commission as (i) an on premise consumption 13retailer, (ii) an off premise sale retailer, or (iii) a 14combined on premise consumption and off premise sale retailer.\r\n15    Except for a municipality with a population of more than 161,000,000 inhabitants, a home rule unit may not regulate the 17delivery of alcoholic liquor inconsistent with this 18subsection.  This paragraph is a limitation under subsection 19(i) of Section 6 of Article VII of the Illinois Constitution on 20the concurrent exercise by home rule units of powers and 21functions exercised by the State. 22    Notwithstanding any other provision of this subsection 23(d), a retail\r\nlicensee may sell alcoholic liquors to a special 24event retailer licensee for\r\nresale to the extent permitted 25under subsection (e).26    (e) A special event retailer's license (not-for-profit)   SB2216- 19 -LRB103 26981 RPS 53348 b1shall permit the\r\nlicensee to purchase alcoholic liquors from 2an Illinois licensed  distributor\r\n(unless the licensee 3purchases less than $500 of alcoholic liquors for the\r\nspecial 4event, in which case the licensee may purchase the alcoholic 5liquors\r\nfrom a licensed retailer) and shall allow the licensee 6to sell and offer for\r\nsale, at retail, alcoholic liquors for 7consumption on or off the premises specified in the license 8use or consumption, but not for resale\r\nin any form and only at 9the location and on the specific dates designated for\r\nthe 10special event in the license.  An applicant for a special event 11retailer\r\nlicense must\r\n(i) furnish with the application:  (A) a 12resale number issued under Section\r\n2c of the Retailers' 13Occupation Tax Act or evidence that the applicant is\r\n14registered under Section 2a of the Retailers' Occupation Tax 15Act, (B) a\r\ncurrent, valid exemption identification\r\nnumber 16issued under Section 1g of the Retailers' Occupation Tax Act, 17and a\r\ncertification to the Commission that the purchase of 18alcoholic liquors will be\r\na tax-exempt purchase, or (C) a 19statement that the applicant is not registered\r\nunder Section 202a of the Retailers' Occupation Tax Act, does not hold a resale\r\n21number under Section 2c of the Retailers' Occupation Tax Act, 22and does not\r\nhold an exemption number under Section 1g of the 23Retailers' Occupation Tax\r\nAct, in which event the Commission 24shall set forth on the special event\r\nretailer's license a 25statement to that effect; (ii) submit with the application 26proof satisfactory to\r\nthe State Commission that the applicant   SB2216- 20 -LRB103 26981 RPS 53348 b1will provide dram shop liability\r\ninsurance in the maximum 2limits; and (iii) show proof satisfactory to the\r\nState 3Commission that the applicant has obtained local authority\r\n4approval.5    Nothing in this Act prohibits an Illinois licensed 6distributor from offering credit or a refund for unused, 7salable alcoholic liquors to a holder of a special event 8retailer's license or the special event retailer's licensee 9from accepting the credit or refund of alcoholic liquors at 10the conclusion of the event specified in the license.11    (f) A railroad license shall permit the licensee to import 12alcoholic\r\nliquors into this State from any point in the United 13States outside this\r\nState and to store such alcoholic liquors 14in this State; to make wholesale\r\npurchases of alcoholic 15liquors directly from manufacturers, foreign\r\nimporters, 16distributors and importing distributors from within or outside\r\n17this State; and to store such alcoholic liquors in this State; 18provided\r\nthat the above powers may be exercised only in 19connection with the\r\nimportation, purchase or storage of 20alcoholic liquors to be sold or\r\ndispensed on a club, buffet, 21lounge or dining car operated on an electric,\r\ngas or steam 22railway in this State; and provided further, that railroad\r\n23licensees exercising the above powers shall be subject to all 24provisions of\r\nArticle VIII of this Act as applied to importing 25distributors.  A railroad\r\nlicense shall also permit the 26licensee to sell or dispense alcoholic\r\nliquors on any club,   SB2216- 21 -LRB103 26981 RPS 53348 b1buffet, lounge or dining car operated on an electric,\r\ngas or 2steam railway regularly operated by a common carrier in this 3State,\r\nbut shall not permit the sale for resale of any 4alcoholic liquors to any\r\nlicensee within this State.  A license 5shall be obtained for each car in which\r\nsuch sales are made.6    (g) A boat license shall allow the sale of alcoholic 7liquor in\r\nindividual drinks, on any passenger boat regularly 8operated as a common\r\ncarrier on navigable waters in this State 9or on any riverboat operated\r\nunder\r\nthe Illinois Gambling Act, 10which boat or riverboat maintains a public\r\ndining room or 11restaurant thereon.12    (h) A non-beverage user's license shall allow the licensee 13to\r\npurchase alcoholic liquor from a licensed manufacturer or 14importing\r\ndistributor, without the imposition of any tax upon 15the business of such\r\nlicensed manufacturer or importing 16distributor as to such alcoholic\r\nliquor to be used by such 17licensee solely for the non-beverage purposes\r\nset forth in 18subsection (a) of Section 8-1 of this Act, and\r\nsuch licenses 19shall be divided and classified and shall permit the\r\npurchase, 20possession and use of limited and stated quantities of\r\n21alcoholic liquor as follows:22Class 1, not to exceed ......................... 500 gallons\r\n23Class 2, not to exceed ....................... 1,000 gallons\r\n24Class 3, not to exceed ....................... 5,000 gallons\r\n25Class 4, not to exceed ...................... 10,000 gallons\r\n26Class 5, not to exceed ....................... 50,000 gallons  SB2216- 22 -LRB103 26981 RPS 53348 b1    (i) A wine-maker's premises license shall allow a\r\nlicensee 2that concurrently holds a first-class wine-maker's license to 3sell\r\nand offer for sale at retail in the premises specified in 4such license\r\nnot more than 50,000 gallons of the first-class 5wine-maker's wine that is\r\nmade at the first-class wine-maker's 6licensed premises per year for use or\r\nconsumption, but not for 7resale in any form.  A wine-maker's premises\r\nlicense shall 8allow a licensee who concurrently holds a second-class\r\n9wine-maker's license to sell and offer for sale at retail in 10the premises\r\nspecified in such license up to 100,000 gallons 11of the\r\nsecond-class wine-maker's wine that is made at the 12second-class wine-maker's\r\nlicensed premises per year\r\nfor use 13or consumption but not for resale in any form. A first-class 14wine-maker that concurrently holds a class 1 brewer license or 15a class 1 craft distiller license shall not be eligible to hold 16a wine-maker's premises license.  A wine-maker's premises 17license shall allow a\r\nlicensee that concurrently holds a 18first-class wine-maker's license or a second-class\r\n19wine-maker's license to sell\r\nand offer for sale at retail at 20the premises specified in the wine-maker's premises license, 21for use or consumption but not for resale in any form,  any 22beer, wine, and spirits purchased from a licensed distributor. 23Upon approval from the\r\nState Commission, a wine-maker's 24premises license\r\nshall allow the licensee to sell and offer 25for sale at (i) the wine-maker's\r\nlicensed premises and (ii) at 26up to 2 additional locations for use and\r\nconsumption and not   SB2216- 23 -LRB103 26981 RPS 53348 b1for resale.  Each location shall require additional\r\nlicensing 2per location as specified in Section 5-3 of this Act. A 3wine-maker's premises licensee shall\r\nsecure liquor liability 4insurance coverage in an amount at\r\nleast equal to the maximum 5liability amounts set forth in\r\nsubsection (a) of Section 6-21 6of this Act.\r\n7    (j) An airplane license shall permit the licensee to 8import\r\nalcoholic liquors into this State from any point in the 9United States\r\noutside this State and to store such alcoholic 10liquors in this State; to\r\nmake wholesale purchases of 11alcoholic liquors directly from\r\nmanufacturers, foreign 12importers, distributors and importing\r\ndistributors from within 13or outside this State; and to store such\r\nalcoholic liquors in 14this State; provided that the above powers may be\r\nexercised 15only in connection with the importation, purchase or storage\r\n16of alcoholic liquors to be sold or dispensed on an airplane; 17and\r\nprovided further, that airplane licensees exercising the 18above powers\r\nshall be subject to all provisions of Article 19VIII of this Act as\r\napplied to importing distributors.  An 20airplane licensee shall also\r\npermit the sale or dispensing of 21alcoholic liquors on any passenger\r\nairplane regularly operated 22by a common carrier in this State, but shall\r\nnot permit the 23sale for resale of any alcoholic liquors to any licensee\r\n24within this State.  A single airplane license shall be required 25of an\r\nairline company if liquor service is provided on board 26aircraft in this\r\nState.  The annual fee for such license shall   SB2216- 24 -LRB103 26981 RPS 53348 b1be as determined in\r\nSection 5-3.2    (k) A foreign importer's license shall permit such 3licensee to purchase\r\nalcoholic liquor from Illinois licensed 4non-resident dealers only, and to\r\nimport alcoholic liquor 5other than in bulk from any point outside the\r\nUnited States and 6to sell such alcoholic liquor to Illinois licensed\r\nimporting 7distributors and to no one else in Illinois;\r\n provided that (i) 8the foreign importer registers with the State Commission\r\nevery\r\n9brand of\r\nalcoholic liquor that it proposes to sell to Illinois 10licensees during the\r\nlicense period, (ii)  the foreign importer 11complies with all of the provisions\r\nof Section\r\n6-9 of this Act 12with respect to registration of such Illinois licensees as may\r\n13be granted the\r\nright to sell such brands at wholesale,  and 14(iii) the foreign importer complies with the provisions of 15Sections 6-5 and 6-6 of this Act to the same extent that these 16provisions apply to manufacturers.17    (l) (i) A broker's license shall be required of all 18persons\r\nwho solicit\r\norders for, offer to sell or offer to 19supply alcoholic liquor to\r\nretailers in the State of Illinois, 20or who offer to retailers to ship or\r\ncause to be shipped or to 21make contact with distillers, craft distillers, rectifiers,\r\n22brewers or manufacturers or any other party within or without 23the State\r\nof Illinois in order that alcoholic liquors be 24shipped to a distributor,\r\nimporting distributor or foreign 25importer, whether such solicitation or\r\noffer is consummated 26within or without the State of Illinois.  SB2216- 25 -LRB103 26981 RPS 53348 b1    No holder of a retailer's license issued by the Illinois 2Liquor\r\nControl Commission shall purchase or receive any 3alcoholic liquor, the\r\norder for which was solicited or offered 4for sale to such retailer by a\r\nbroker unless the broker is the 5holder of a valid broker's license.6    The broker shall, upon the acceptance by a retailer of the 7broker's\r\nsolicitation of an order or offer to sell or supply or 8deliver or have\r\ndelivered alcoholic liquors, promptly forward 9to the Illinois Liquor\r\nControl Commission a notification of 10said transaction in such form as\r\nthe Commission may by 11regulations prescribe.12    (ii) A broker's license shall be required of\r\na person 13within this State, other than a retail licensee,\r\nwho, for a fee 14or commission, promotes, solicits, or accepts orders for\r\n15alcoholic liquor, for use or consumption and not for\r\nresale, 16to be shipped from this State and delivered to residents 17outside of\r\nthis State by an express company, common carrier, 18or contract carrier.\r\nThis Section does not apply to any person 19who promotes, solicits, or accepts\r\norders for wine as 20specifically authorized in Section 6-29 of this Act.21    A broker's license under this subsection (l)\r\n shall not 22entitle the holder to\r\nbuy or sell any\r\nalcoholic liquors for his 23own account or to take or deliver title to\r\nsuch alcoholic 24liquors.25    This subsection (l)\r\n shall not apply to distributors, 26employees of\r\ndistributors, or employees of a manufacturer who   SB2216- 26 -LRB103 26981 RPS 53348 b1has registered the\r\ntrademark, brand or name of the alcoholic 2liquor pursuant to Section 6-9\r\nof this Act, and who regularly 3sells such alcoholic liquor\r\nin the State of Illinois only to 4its registrants thereunder.5    Any agent, representative, or person subject to 6registration pursuant to\r\nsubsection (a-1) of this Section 7shall not be eligible to receive a broker's\r\nlicense.8    (m) A non-resident dealer's license shall permit such 9licensee to ship\r\ninto and warehouse alcoholic liquor into this 10State from any point\r\noutside of this State, and to sell such 11alcoholic liquor to Illinois licensed\r\nforeign importers and 12importing distributors and to no one else in this State;\r\n13provided that (i) said non-resident dealer shall register with 14the Illinois Liquor\r\nControl Commission each and every brand of 15alcoholic liquor which it proposes\r\nto sell to Illinois 16licensees during the license period, (ii)  it shall comply with 17all of the provisions of Section 6-9 hereof with\r\nrespect to 18registration of such Illinois licensees as may be granted the 19right\r\nto sell such brands at wholesale by duly filing such 20registration statement, thereby authorizing the non-resident 21dealer to proceed to sell such brands at wholesale, and (iii) 22the non-resident dealer shall comply with the provisions of 23Sections 6-5 and 6-6 of this Act to the same extent that these 24provisions apply to manufacturers. No person licensed as a 25non-resident dealer shall be granted a distributor's or 26importing distributor's license.  SB2216- 27 -LRB103 26981 RPS 53348 b1    (n) A brew pub license shall allow the licensee to only (i) 2manufacture up to 155,000 gallons of beer per year only\r\non the 3premises specified in the license, (ii) make sales of the\r\nbeer 4manufactured on the premises or, with the approval of the 5Commission, beer manufactured on another brew pub licensed 6premises that is wholly owned and operated by the same 7licensee to importing distributors, distributors,\r\nand to 8non-licensees for use and consumption, (iii) store the beer 9upon\r\nthe premises, (iv) sell and offer for sale at retail from 10the licensed\r\npremises for off-premises\r\nconsumption no more 11than 155,000 gallons per year so long as such sales are only 12made in-person, (v) sell and offer for sale at retail for use 13and consumption on the premises specified in the license any 14form of alcoholic liquor purchased from a licensed distributor 15or importing distributor, (vi) with the prior approval of the 16Commission, annually transfer no more than 155,000 gallons of 17beer manufactured on the premises to a licensed brew pub 18wholly owned and operated by the same licensee, and (vii) 19notwithstanding item (i) of this subsection, brew pubs wholly 20owned and operated by the same licensee may combine each 21location's production limit of 155,000 gallons of beer per 22year and allocate the aggregate total between the wholly 23owned, operated, and licensed locations.24    A brew pub licensee shall not under any circumstance sell 25or offer for sale beer manufactured by the brew pub licensee to 26retail licensees.   SB2216- 28 -LRB103 26981 RPS 53348 b1    A person who holds a class 2 brewer license may 2simultaneously hold a brew pub license if the class 2 brewer 3(i) does not, under any circumstance, sell or offer for sale 4beer manufactured by the class 2 brewer to retail licensees; 5(ii) does not hold more than 3 brew pub licenses in this State; 6(iii) does not manufacture more than a combined 3,720,000 7gallons of beer per year, including the beer manufactured at 8the brew pub; and (iv) is not a member of or affiliated with, 9directly or indirectly,  a manufacturer that produces more than 103,720,000 gallons of beer per year or any other alcoholic 11liquor.12    Notwithstanding any other provision of this Act, a 13licensed brewer, class 2 brewer, or non-resident dealer who 14before July 1, 2015 manufactured less than 3,720,000 gallons 15of beer per year and held a brew pub license on or before July 161, 2015 may (i) continue to qualify for and hold that brew pub 17license for the licensed premises and (ii) manufacture more 18than 3,720,000 gallons of beer per year and continue to 19qualify for and hold that brew pub license if that brewer, 20class 2 brewer, or non-resident dealer does not simultaneously 21hold a class 1 brewer license and is not a member of or 22affiliated with, directly or indirectly,  a manufacturer that 23produces more than 3,720,000 gallons of beer per year or that 24produces any other alcoholic liquor. 25    A brew pub licensee may apply for a class 3 brewer license 26and, upon: (i) meeting all applicable qualifications of this   SB2216- 29 -LRB103 26981 RPS 53348 b1Act, and relinquishing all commonly owned brew pub or retail 2licenses, shall be issued a class 3 brewer license.  Nothing in 3this Act shall prohibit the issuance of a class 3 brewer 4license if the applicant:5        (1) has a valid retail license on or before May 1, 6    2021;7        (2) has an ownership interest in at least two brew 8    pubs licenses on or before May 1, 2021;9        (3) the brew pub licensee applies for a class 3 brewer 10    license on or before October 1, 2022 and relinquishes all 11    commonly owned brew pub licenses; and12        (4) relinquishes all commonly owned retail licenses on 13    or before December 31, 2022.14    If a brew pub licensee is issued a class 3 brewer license, 15the class 3 brewer license shall expire on the same date as the 16existing brew pub license and the State Commission shall not 17require a class 3 brewer licensee to obtain a brewer license, 18or in the alternative to pay a fee for a brewer license, until 19the date the brew pub license of the applicant would have 20expired. 21    (o) A caterer retailer license shall allow the holder\r\nto 22serve alcoholic liquors as an incidental part of a food 23service that serves\r\nprepared meals which excludes the serving 24of snacks as\r\nthe primary meal, either on or off-site whether 25licensed or unlicensed. A caterer retailer license shall allow 26the holder, a distributor, or an importing distributor to   SB2216- 30 -LRB103 26981 RPS 53348 b1transfer any inventory to and from the holder's retail 2premises and shall allow the holder to purchase alcoholic 3liquor from a distributor or importing distributor to be 4delivered directly to an off-site event.5    Nothing in this Act prohibits a  distributor or importing 6distributor from offering credit or a refund for unused, 7salable beer to a holder of a caterer retailer license or a 8caterer retailer licensee from accepting a credit or refund 9for unused, salable beer, in the event an act of God is the 10sole reason an off-site event is cancelled and if: (i) the 11holder of a caterer retailer license has not transferred 12alcoholic liquor from its caterer retailer premises to an 13off-site location; (ii) the distributor or importing 14distributor offers the credit or refund for the unused, 15salable beer that it delivered to the off-site premises and 16not for any unused, salable beer that the distributor or 17importing distributor delivered to the caterer retailer's 18premises; and (iii) the unused, salable beer would likely 19spoil if transferred to the caterer retailer's premises.  A 20caterer retailer license shall allow the holder to transfer 21any inventory from any off-site location to its caterer 22retailer premises at the conclusion of an off-site event or 23engage a distributor or importing distributor to transfer any 24inventory from any off-site location to its caterer retailer 25premises at the conclusion of an off-site event, provided that 26the distributor or importing distributor issues bona fide   SB2216- 31 -LRB103 26981 RPS 53348 b1charges to the caterer retailer licensee for fuel, labor, and 2delivery and the distributor or importing distributor collects 3payment from the caterer retailer licensee prior to the 4distributor or importing distributor transferring inventory to 5the caterer retailer premises.6    For purposes of this subsection (o), an \"act of God\" means 7an unforeseeable event, such as a rain or snow storm, hail, a 8flood, or a similar event, that is the sole cause of the 9cancellation of an off-site, outdoor event.10    (p) An auction liquor license shall allow the licensee to 11sell and offer\r\nfor sale at auction wine and spirits for use or 12consumption, or for resale by\r\nan Illinois liquor licensee in 13accordance with provisions of this Act.  An\r\nauction liquor 14license will be issued to a person and it will permit the\r\n15auction liquor licensee to hold the auction anywhere in the 16State.  An auction\r\nliquor license must be obtained for each 17auction at least 14 days in advance of\r\nthe auction date.18    (q) A special use permit license shall allow an Illinois 19licensed\r\nretailer to transfer a portion of its alcoholic 20liquor inventory from its\r\nretail licensed premises to the 21premises specified in the license hereby\r\ncreated; to purchase 22alcoholic liquor from a distributor or importing distributor 23to be delivered directly to the location specified in the 24license hereby created; and to sell or offer for sale at 25retail, only in the premises\r\nspecified in the license hereby 26created, the transferred or delivered alcoholic liquor for\r\n  SB2216- 32 -LRB103 26981 RPS 53348 b1consumption on or off the premises specified in the license 2use or consumption, but not for resale in any form.  A special 3use permit\r\nlicense may be granted for the following time 4periods: one day or less; 2 or\r\nmore days to a maximum of 15 5days per location in any 12-month period.  An\r\napplicant for the 6special use permit license must also submit with the\r\n7application proof satisfactory to the State Commission that 8the applicant will\r\nprovide dram shop liability insurance to 9the maximum limits and have local\r\nauthority approval.10    A special use permit license shall allow the holder to 11transfer any inventory from the holder's special use premises 12to its retail premises at the conclusion of the special use 13event or engage a distributor or importing distributor to 14transfer any inventory from the holder's special use premises 15to its retail premises at the conclusion of an off-site event, 16provided that the distributor or importing distributor issues 17bona fide charges to the special use permit licensee for fuel, 18labor, and delivery and the distributor or importing 19distributor collects payment from the retail licensee prior to 20the distributor or importing distributor transferring 21inventory to the retail premises.22    Nothing in this Act prohibits a distributor or importing 23distributor from offering credit or a refund for unused, 24salable beer to a special use permit licensee or a special use 25permit licensee from accepting a credit or refund for unused, 26salable beer at the conclusion of the event specified in the   SB2216- 33 -LRB103 26981 RPS 53348 b1license if: (i) the holder of the special use permit license 2has not transferred alcoholic liquor from its retail licensed 3premises to the premises specified in the special use permit 4license; (ii) the distributor or importing distributor offers 5the credit or refund for the unused, salable beer that it 6delivered to the premises specified in the special use permit 7license and not for any unused, salable beer that the 8distributor or importing distributor delivered to the 9retailer's premises; and (iii) the unused, salable beer would 10likely spoil if transferred to the retailer premises.11    (r) A winery shipper's license shall allow a person\r\nwith a 12first-class or second-class wine manufacturer's\r\nlicense, a 13first-class or second-class wine-maker's license,\r\nor a limited 14wine manufacturer's license or who is licensed to\r\nmake wine 15under the laws of another state to ship wine\r\nmade by that 16licensee directly to a resident of this\r\nState who is 21 years 17of age or older for that resident's\r\npersonal use and not for 18resale. Prior to receiving a\r\nwinery shipper's license, an 19applicant for the license must\r\nprovide the Commission with a 20true copy of its current\r\nlicense in any state in which it is 21licensed as a manufacturer\r\nof wine. An applicant for a winery 22shipper's license must\r\nalso complete an application form that 23provides any other\r\ninformation the Commission deems necessary.  24The application form shall include all addresses from which 25the applicant for a winery shipper's license intends to ship 26wine, including the name and address of any third party,   SB2216- 34 -LRB103 26981 RPS 53348 b1except for a common carrier, authorized to ship wine on behalf 2of the manufacturer. The\r\napplication form shall include an 3acknowledgement consenting\r\nto the jurisdiction of the 4Commission, the Illinois\r\nDepartment of Revenue, and the courts 5of this State concerning\r\nthe enforcement of this Act and any 6related laws, rules, and\r\nregulations, including authorizing 7the Department of Revenue\r\nand the Commission to conduct audits 8for the purpose of\r\nensuring compliance with Public Act 95-634, 9and an acknowledgement that the wine manufacturer is in 10compliance with Section 6-2 of this Act. Any third party, 11except for a common carrier, authorized to ship wine on behalf 12of a first-class or second-class wine manufacturer's licensee, 13a first-class or second-class wine-maker's licensee, a limited 14wine manufacturer's licensee, or a person who is licensed to 15make wine under the laws of another state shall also be 16disclosed by the winery shipper's licensee, and a copy of the 17written appointment of the third-party wine provider, except 18for a common carrier, to the wine manufacturer shall be filed 19with the State Commission as a supplement to the winery 20shipper's license application or any renewal thereof.  The 21winery shipper's license holder shall affirm under penalty of 22perjury, as part of the winery shipper's license application 23or renewal, that he or she only ships wine, either directly or 24indirectly through a third-party provider, from the licensee's 25own production.26    Except for a common carrier, a third-party provider   SB2216- 35 -LRB103 26981 RPS 53348 b1shipping wine on behalf of a winery shipper's license holder 2is the agent of the winery shipper's license holder and, as 3such, a winery shipper's license holder is responsible for the 4acts and omissions of the third-party provider acting on 5behalf of the license holder.  A third-party provider, except 6for a common carrier, that engages in shipping wine into 7Illinois on behalf of a winery shipper's license holder shall 8consent to the jurisdiction of the State Commission and the 9State.  Any third-party, except for a common carrier, holding 10such an appointment shall, by February 1 of each calendar year 11and upon request by the State Commission or the Department of 12Revenue, file with the State Commission a statement detailing 13each shipment made to an Illinois resident. The statement 14shall include the name and address of the third-party provider 15filing the statement, the time period covered by the 16statement, and the following information:  17        (1) the name, address, and license number of the 18    winery shipper on whose behalf the shipment was made;19        (2) the quantity of the products delivered; and20        (3) the date and address of the shipment. 21If the Department of Revenue or the State Commission requests 22a statement under this paragraph, the third-party provider 23must  provide that statement no later than 30 days after the 24request is made. Any books, records, supporting papers, and 25documents containing information and data relating to a 26statement under this paragraph shall be kept and preserved for   SB2216- 36 -LRB103 26981 RPS 53348 b1a period of 3 years, unless their destruction sooner is 2authorized, in writing, by the Director of Revenue, and shall 3be open and available to inspection by the Director of Revenue 4or the State Commission or any duly authorized officer, agent, 5or employee of the State Commission or the Department of 6Revenue, at all times during business hours of the day. Any 7person who violates any provision of this paragraph or any 8rule of the State Commission for the administration and 9enforcement of the provisions of this paragraph is guilty of a 10Class C misdemeanor. In case of a continuing violation, each 11day's continuance thereof shall be a separate and distinct 12offense. 13    The State Commission shall adopt rules as soon as 14practicable to implement the requirements of Public Act 99-904 15and shall adopt rules prohibiting any such third-party 16appointment of a third-party provider, except for a common 17carrier, that has been deemed by the State Commission to have 18violated the provisions of this Act with regard to any winery 19shipper licensee.20    A winery shipper licensee must pay to the Department\r\nof 21Revenue the State liquor gallonage tax under Section 8-1 for\r\n22all wine that is sold by the licensee and shipped to a person\r\n23in this State. For the purposes of Section 8-1, a winery\r\n24shipper licensee shall be taxed in the same manner as a\r\n25manufacturer of wine. A licensee who is not otherwise required 26to register under the Retailers' Occupation Tax Act must\r\n  SB2216- 37 -LRB103 26981 RPS 53348 b1register under the Use Tax Act to collect and remit use tax to\r\n2the Department of Revenue for all gallons of wine that are sold\r\n3by the licensee and shipped to persons in this State. If a\r\n4licensee fails to remit the tax imposed under this Act in\r\n5accordance with the provisions of Article VIII of this Act, 6the\r\nwinery shipper's license shall be revoked in accordance\r\n7with the provisions of Article VII of this Act. If a licensee\r\n8fails to properly register and remit tax under the Use Tax Act\r\n9or the Retailers' Occupation Tax Act for all wine that is sold\r\n10by the winery shipper and shipped to persons in this\r\nState, the 11winery shipper's license shall be revoked in\r\naccordance with 12the provisions of Article VII of this Act.13    A winery shipper licensee must collect, maintain, and\r\n14submit to the Commission on a semi-annual basis the\r\ntotal 15number of cases per resident of wine shipped to residents\r\nof 16this State.\r\n    A winery shipper licensed under this subsection 17(r)\r\nmust comply with the requirements of Section 6-29 of this 18Act.19    Pursuant to paragraph (5.1) or (5.3) of subsection (a) of 20Section 3-12, the State Commission may receive, respond to, 21and investigate any complaint and impose any of the remedies 22specified in paragraph (1) of subsection (a) of Section 3-12.23    As used in this subsection, \"third-party provider\" means 24any entity that provides fulfillment house services, including 25warehousing, packaging, distribution, order processing, or 26shipment of wine, but not the sale of wine, on behalf of a   SB2216- 38 -LRB103 26981 RPS 53348 b1licensed winery shipper. 2    (s) A craft distiller tasting permit license shall allow 3an Illinois licensed class 1 craft distiller or class 2 craft 4distiller to transfer a portion of its alcoholic liquor 5inventory from its class 1 craft distiller or class 2 craft 6distiller licensed premises to the premises specified in the 7license hereby created and to conduct a sampling, only in the 8premises specified in the license hereby created, of the 9transferred alcoholic liquor in accordance with subsection (c) 10of Section 6-31 of this Act. The transferred alcoholic liquor 11may not be sold or resold in any form.  An applicant for the 12craft distiller tasting permit license must also submit with 13the application proof satisfactory to the State Commission 14that the applicant will provide dram shop liability insurance 15to the maximum limits and have local authority approval.16    (t) A brewer warehouse permit may be issued to the holder 17of a class 1 brewer license or a class 2 brewer license. If the 18holder of the permit is a class 1 brewer licensee, the brewer 19warehouse permit shall allow the holder to store or warehouse 20up to 930,000 gallons of tax-determined beer manufactured by 21the holder of the permit at the premises specified on the 22permit. If the holder of the permit is a class 2 brewer 23licensee, the brewer warehouse permit shall allow the holder 24to store or warehouse up to 3,720,000 gallons of 25tax-determined beer manufactured by the holder of the permit 26at the premises specified on the permit. Sales to   SB2216- 39 -LRB103 26981 RPS 53348 b1non-licensees are prohibited at the premises specified in the 2brewer warehouse permit. 3    (u) A distilling pub license shall allow the licensee to 4only (i) manufacture up to 5,000 gallons of spirits per year  5only on the premises specified in the license, (ii) make sales  6of the spirits manufactured on the premises or, with the  7approval of the State Commission, spirits manufactured on 8another distilling pub licensed premises that is wholly owned   9and operated by the same licensee to importing distributors 10and  distributors and to non-licensees for use and consumption,  11(iii) store the spirits upon the premises, (iv) sell and offer  12for sale at retail from the licensed premises for off-premises  13consumption no more than 5,000 gallons per year so long as such 14sales are only made in-person, (v) sell and offer for sale at 15retail for use and consumption on the premises specified in 16the  license any form of alcoholic liquor purchased from a 17licensed  distributor or importing distributor, and (vi) with 18the prior  approval of the State Commission, annually transfer 19no more than 5,000 gallons of spirits manufactured on the 20premises to a   licensed distilling pub wholly owned and 21operated by the same  licensee. 22    A distilling pub licensee shall not under any circumstance  23sell or offer for sale spirits manufactured by the distilling  24pub licensee to retail licensees. 25    A person who holds a class 2 craft distiller license may  26simultaneously hold a distilling pub license if the class 2   SB2216- 40 -LRB103 26981 RPS 53348 b1craft  distiller (i) does not, under any circumstance, sell or 2offer  for sale spirits manufactured by the class 2 craft 3distiller to retail  licensees; (ii) does not hold more than 3 4distilling pub  licenses in this State; (iii) does not 5manufacture more than a  combined 100,000 gallons of spirits 6per year, including the  spirits manufactured at the distilling 7pub; and (iv) is not a  member of or affiliated with, directly 8or indirectly, a  manufacturer that produces more than 100,000 9gallons of spirits per year or any other alcoholic liquor. 10    (v) A craft distiller warehouse permit may be issued to 11the  holder of a class 1 craft distiller or class 2 craft 12distiller license. The craft  distiller warehouse permit shall 13allow the holder to store or  warehouse up to 500,000 gallons of 14spirits manufactured by the  holder of the permit at the 15premises specified on the permit.  Sales to non-licensees are 16prohibited at the premises specified  in the craft distiller 17warehouse permit. 18    (w) A beer showcase permit license shall allow an 19Illinois-licensed distributor to transfer a portion of its 20beer inventory from its licensed premises to the premises 21specified in the beer showcase permit license, and, in the 22case of a class 1 brewer, class 2 brewer, or class 3 brewer, 23transfer only beer the class 1 brewer, class 2 brewer, or class 243 brewer manufactures from its licensed premises to the 25premises specified in the beer showcase permit license; and to 26sell or offer for sale at retail, only in the premises   SB2216- 41 -LRB103 26981 RPS 53348 b1specified in the beer showcase permit license, the transferred 2or delivered beer for on or off premise consumption, but not 3for resale in any form and to sell to non-licensees not more 4than 96 fluid ounces of beer per person. A beer showcase permit 5license may be granted for the following time periods: one day 6or less; or 2 or more days to a maximum of 15 days per location 7in any 12-month period. An applicant for a beer showcase 8permit license must also submit with the application proof 9satisfactory to the State Commission that the applicant will 10provide dram shop liability insurance to the maximum limits 11and have local authority approval. The State Commission shall 12require the beer showcase applicant to comply with Section 136-27.1. 14(Source: P.A. 101-16, eff. 6-14-19; 101-31, eff. 6-28-19; 15101-81, eff. 7-12-19; 101-482, eff. 8-23-19; 101-517, eff. 168-23-19; 101-615, eff. 12-20-19; 101-668, eff. 1-1-22; 17102-442, eff. 8-20-21; revised 2-28-22.) 18    (235 ILCS 5/6-40 new)19    Sec. 6-40. Consumer loyalty and reward programs.20    (a) In this Section, \"consumer loyalty and reward program\" 21means any program offered to consumers by a licensed retailer 22or manufacturer with retail privileges designed to allow a 23consumer to access rewards for purchases made at the retailer. 24\"Consumer loyalty and reward program\" includes, but is not 25limited to, point accumulation programs, memberships in   SB2216- 42 -LRB103 26981 RPS 53348 b1retailer clubs or organizations, email lists or other forms of 2registration by a consumer in a retailer program, or mug 3clubs.4    (b) Any retail licensee or licensed manufacturer with 5retail privileges may offer incentives to consumers for 6participation in a consumer loyalty and reward program.7    (c) Any retail licensee or licensed manufacturer with 8retail privileges may, as part of a consumer loyalty and 9reward program, offer consumers discounts on its products.10    (d) Any retail licensee or licensed manufacturer with 11retail privileges may offer benefits to the members or 12participants of a consumer loyalty and reward program that are 13not offered to other consumers.14    (e) Any retail licensee or licensed manufacturer with 15retail privileges may offer specialty glassware for sale to 16members or participants in a consumer loyalty and reward 17program and offer a price discount to the owner of that 18glassware for additional purchases using the glassware.  19    (235 ILCS 5/8-10.5)20    Sec. 8-10.5. Beer production quantity reporting.21    (a) As used in this Section:22    \"Directly\" means that a licensed distributor was not used 23in the transaction.24    \"Final packaging container\" means the last vessel in which 25beer is held before (i) consumption by an individual on the   SB2216- 43 -LRB103 26981 RPS 53348 b1brewer's licensed premises; (ii) being placed in a keg, 2bottle, or can for consumption by an individual; or (iii) 3being removed for additional fermentation and aging in a cask 4or barrel.5    (b) A brewer who is a class 1 brewer, class 2 brewer, class 63 brewer, or brew pub licensee shall accurately measure the 7quantity of beer transferred into its final packaging 8container to determine the brewer's tax liability by 9converting beer production into the amount of beer sold and to 10ensure compliance with any production or self-distribution 11quantity limitations under this Act applicable to the class 1 12brewer, class 2 brewer, class 3 brewer, or brew pub. The 13measurement shall comply with 27 CFR 25.41 and 27 CFR 25.42.  14Any brewer subject to this Section shall file, on the same date 15as the brewer files similar reports with the U.S. Department 16of the Treasury's Tobacco and Alcohol Tax and Trade Bureau, 17with the Department and State Commission a report of their use 18of water along with their \"Brewer's Report of Operations\" 19filed with the U.S. Department of Treasury's Alcohol and 20Tobacco Tax and Trade Bureau and shall maintain and produce 21for examination and inspection by the Department and the State 22Commission utility bills for water for 3 years along with 23their \"Brewer's Report of Operations\" filed with the U.S. 24Department of Treasury's Alcohol and Tobacco Tax and Trade 25Bureau.  The Department, in cooperation with the State 26Commission, may audit on an annual basis the amount a class 1   SB2216- 44 -LRB103 26981 RPS 53348 b1brewer, class 2 brewer, class 3 brewer, or brew pub licensee 2produces to determine compliance with this Act.3    (c) A brewer's failure to comply with this Section  shall 4result in the State Commission issuing a fine or suspending or 5revoking the brewer's license.\n6(Source: P.A. 102-442, eff. 8-20-21.)\n\n\n\n\n\n"
    },
    "ocd-bill/18095432-0323-4682-a085-41f7d3249096": {
        "id": "ocd-bill/18095432-0323-4682-a085-41f7d3249096",
        "state": "Illinois",
        "title": "INS-PROSTHETIC DEVICE COVERAGE",
        "chamber": "Senate",
        "created_date": "2023-02-11",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB2195sam001.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB2195\n\n\n\n\nSB2195sam001 103RD GENERAL ASSEMBLY  Sen. Ann GillespieFiled: 3/6/2023   \r\n10300SB2195sam001LRB103 28476 BMS 58490 a\r\n1AMENDMENT TO SENATE BILL 2195 \r\n\r\n2    AMENDMENT NO. ______. Amend Senate Bill 2195 on page 4, 3immediately below line 13, by inserting the following:\r\n\r\n 4    \"Section 99. Effective date. This Act takes effect January 51, 2025.\".\r\n\r\n\n\n\n\n"
    },
    "ocd-bill/38f967ba-9287-4f34-841c-35e72e443c94": {
        "id": "ocd-bill/38f967ba-9287-4f34-841c-35e72e443c94",
        "state": "Illinois",
        "title": "COUNSELING COMPACT",
        "chamber": "Senate",
        "created_date": "2023-02-11",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB2123sam001.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB2123\n\n\n\n\nSB2123sam001 103RD GENERAL ASSEMBLY  Sen. Laura FineFiled: 3/3/2023   \r\n10300SB2123sam001LRB103 26875 AWJ 57830 a\r\n1AMENDMENT TO SENATE BILL 2123 \r\n\r\n2    AMENDMENT NO. ______. Amend Senate Bill 2123 on page 3, 3line 24, by replacing \"participation in, or completion of,\" 4with \"completion of\"; and\r\n\r\n 5on page 9, immediately below line 5, by inserting the 6following:7            \"c. A Licensing Board may conduct national 8        background checks by submitting fingerprints to the 9        Federal Bureau of Investigation through the Member 10        State's statewide policing authority. However, reports 11        from the background checks may not be shared with 12        entities outside of the Member State. Applicants shall 13        be responsible for all fees associated with the 14        performance of  the background checks.\".\r\n\r\n\n\n\n\n"
    },
    "ocd-bill/aed3f51d-457f-49b3-a631-ee978e0a7a21": {
        "id": "ocd-bill/aed3f51d-457f-49b3-a631-ee978e0a7a21",
        "state": "Illinois",
        "title": "ELEC CD-VOTER REG APPLICATIONS",
        "chamber": "Senate",
        "created_date": "2023-02-09",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB2023sam001.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB2023\n\n\n\n\nSB2023sam001 103RD GENERAL ASSEMBLY  Sen. Ram VillivalamFiled: 3/6/2023   \r\n10300SB2023sam001LRB103 24817 BMS 58394 a\r\n1AMENDMENT TO SENATE BILL 2023 \r\n\r\n2    AMENDMENT NO. ______. Amend Senate Bill 2023 on page 20, 3line 20 through line 23, by replacing \"a notice that the 4individual will be registered to vote unless the individual 5declines to be registered and that if the individual wishes to 6decline to be registered, the individual may return a postage 7prepaid notice of declination\" with \"the following statement: 8\"After your recent visit to an Illinois Secretary of State 9Driver Services facility, we started an automatic voter 10registration process for you. You will be registered to vote 11unless you complete, sign, and return this card by [deadline 12date].\"\"; and\r\n\r\n 13on page 21, line 23, by replacing \"21\" with \"23\"; and 14on page 22, line 1, by replacing \"21\" with \"23\"; and 15on page 24, line 13, by replacing \"21\" with \"23\"; and   10300SB2023sam001- 2 -LRB103 24817 BMS 58394 a1on page 24, line 14, by replacing \"21-day\" with \"23-day\".\n\n\n\n\n\n"
    },
    "ocd-bill/36e448fd-8148-4316-bfc8-4f586b349287": {
        "id": "ocd-bill/36e448fd-8148-4316-bfc8-4f586b349287",
        "state": "Illinois",
        "title": "EPA-COMPLIANCE AGREEMENTS",
        "chamber": "Senate",
        "created_date": "2023-02-09",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB1933sam001.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB1933\n\n\n\n\nSB1933sam001 103RD GENERAL ASSEMBLY  Sen. Laura EllmanFiled: 3/6/2023   \r\n10300SB1933sam001LRB103 24925 LNS 58473 a\r\n1AMENDMENT TO SENATE BILL 1933\r\n\r\n2    AMENDMENT NO. ______. Amend Senate Bill 1933 on page 5, 3line 19, after \"period\" by inserting \"not to exceed an 4additional 30 days\"; and 5on page 6, line 2, after \"period\" by inserting \"not to exceed 6an additional 30 days\"; and 7on page 14, line 8, by deleting \"by personal service or\".\r\n\r\n\r\n\r\n\n\n\n\n"
    },
    "ocd-bill/6adc97d1-681a-4a26-805c-b055f57f866b": {
        "id": "ocd-bill/6adc97d1-681a-4a26-805c-b055f57f866b",
        "state": "Illinois",
        "title": "RTA-ZERO-EMISSION BUS CONTRACT",
        "chamber": "Senate",
        "created_date": "2023-02-09",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB1864.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB1864\n\n\n\n\nSB1864 103RD GENERAL ASSEMBLY  \r\n  \r\n  103RD GENERAL ASSEMBLY\r\nState of Illinois\r\n2023 and 2024SB1864 Introduced 2/9/2023, by Sen. Mike Simmons SYNOPSIS AS INTRODUCED: \r\n 70 ILCS 3615/2.10a new30 ILCS 805/8.47 new\r\n     Amends the Regional Transportation Authority Act. Provides that, after the effective date of the amendatory Act, a Service Board may not enter into a contract or contract amendment to purchase a bus that is not a zero-emission bus for the purpose of the Service Board's transit bus fleet. Amends the State Mandates Act to require implementation without reimbursement. Effective immediately.\r\n  LRB103 29115 AWJ 55501 bSTATE MANDATES ACT MAY REQUIRE REIMBURSEMENTMAY APPLY\r\n\t\t\t\t\t  A BILL FOR \r\n  SB1864LRB103 29115 AWJ 55501 b\r\n  1    AN ACT concerning local government.\r\n   2    Be it enacted by the People of the State of Illinois,\r\n 3represented in the General Assembly:\r\n  \r\n  4    Section 5. The Regional Transportation Authority Act is 5amended  by adding Section 2.10a as follows: 6    (70 ILCS 3615/2.10a new)7    Sec. 2.10a. Zero-emission buses.8    (a) As used in this Section:9    \"Zero-emission bus\" means a bus that is:10        (1) designed to carry more than 10 passengers and is 11    used to carry passengers for compensation.12        (2) a zero-emission vehicle; and13        (3) not a taxi.14    \"Zero-emission vehicle\" means a fuel cell or electric 15vehicle that:16        (1) is a motor vehicle;17        (2) is made by a commercial manufacturer;18        (3) is manufactured primarily for use on public 19    streets, roads, and highways;20        (4) has a maximum speed capability of at least 55 21    miles per hour;22        (5) is powered entirely by electricity or powered by 23    combining hydrogen and oxygen, which runs the motor;  SB1864- 2 -LRB103 29115 AWJ 55501 b1        (6) has an operating range of at least 100 miles; and2        (7) produces only water vapor and heat as byproducts.3    (b) A Service Board may not enter into a contract or 4contract amendment after the effective date of this amendatory 5Act of the 103rd General Assembly to purchase a bus that is not 6a zero-emission bus for the purpose of the Service Board's 7transit bus fleet. 8    Section 90. The State Mandates Act is amended by adding 9Section 8.47 as follows: 10    (30 ILCS 805/8.47 new)11    Sec. 8.47. Exempt mandate. Notwithstanding Sections 6 and 128 of this Act, no reimbursement by the State is required for 13the implementation of any mandate created by this amendatory 14Act of the 103rd General Assembly. \n15    Section 99. Effective date. This Act takes effect upon 16becoming law. \n\n\n\n\n\n"
    },
    "ocd-bill/cc37bbf5-2e7c-4553-a1eb-19d55b797042": {
        "id": "ocd-bill/cc37bbf5-2e7c-4553-a1eb-19d55b797042",
        "state": "Illinois",
        "title": "LYME DISEASE INNOVATION PROG",
        "chamber": "Senate",
        "created_date": "2023-02-09",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB1803.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB1803\n\n\n\n\nSB1803 103RD GENERAL ASSEMBLY  \r\n  \r\n  103RD GENERAL ASSEMBLY\r\nState of Illinois\r\n2023 and 2024SB1803 Introduced 2/9/2023, by Sen. Laura M. Murphy SYNOPSIS AS INTRODUCED: \r\n 20 ILCS 805/805-72 new20 ILCS 862/3620 ILCS 862/36.3 new30 ILCS 105/5.990 new\r\n     Amends the Department of Natural Resources (Conservation) Law of the Civil Administrative Code of Illinois. Provides that the Department of Natural Resources shall coordinate with the Department of Agriculture, the Department of Public Health, and members of the University of Illinois' INHS Medical Entomology Program to establish the Lyme Disease Innovation Program no later than one year after the effective date of the amendatory Act. Provides that the Department shall contract with a not-for-profit organization whose purpose is to raise awareness of tick-borne diseases with the public and the medical community to operate the Program. Provides that the Program's purpose is to raise awareness with the public and to assist persons at risk of Lyme disease and other tick-borne diseases with education and awareness materials and campaigns while developing evidence-based approaches that are cost-effective.  Includes provisions relating to the Program's objectives. Provides that the Program shall be funded by the Lyme Disease Awareness Fund. Amends the Recreational Trails of Illinois Act. Provides that the Department of Natural Resources shall issue to an off-highway vehicle owner an Off-Highway Vehicle Usage Stamp, and the Stamp shall be $10 or $5 depending on the size of the vehicle's engine capacity. Provides that the proceeds from the Stamp must be deposited into the Lyme Disease Awareness Fund. Makes a conforming change. Amends the State Finance Act to make a conforming change. Effective immediately.\r\n  LRB103 27408 AWJ 57003 b  A BILL FOR \r\n  SB1803LRB103 27408 AWJ 57003 b\r\n  1    AN ACT concerning State government.\r\n   2    Be it enacted by the People of the State of Illinois,\r\n 3represented in the General Assembly:\r\n  \r\n  4    Section 5. The Department of Natural Resources 5(Conservation) Law of the\r\nCivil Administrative Code of 6Illinois is amended  by adding Section 805-72 as follows: 7    (20 ILCS 805/805-72 new)8    Sec. 805-72. Lyme Disease Innovation Program.9    (a) The Department shall coordinate with the Department of 10Agriculture, the Department of Public Health, and members of 11the University of Illinois' INHS Medical Entomology Program to 12establish the Lyme Disease Innovation Program no later than 13one year after the effective date of this amendatory Act of the 14103rd General Assembly.  The Department shall contract with a 15not-for-profit organization whose purpose is to raise 16awareness of tick-borne diseases with the public and the 17medical community to operate the Program. The Program's 18purpose is to raise awareness with the public and to assist 19persons at risk of Lyme disease and other tick-borne diseases 20with education and awareness materials and campaigns while 21developing evidence-based approaches that are cost-effective.22    (b) The Program shall implement a statewide interagency 23and multipronged approach to combat Lyme disease and other   SB1803- 2 -LRB103 27408 AWJ 57003 b1tick-borne diseases in Illinois, including adopting an 2evidence-based model that recognizes the key roles that 3patients, advocates, and not-for-profit organizations have in 4fighting Lyme disease and tick-borne diseases.  The Program's 5objectives include:6        (1) bringing awareness of Lyme disease and tick-borne 7    diseases by any one or  more of the following methods:8            (A) creating innovative ideas and collaborations 9        for raising awareness about risks and prevention;10            (B) amplifying and improving access to essential 11        information supporting innovations in prevention, 12        education, and care with open data and science;13            (C) fostering the development of new, 14        community-based education and prevention efforts; and15            (D) using programs, website advertising, 16        pamphlets, or other methods to increase the awareness 17        of Lyme disease and tick-borne diseases;18        (2) engaging stakeholders to facilitate 19    patient-centered innovations by (i) building trust among 20    stakeholders through listening sessions, roundtables, and 21    other learning approaches that ground innovations in lived 22    experience, (ii) engaging stakeholders in identifying 23    current areas of need to promote targeted innovations that 24    will make real-world improvements in quality of care, and 25    (iii) gaining insight into patient needs and priorities 26    through stakeholders' collective wisdom and applying that   SB1803- 3 -LRB103 27408 AWJ 57003 b1    wisdom in shaping future innovation challenges and events.2        (3) advance stakeholder driven interdisciplinary and 3    interagency collaborations by providing resources to 4    not-for-profit organizations whose purpose is to raise 5    awareness of tick-borne diseases with the public and the 6    medical community in order to (i) facilitate the 7    stakeholder engagement and collaborations and 8    patient-centered innovations and support groups, (ii) 9    identify ways to better collect and share data while 10    raising awareness of tick-borne illnesses, and (iii) 11    assist with the development of outreach and education 12    materials and approaches for State agencies.13    (c) The Program shall be funded through moneys deposited 14into the Lyme Disease Awareness Fund and other appropriations.  15The not-for-profit organization contracted with to operate the 16Program shall be paid for its operation of the Program from 17moneys deposited into the Fund or from other appropriations.18    (d) The Department, the Department of Agriculture, and the 19Department of Public Health must adopt rules or joint rules to 20implement this Section.  21    Section 10. The Recreational Trails of Illinois Act is 22amended  by changing Section 36 and  by adding Section 36.3 as 23follows: 24    (20 ILCS 862/36)  SB1803- 4 -LRB103 27408 AWJ 57003 b1    Sec. 36. Falsification.  No person shall falsely alter or 2change in any manner the Off-Highway Vehicle Usage Stamp or 3Off-Highway Vehicle Lyme Disease Awareness Stamp issued under 4the provisions of this Act, or falsify any record required by 5this Act, or counterfeit any form of license provided for by 6this Act.  Any person found guilty of this Section shall be 7guilty of a Class A misdemeanor. \n8(Source: P.A. 97-1136, eff. 1-1-13.) 9    (20 ILCS 862/36.3 new)10    Sec. 36.3. Off-Highway Vehicle Lyme Disease Awareness 11Stamp.12    (a) As used in this Section, \"Stamp\" means an Off-Highway 13Vehicle Lyme Disease Awareness Stamp.14    (b) The Department shall issue to an off-highway vehicle 15owner an Off-Highway Vehicle Usage Stamp. The Stamp is a 16separate and additional requirement from the other off-highway 17vehicle stickers or stamps under this Act. Except as provided 18in this Section, a person shall not, on or after March 1, 2024, 19operate any off-highway vehicle within the State unless the 20off-highway vehicle has attached a Stamp purchased and 21displayed in accordance with the provisions of this Section. 22The Department shall adopt rules for the purchase of Stamps.23    (c) The fee for a Stamp for a vehicle with an engine 24capacity of over 75 cubic centimeters shall be $10 annually 25and shall expire the March 31st following the year displayed   SB1803- 5 -LRB103 27408 AWJ 57003 b1on the Stamp. The fee for a Stamp for a vehicle with an engine 2capacity of 75 cubic centimeters or below shall be $5 annually 3and shall expire the March 31st following the year displayed 4on the Stamp.5    The Department shall deposit all moneys from the sale of 6each Stamp into the Lyme Disease Awareness Fund, a special 7fund that is created in the State treasury, and, as directed by 8the Department, may be expended for the Lyme Disease 9Innovation Program under Section 805-72 of the Department of 10Natural Resources (Conservation) Law of the Civil 11Administrative Code of Illinois.12    (d) The owner of an off-highway vehicle shall prominently 13display the Stamp on the forward half of the off-highway 14vehicle.15    (e) The operator of an off-highway vehicle must purchase a 16new Stamp if a previous Stamp is destroyed, lost, stolen, or 17mutilated beyond legibility. A valid Stamp already displayed 18on an off-highway vehicle that is sold or transferred remains 19valid until the date the Stamp expires.20    (f) The operator of an off-highway vehicle is not required 21to display a Stamp if the off-highway vehicle falls into any of 22the exceptions from display under Section 34. \n 23    Section 90. The State Finance Act is amended by adding 24Section 5.990 as follows:   SB1803- 6 -LRB103 27408 AWJ 57003 b1    (30 ILCS 105/5.990 new)2    Sec. 5.990. The Lyme Disease Awareness Fund. 3    Section 99. Effective date. This Act takes effect upon 4becoming law.\n\n\n\n\n"
    },
    "ocd-bill/f179ec42-a035-4c26-a523-aa37817408bd": {
        "id": "ocd-bill/f179ec42-a035-4c26-a523-aa37817408bd",
        "state": "Illinois",
        "title": "REGULATION-TECH",
        "chamber": "Senate",
        "created_date": "2023-02-09",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB1775.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB1775\n\n\n\n\nSB1775 103RD GENERAL ASSEMBLY  \r\n\r\n103RD GENERAL ASSEMBLY\r\nState of Illinois\r\n2023 and 2024SB1775 Introduced 2/9/2023, by Sen. Adriane Johnson SYNOPSIS AS INTRODUCED: 220 ILCS 5/1-101  from Ch. 111 2/3, par. 1-101\r\n\r\n    Amends the Public Utilities Act.  Makes a technical change in the short title\r\nSection.\r\nLRB103 28931 AMQ 55317 b  A BILL FOR \r\nSB1775LRB103 28931 AMQ 55317 b\r\n1    AN ACT concerning regulation.\r\n 2    Be it enacted by the People of the State of Illinois, 3represented in the General Assembly: \r\n 4    Section 5. The Public Utilities Act is amended by changing 5Section 1-101 as follows: \r\n\r\n\r\n6    (220 ILCS 5/1-101)  (from Ch. 111 2/3, par. 1-101)\r\n\r\n\r\n7    Sec. 1-101. Short title. This Act may be cited as\r\nthe\r\nthe\r\n8Public Utilities Act.9(Source: P.A. 86-1475.)\r\n\r\n\n\n\n\n"
    },
    "ocd-bill/08ee41c7-9fd8-47f2-bbcc-f6799b3302ba": {
        "id": "ocd-bill/08ee41c7-9fd8-47f2-bbcc-f6799b3302ba",
        "state": "Illinois",
        "title": "VEH CD-STOLEN VEHICLE HOTLINES",
        "chamber": "Senate",
        "created_date": "2023-02-09",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB1753.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB1753\n\n\n\n\nSB1753 103RD GENERAL ASSEMBLY  \r\n  \r\n  103RD GENERAL ASSEMBLY\r\nState of Illinois\r\n2023 and 2024SB1753 Introduced 2/9/2023, by Sen. Michael E. Hastings SYNOPSIS AS INTRODUCED: \r\n 625 ILCS 5/4-110 new625 ILCS 5/4-111 new\r\n     Amends the Illinois Vehicle Code. Provides that in a county having a population of 3,000,000 or more, the county sheriff shall establish with other law enforcement agencies a vehicle theft hotline to facilitate the location of stolen vehicles via their installed existing global positioning systems, collaborate with vehicle manufacturers and dealers to provide information and assistance to law enforcement officers in the investigation of vehicle theft, and ensure that consumers are provided with information concerning the hotline and any new or used vehicle manufactured with a global positioning system by publishing the information in a conspicuous location on the county sheriff's website. Provides that the manufacturer of any vehicle sold in this State shall establish a hotline available to State, county, and local law enforcement agencies exclusively for the purposes of law enforcement information sharing and the electronic tracking of vehicles stolen in vehicular hijacking incidents or that have been used in the commission of kidnapping, aggravated battery with a firearm, attempted homicide, or homicide. Provides that the manufacturer's hotline shall relay vehicle location information, including real-time vehicle location information whenever possible, to the 9-1-1 call center or designated dispatch center for the responding agency, to the best of the manufacturer's technical capability. Requires State, county, and local law enforcement agencies to use their respective 9-1-1 system call centers or designated dispatch centers for the purpose of verification of law enforcement officers' identities and bona fide incident report numbers related to incidents. Requires manufacturers to prepare written statements detailing tracking and disabling system capabilities and make them available to State, county, and local law enforcement agencies upon request. Requires that, if a vehicle is not subscribed to the manufacturer's tracking service, the manufacturer of any vehicle sold in this State shall waive all fees associated with initiating, renewing, reestablishing, or maintaining the location, disabling, or alert service with which the vehicle is equipped during a law enforcement response or investigation of specified offenses.\r\n  LRB103 25365 HEP 51710 b  A BILL FOR \r\n  SB1753LRB103 25365 HEP 51710 b\r\n  1    AN ACT concerning transportation.\r\n   2    Be it enacted by the People of the State of Illinois,\r\n 3represented in the General Assembly:\r\n  \r\n  4    Section 5. The Illinois Vehicle Code is amended  by adding 5Sections 4-110 and 4-111 as follows: 6    (625 ILCS 5/4-110 new)7    Sec. 4-110. Stolen vehicle recovery hotline. In a county 8having a population of 3,000,000 or more, the county sheriff 9shall establish with other law enforcement agencies a vehicle 10theft hotline to facilitate the location of stolen vehicles 11via their installed existing global positioning systems. The 12county sheriff shall collaborate with vehicle manufacturers 13and dealers to provide information and assistance to law 14enforcement officers in the investigation of vehicle theft and 15ensure that consumers are provided with information concerning 16the hotline and any new or used vehicle manufactured with a 17global positioning system by publishing the information in a 18conspicuous location on the county sheriff's website. 19    (625 ILCS 5/4-111 new)20    Sec. 4-111. Manufacturer's vehicle incident hotline; law 21enforcement verification; manufacturer statements.22    (a) A manufacturer of any vehicle sold in this State shall   SB1753- 2 -LRB103 25365 HEP 51710 b1establish a hotline that is staffed 24 hours a day, 7 days a 2week available to State, county, and local law enforcement 3agencies and their respective 9-1-1 system call centers or 4designated dispatch centers exclusively for the purposes of 5law enforcement information sharing and the electronic 6tracking of vehicles stolen in vehicular hijacking incidents 7or that have been used in the commission of kidnapping, 8aggravated battery with a firearm, attempted homicide, or 9homicide.  The manufacturer's hotline shall relay vehicle 10location information, including real-time vehicle location 11information whenever possible, to the 9-1-1 call center or 12designated dispatch center for the responding agency, to the 13best of the manufacturer's technical capability.14    (b)  State, county, and local law enforcement agencies 15shall use their respective 9-1-1 system call centers or 16designated dispatch centers for the purpose of verification of 17law enforcement officers' identities and bona fide incident 18report numbers related to incidents.19    (c)  By January 1 of each year, a manufacturer of any 20vehicle sold in this State shall prepare an annual written 21statement detailing the manufacturer's tracking and disabling 22system capabilities, including, but not limited to, real-time 23turn-by-turn, interval pinging, slow down, engine cutoff, and 24alarm or light activation, per model, trim, and year.  The 25manufacturer shall make the annual written statement available 26to State, county, and local law enforcement agencies upon   SB1753- 3 -LRB103 25365 HEP 51710 b1request.  A manufacturer shall provide its annual written 2statement to the requesting law enforcement agency within 30 3days after the request.4    (d) If a vehicle is not subscribed to the manufacturer's 5tracking service, the manufacturer of any vehicle sold in this 6State shall waive all fees associated with initiating, 7renewing, reestablishing, or maintaining the location, 8disabling, or alert service with which the vehicle is equipped 9during a law enforcement response or investigation of the 10specified offenses in subsection (a). \n\n\n\n\n\n"
    },
    "ocd-bill/1e0bed1b-f4f8-4126-9bd5-3859035d9827": {
        "id": "ocd-bill/1e0bed1b-f4f8-4126-9bd5-3859035d9827",
        "state": "Illinois",
        "title": "PRIVATE DETECTIVE ACT-MISC",
        "chamber": "Senate",
        "created_date": "2023-02-09",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB1717sam001.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB1717\n\n\n\n\nSB1717sam001 103RD GENERAL ASSEMBLY  Sen. Suzy Glowiak HiltonFiled: 3/6/2023   \r\n10300SB1717sam001LRB103 28372 SPS 58198 a\r\n1AMENDMENT TO SENATE BILL 1717 \r\n\r\n2    AMENDMENT NO. ______. Amend Senate Bill 1717 on page 16, 3line 6, by deleting \"federal\".\r\n\r\n\r\n\r\n\n\n\n\n"
    },
    "ocd-bill/c98c6767-e332-46a3-818b-d54e838b5709": {
        "id": "ocd-bill/c98c6767-e332-46a3-818b-d54e838b5709",
        "state": "Illinois",
        "title": "CERT SHORTHAND REPORT-VARIOUS",
        "chamber": "Senate",
        "created_date": "2023-02-09",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB1714sam001.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB1714\n\n\n\n\nSB1714sam001 103RD GENERAL ASSEMBLY  Sen. Suzy Glowiak HiltonFiled: 3/6/2023   \r\n10300SB1714sam001LRB103 28366 SPS 58200 a\r\n1AMENDMENT TO SENATE BILL 1714 \r\n\r\n2    AMENDMENT NO. ______. Amend Senate Bill 1714 as follows:\r\n\r\n 3on page 8, line 18, by deleting \"federal\"; and 4on page 8, line 23, by deleting \"federal\".\r\n\r\n\n\n\n\n"
    },
    "ocd-bill/1a9f35ec-b2c4-464b-89af-e09d03b5c9b5": {
        "id": "ocd-bill/1a9f35ec-b2c4-464b-89af-e09d03b5c9b5",
        "state": "Illinois",
        "title": "PHYSICAL THERAPY COMPACT",
        "chamber": "Senate",
        "created_date": "2023-02-09",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB1699sam001.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB1699\n\n\n\n\nSB1699sam001 103RD GENERAL ASSEMBLY  Sen. Ram VillivalamFiled: 3/6/2023   \r\n10300SB1699sam001LRB103 27684 SPS 58663 a\r\n1AMENDMENT TO SENATE BILL 1699 \r\n\r\n2    AMENDMENT NO. ______. Amend Senate Bill 1699 as follows:\r\n\r\n 3on page 1, line 5, by replacing \"Section\" with \"Sections 8.7 4and\"; and 5on page 1, immediately below line 5, by inserting the 6following: 7    \"(225 ILCS 90/8.7 new)8    Sec. 8.7. Criminal history records background check. Each 9applicant for licensure under Sections 8, 8.1, and 11 shall 10have his or her fingerprints submitted to the Illinois State 11Police in an electronic format that complies with the form and 12manner for requesting and furnishing criminal history record 13information as prescribed by the Illinois State Police. These 14fingerprints shall be checked against the Illinois State 15Police and Federal Bureau of Investigation criminal history   10300SB1699sam001- 2 -LRB103 27684 SPS 58663 a1record databases now and hereafter filed. The Illinois State 2Police shall charge applicants a fee for conducting the 3criminal history records check, which shall be deposited into 4the State Police Services Fund and shall not exceed the actual 5cost of the records check. The Illinois State Police shall 6furnish, pursuant to positive identification, records of 7Illinois convictions to the Department. The Department may 8require applicants to pay a separate fingerprinting fee, 9either to the Department or to a vendor designated or approved 10by the Department. The Department, in its discretion, may 11allow an applicant or licensee who does not have reasonable 12access to a designated vendor to provide his or her 13fingerprints in an alternative manner.  Communication between 14the Department and an interstate compact governing body or 15other entities may not include information received from the 16Federal Bureau of Investigation relating to a State and 17federal criminal history records check. The Department may 18adopt any rules necessary to implement this Section.\".\n\n\n\n\n\n"
    },
    "ocd-bill/fed28c69-9168-4c72-9e91-6861feddb9e5": {
        "id": "ocd-bill/fed28c69-9168-4c72-9e91-6861feddb9e5",
        "state": "Illinois",
        "title": "PUBLIC ACCOUNT ACT-VARIOUS",
        "chamber": "Senate",
        "created_date": "2023-02-09",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB1713sam001.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB1713\n\n\n\n\nSB1713sam001 103RD GENERAL ASSEMBLY  Sen. Suzy Glowiak HiltonFiled: 3/6/2023   \r\n10300SB1713sam001LRB103 27673 SPS 58202 a\r\n1AMENDMENT TO SENATE BILL 1713 \r\n\r\n2    AMENDMENT NO. ______. Amend Senate Bill 1713 as follows:\r\n\r\n 3on page 24, line 11, by deleting \"federal\"; and 4on page 24, line 16, by deleting \"federal\".\r\n\r\n\n\n\n\n"
    },
    "ocd-bill/bc5e62c8-6443-43ed-a24f-aa9f646a26cd": {
        "id": "ocd-bill/bc5e62c8-6443-43ed-a24f-aa9f646a26cd",
        "state": "Illinois",
        "title": "PROBATE-EXECUTOR",
        "chamber": "Senate",
        "created_date": "2023-02-08",
        "link": "https://ilga.gov/legislation/103/SB/PDF/10300SB1502.pdf",
        "text": "\n\nIllinois General Assembly - Full Text of SB1502\n\n\n\n\nSB1502 103RD GENERAL ASSEMBLY  \r\n  \r\n  103RD GENERAL ASSEMBLY\r\nState of Illinois\r\n2023 and 2024SB1502 Introduced 2/7/2023, by Sen. Adriane Johnson SYNOPSIS AS INTRODUCED: \r\n  755 ILCS 5/6-13  from Ch. 110 1/2, par. 6-13 \r\n     Amends the Probate Act of 1975. Provides that a person who has been convicted of a felony is qualified to act as an executor if: (i) the testator names that person as an executor and expressly acknowledges in the will that the testator is aware that the person has been convicted of a felony; and (ii) the person is otherwise qualified to act as an executor.\r\n  LRB103 24822 LNS 51153 b  A BILL FOR \r\n  SB1502LRB103 24822 LNS 51153 b\r\n  1    AN ACT concerning civil law.\r\n   2    Be it enacted by the People of the State of Illinois,\r\n 3represented in the General Assembly:\r\n  \r\n  4    Section 5. The Probate Act of 1975 is amended  by changing 5Section 6-13 as follows: \r\n\r\n\r\n6    (755 ILCS 5/6-13)  (from Ch. 110 1/2, par. 6-13)\r\n\r\n\r\n7    Sec. 6-13. Who may act as executor.) 8    (a)  A person who has attained\r\nthe age of 18 years, and is a 9resident of the United States, is not of\r\nunsound mind, is not 10an adjudged person with a disability as defined in this Act,\r\n11and, except as provided in subsection (c), has not been 12convicted of a felony, is qualified to act as executor.\r\n13    (b) If a person named as executor in a will is not 14qualified to act\r\nat the time of admission of the will to 15probate but thereafter becomes\r\nqualified and files a petition 16for the issuance of letters, takes oath\r\nand gives bond as 17executor, the court may issue letters testamentary to\r\nhim as 18co-executor with the executor who has qualified or if no 19executor\r\nhas qualified the court may issue letters 20testamentary to him and revoke\r\nthe letters of administration 21with the will annexed.\r\n22    (c) A person who has been convicted of a felony is 23qualified to act as an executor if: (i) the testator names that   SB1502- 2 -LRB103 24822 LNS 51153 b1person as an executor and expressly acknowledges in the will 2that the testator is aware that the person has been convicted 3of a felony; and (ii) the person is otherwise qualified to act 4as an executor under subsection (a). 5    (d) The court may in its discretion require a nonresident 6executor to furnish\r\na bond in such amount and with such surety 7as the court determines\r\nnotwithstanding any contrary provision 8of the will.\n9(Source: P.A. 99-143, eff. 7-27-15.)\n\n\n\n\n\n\n"
    }
}